#include <pokeagb/pokeagb.h>
#include "config.h"

struct PokedexData {
    pchar pokemon_type[12];
    u16 height;
    u16 weight;
    pchar* pokedex_description1;
	u8 padding[12];
};

#if (LANGUAGE == CHINESE)
	pchar PokedexUnknown[] = _("这是目前未发现分类的宝可梦");
	pchar PokedexDes1[] = _("会看到它在太阳底下睡午觉的样子\n在沐浴了充足的阳光后 它背上\n的种子就会茁壮成长");
	pchar PokedexDes2[] = _("它的腰腿会为了支撑背上的花苞而变强\n如果待在太阳底下一动不动的时间变\n长了 就表示大花即将盛开");
	pchar PokedexDes3[] = _("据说充足的营养和阳光会让花儿的\n颜色变得更加鲜艳 花香会治愈人\n心");
	pchar PokedexDes4[] = _("尾巴上的火焰代表着它的心情 当\n它开心时 火焰会摇曳晃动 而当\n它生气时 火焰就会剧烈燃烧");
	pchar PokedexDes5[] = _("它会用锋利的爪子无情地打倒对手\n如果遇到强敌 它就会兴奋不已\n尾巴上会燃起蓝白色的火焰");
	pchar PokedexDes6[] = _("会在空中飞来飞去寻找强大的对手\n对于比它弱小的对手 它不会吐\n出那可熔化一切的高温火焰");
	pchar PokedexDes7[] = _("甲壳的作用不仅仅是用来保护自己\n它圆润的外形和表面的沟槽会减\n小水的阻力 使它能快速地游动");
	pchar PokedexDes8[] = _("长满蓬松毛发的大尾巴的颜色 会\n随着年龄的增长而越变越深 甲壳\n上的伤痕是强者的证明");
	pchar PokedexDes9[] = _("甲壳上的喷射口能够精准地瞄准目\n标 打出的水弹可以命中50米外\n的空罐子");
	pchar PokedexDes10[] = _("或许是想要尽快长大 它的食欲非\n常旺盛 每天能吃掉100片叶子");
	pchar PokedexDes11[] = _("壳里面是黏糊糊的液体 为了准备\n迎接进化 正在不断地更新体内的\n细胞");
	pchar PokedexDes12[] = _("翅膀上覆盖着的鳞粉有剧毒 如果\n发现有鸟宝可梦要袭击绿毛虫 就\n会撒出鳞粉将它赶跑");
	pchar PokedexDes13[] = _("有着非常灵敏的嗅觉 能用大大的\n红鼻子闻出自己喜欢吃和不喜欢吃\n的叶子");
	pchar PokedexDes14[] = _("虽然挂在树上几乎一动不动 但体\n内却在为进化而忙碌地准备着 那\n证据就是它的身体会变得很热");
	pchar PokedexDes15[] = _("大针蜂的领地意识非常强 所以为\n了安全起见 不要接近它的住处\n它一生气 就会群起而攻之");
	pchar PokedexDes16[] = _("因为方向感非常好 所以无论离自\n己的巢穴多远 都能毫不迷路地飞\n回来");
	pchar PokedexDes17[] = _("会飞在空中巡视自己广阔的领地 要是\n有谁胆敢侵犯它的领地 它就会毫不留\n情地用利爪狠狠惩治一番");
	pchar PokedexDes18[] = _("有着靓丽羽毛的宝可梦 有很多训\n练家因拜倒在它美丽的头羽下而来\n培育大比鸟");
	pchar PokedexDes19[] = _("门牙会终生生长 但要是长得太长\n就会因无法进食而饿死");
	pchar PokedexDes20[] = _("据说会用后脚上小小的蹼泅水渡海\n穿越岛屿来躲避敌人的追击");
	pchar PokedexDes21[] = _("生性鲁莽 只要是为了保护自己的\n领地 即便对手是大型宝可梦 也\n仍会冲向对手");
	pchar PokedexDes22[] = _("在大嘴雀的领地上拿着食物走动可\n是相当危险的 食物转眼间就会被\n抢走");
	pchar PokedexDes23[] = _("甚至可以通过让颚脱位来吞食比自\n己更大的猎物 进食后就会蜷缩起\n身体进行休息");
	pchar PokedexDes24[] = _("根据最新的研究显示 它们腹部的\n花纹有着20种以上不同的图案");
	pchar PokedexDes25[] = _("有积存电力的特质 在皮卡丘群居\n的森林里会落雷不断 十分危险");
	pchar PokedexDes26[] = _("随着电力在体内的积聚 它会越发\n地具有攻击性 也有说法讲到其实\n电力就是它的压力");
	pchar PokedexDes27[] = _("栖息在雨量稀少的土地上 遇到危\n险就会蜷缩起身体 并以此来保护\n自己柔弱的腹部");
	pchar PokedexDes28[] = _("爪子和角经常会折断 折断的爪子\n和角会被制作成用来耕作土地的用\n具");
	pchar PokedexDes29[] = _("人们认为它是为了保护自己娇小的\n身体才长出了越来越强的毒针 生\n气后就会从角尖放出剧毒");
	pchar PokedexDes30[] = _("和伙伴以及家人在一起的时候 为了避\n免伤及彼此会把刺收起来 离开伙伴后\n好像就会变得不安起来");
	pchar PokedexDes31[] = _("擅长利用长满坚硬鳞片的身体将对\n手撞得弹飞起来的攻击 在保护幼\n崽的时候最为强大");
	pchar PokedexDes32[] = _("牵动耳朵的肌肉十分发达 可以随\n意将耳朵转动至任何方向 是无论\n多小的声音也不会听漏的宝可梦");
	pchar PokedexDes33[] = _("有着比钻石还要坚硬的角 感觉到\n敌人的气息时 背上的刺就会一起\n竖起来全力迎敌");
	pchar PokedexDes34[] = _("粗尾巴的挥击有着能将坚固铁塔都\n折断的惊人破坏力 一旦陷入狂暴\n就拿它没办法了");
	pchar PokedexDes35[] = _("虽然深受人们的喜爱 但由于数量\n稀少故而十分珍贵 如果随便把它\n带出来炫耀 就会被小偷盯上哦");
	pchar PokedexDes36[] = _("连1公里外针落地的声音都能听到\n所以它生活在鲜有人或宝可梦出\n入的深山里");
	pchar PokedexDes37[] = _("因漂亮的尾巴而深受人们喜爱 但\n是 如果不经常给其梳理毛发 很\n快就会变得全是毛球");
	pchar PokedexDes38[] = _("性格执拗 爱记仇 一旦遭到它的\n怨恨 它便会在1000年间不断\n作祟 连对方的子孙都不放过");
	pchar PokedexDes39[] = _("可以在百货商店的寝具区买到收录\n有胖丁那神奇摇篮曲的CD");
	pchar PokedexDes40[] = _("富有弹性的身体和细腻的毛皮很受\n人们的喜爱 抱着它睡会感觉很惬\n意");
	pchar PokedexDes41[] = _("因为没有眼珠 所以无法视物 会\n从口中发出超音波来探测周围的情\n况");
	pchar PokedexDes42[] = _("因为它肚子太饿而去咬了钢属性宝\n可梦 所以偶尔会看见缺了牙的大\n嘴蝠");
	pchar PokedexDes43[] = _("白天会把身体埋进地里 并用全身\n吸收土壤中的营养 据说土壤越肥\n沃 叶子就会变得越有光泽");
	pchar PokedexDes44[] = _("感到危险的时候 雌蕊放出的臭味\n会变得更加强烈 但心平气和的时\n候就不会放出臭味");
	pchar PokedexDes45[] = _("毒花粉会引起严重的过敏反应 在\n丛林里就算发现了美丽的花朵 也\n不要随便接近比较好哦");
	pchar PokedexDes46[] = _("可能是湿气不够 也可能是营养不\n足 反正阿罗拉的派拉斯背上的蘑\n菇都长得不怎么样");
	pchar PokedexDes47[] = _("底下的虫子基本上死了 真正的本\n体是背上的蘑菇 如果蘑菇掉下来\n它就不会动了");
	pchar PokedexDes48[] = _("据说为了保护自己 变得全身长满\n了坚硬细小的体毛 有着不会放跑\n任何小猎物的眼睛");
	pchar PokedexDes49[] = _("具有夜行性 会在夜间开始活动\n喜欢捕食被路灯灯光吸引而聚集在\n一起的小虫子");
	pchar PokedexDes50[] = _("会在地下挖掘隧道移动 由于讨厌\n光线 所以会在太阳落山后来到地\n上");
	pchar PokedexDes51[] = _("三胞胎的感情一直很好 但在极少\n数情况下 也会为哪个脑袋先进食\n而激烈争吵");
	pchar PokedexDes52[] = _("如果去垃圾场的话 就能看到它和\n黑暗鸦为争夺发光的东西而激烈打\n斗的景象");
	pchar PokedexDes53[] = _("虽然额头上的宝石颜色和阿罗拉猫\n老大的不一样 但成分却没什么两\n样");
	pchar PokedexDes54[] = _("使用念力会头痛 所以平时会尽量\n不做任何事 就在发呆中度过哦");
	pchar PokedexDes55[] = _("即便是游得很快的鱼宝可梦 它也\n能用定身法定住其行动 并轻易地\n进行捕捉");
	pchar PokedexDes56[] = _("该宝可梦会因一点小事而立刻动怒\n由于不会积累压力 所以能活相\n当长的时间");
	pchar PokedexDes57[] = _("它不会原谅激怒它的人或宝可梦\n会持续地追击对方 就算把对方揍\n得无法动弹也依然不会原谅对方");
	pchar PokedexDes58[] = _("熟悉后便会与人亲近 但野生的卡\n蒂狗会和岩狗狗就领地而展开激烈\n的争夺");
	pchar PokedexDes59[] = _("流传着这样一个传说 很久以前\n它曾经和某位武将一起并肩战斗并\n治理国家");
	pchar PokedexDes60[] = _("虽然危险 却向往登上陆地 因为\n它还只能晃晃悠悠地走路 所以被\n敌人发现后会慌忙逃入水中");
	pchar PokedexDes61[] = _("虽然已经能在陆地上生活 但还是\n栖息在有大量鱼宝可梦可捕食的水\n中");
	pchar PokedexDes62[] = _("虽然在水宝可梦中是属于游泳健将\n那一类的 但平时却生活在陆地上");
	pchar PokedexDes63[] = _("即使是在睡梦中也会使用各种超能\n力 所以分辨不出它是不是醒着");
	pchar PokedexDes64[] = _("会盯着银汤匙来增强并放出精神力\n量 用金汤匙好像就不行");
	pchar PokedexDes65[] = _("手中的汤匙是胡地用超能力生成的\n每把汤匙都是这世上独一无二的");
	pchar PokedexDes66[] = _("在和伙伴们的锻炼中获得了自信和\n肌肉后 就会去向幕下力士挑战");
	pchar PokedexDes67[] = _("如果遇到了真正的强敌 就会解开\n腰上的力量限制腰带 并使出全力");
	pchar PokedexDes68[] = _("会用4只手臂捉住对手 并将其勒\n成一个复杂的形状 人称怪力式固\n定技");
	pchar PokedexDes69[] = _("无论多强的攻击 都可以通过弯曲\n纤细柔软的身体来回避 会从嘴里\n吐出连铁都能溶化的液体");
	pchar PokedexDes70[] = _("到了晚上就会用尾钩挂在树枝上睡\n觉 如果睡相不好 早上就会掉到\n地上哦");
	pchar PokedexDes71[] = _("会让长在脑袋上的藤蔓像小生物一\n样动来动去引诱猎物 等猎物接近\n时就会张开大嘴一口吞掉");
	pchar PokedexDes72[] = _("会漂浮在海边寻找猎物 虽然有毒\n的触手也会断掉 但过一段时间就\n会重新长出来");
	pchar PokedexDes73[] = _("从红色珠子中发出超音波使猎物变\n得虚弱后 就会用80根触手缠住\n对手");
	pchar PokedexDes74[] = _("活了很久的小拳石在身上的角被磨\n平后会变得圆滚滚的 性格也非常\n的冷静平稳");
	pchar PokedexDes75[] = _("会爬上山崖前往山顶 到达山顶后\n会立刻沿着来时的山路滚下去");
	pchar PokedexDes76[] = _("年老后就不会蜕皮了 活过了漫长\n岁月的隆隆岩身上的外皮会长满苔\n藓变成绿色");
	pchar PokedexDes77[] = _("虽然出生后立刻站起来十分不易\n但在跌倒中追赶双亲能帮助它锻炼\n出结实的腰腿");
	pchar PokedexDes78[] = _("虽然平时会很悠闲地在原野上到处乱跑\n但一旦认真起来 鬃毛上的火焰便会\n燃烧 会以240公里的时速开始奔跑");
	pchar PokedexDes79[] = _("有传说讲呆呆兽打哈欠就会下雨\n所以据说有些地方会供奉呆呆兽");
	pchar PokedexDes80[] = _("基本上一直在发呆 当尾巴被切断\n大舌贝脱落后 它就会变回呆呆\n兽");
	pchar PokedexDes81[] = _("因为它时常会引发停电 所以有些\n发电厂会发出小磁怪讨厌的电波");
	pchar PokedexDes82[] = _("会发出神秘的电波 在三合一磁怪\n栖息的地方 精密机器会发生故障");
	pchar PokedexDes83[] = _("手上拿着的植物茎好像有好有坏\n所以大葱鸭之间有时会为了争夺茎\n而彼此战斗");
	pchar PokedexDes84[] = _("2个脑袋从来不会同时睡着 为了\n防止在睡着时受到敌人袭击 所以\n它们会轮流望风");
	pchar PokedexDes85[] = _("3个脑袋朝着不同方向时 就是它\n在进行警戒的证明 不小心靠近的\n话就会被鸟嘴啄");
	pchar PokedexDes86[] = _("人们一直以为它只生活在寒冷的海\n域 它出现在阿罗拉的原因是个谜");
	pchar PokedexDes87[] = _("能以8节的速度在海里游动 并搜\n寻能当做猎物的宝可梦 特别喜欢\n吃弱丁鱼");
	pchar PokedexDes88[] = _("诞生于海底的污泥 在干净的地方\n它就会因体内的细菌无法增长而\n死去");
	pchar PokedexDes89[] = _("食物变少数量也会急剧减少 为了\n防止它灭绝 人们开始了制造人工\n污泥池");
	pchar PokedexDes90[] = _("虽然留在壳里的沙子终会变成珍珠\n但会因为碍事而被它吐掉");
	pchar PokedexDes91[] = _("拥有非常坚硬的外壳 外壳上的伤\n痕会逐渐隆起 长成大大的尖刺");
	pchar PokedexDes92[] = _("据说是怨念寄宿在了墓地散发出的\n气体中 并最终变成了宝可梦");
	pchar PokedexDes93[] = _("在没有月亮的晚上 鬼斯通会寻找\n可以诅咒的对象 所以不要外出走\n动比较好哦");
	pchar PokedexDes94[] = _("在世界各地都能听到耿鬼会去找坏\n孩子这样的传说");
	pchar PokedexDes95[] = _("因为脑内有磁铁 所以即使在地里\n挖洞前进也不会弄错方向 年纪越\n大身体就越圆润");
	pchar PokedexDes96[] = _("能在娱乐设施的附近见到其身影\n会偷吃那晚孩子们所做的美梦");
	pchar PokedexDes97[] = _("生活在阿罗拉的引梦貘人的目标主\n要是树枕尾熊 人倒不怎么会成为\n受害者");
	pchar PokedexDes98[] = _("会在沙滩上挖洞并生活在里面 在\n食物稀少的沙滩上 能够看到为抢\n地盘而争斗的大钳蟹们");
	pchar PokedexDes99[] = _("虽然巨钳蟹之间会通过挥舞巨大的\n钳子来传递信号 但由于钳子太重\n很快就会疲劳");
	pchar PokedexDes100[] = _("最早在制造精灵球的公司被发现\n以及它的外观十分酷似精灵球 这\n两点之间的联系至今还是个谜");
	pchar PokedexDes101[] = _("会吃空气中的电能 在有雷落下的\n日子里 吃下过多电力的顽皮雷弹\n会在各处大爆炸");
	pchar PokedexDes102[] = _("6只加在一起算1只 即便出于某\n些原因少了1只 到了次日清晨也\n一定会变回6只");
	pchar PokedexDes103[] = _("会用精神力量来迎击敌人 3个脑\n袋会分别放出念力 所以威力也会\n变成3倍");
	pchar PokedexDes104[] = _("会思念已故的母亲而在夜里哭叫\n因此会被其天敌秃鹰娜发现");
	pchar PokedexDes105[] = _("会用力扔骨头击落秃鹰娜 人们认\n为它这是在给亲人报仇");
	pchar PokedexDes106[] = _("会用能自由伸缩的腿施展强力踢把\n对手踢倒 战斗后会去按揉疲劳的\n双腿");
	pchar PokedexDes107[] = _("快拳郎有着不屈之心 永远不会气\n馁 据说在它体内寄宿着以世界冠\n军为目标的拳击手的灵魂");
	pchar PokedexDes108[] = _("不管是什么 都会用长舌头去舔舔\n看 被舔到的部位如果放着不管就\n会红肿发炎");
	pchar PokedexDes109[] = _("刺激它的话 瓦斯的毒素就会变强\n并会从身体各处猛烈喷出 胀成\n一个圆圆的球后会发生大爆炸");
	pchar PokedexDes110[] = _("非常喜欢腐烂的湿垃圾所产生的瓦斯\n会定居在不打扫卫生的人家中 并在夜\n深人静时去垃圾箱中寻找瓦斯");
	pchar PokedexDes111[] = _("会一个劲儿地向前直冲不停地破坏\n即使是撞上钢块也完全没事 但\n过了1天会感到稍微有点疼");
	pchar PokedexDes112[] = _("角能粉碎钻石原石 尾巴能一击扫\n塌大楼 坚硬的皮肤连大炮也无法\n伤及分毫");
	pchar PokedexDes113[] = _("其他宝可梦盯上了它那既美味又营\n养的蛋 在这追逐的过程中 它逃\n跑的速度好像变快了");
	pchar PokedexDes114[] = _("被敌人抓住后藤蔓会一下断开 因\n为完全不疼 所以它会趁那个空当\n逃走 第二天就能长出新的藤蔓");
	pchar PokedexDes115[] = _("会把自己的孩子放入腹袋里保护起\n来 对于胆敢伤害自己孩子的家伙\n会毫不留情地予以痛击");
	pchar PokedexDes116[] = _("吃小虫子或岩石滩上的苔藓 海流\n变快后 为了不让自己被冲走 就\n会用尾巴缠住岩石或珊瑚");
	pchar PokedexDes117[] = _("该宝可梦会潜入珊瑚枝的缝隙中睡\n觉 有些时候 人在采珊瑚时会因\n没有发现海刺龙而被毒刺扎伤");
	pchar PokedexDes118[] = _("虽然漂亮的尾鳍是其特征 但角金\n鱼之间好像会比谁的角更粗更尖锐");
	pchar PokedexDes119[] = _("头上的角会像钻头一样旋转 即便\n是坚硬的岩石也能一下子贯穿 雄\n性有着鲜艳的颜色");
	pchar PokedexDes120[] = _("在各地都流传着星屑掉到海里就会\n变成海星星这样的民间故事");
	pchar PokedexDes121[] = _("发光的核心被称为海之宝石 有人\n将它变成昂贵的饰品 在暗地里偷\n偷地买卖");
	pchar PokedexDes122[] = _("有着非凡的默剧表演实力 在你看\n入迷的时候 不知不觉间就会出现\n一面真正的墙壁");
	pchar PokedexDes123[] = _("2把锋利的镰刀并不单单是武器\n还能灵活地运用它们来切割猎物\n然后食用");
	pchar PokedexDes124[] = _("会按独特的节奏扭动腰部 栖息在\n阿罗拉的迷唇姐 那动作更是妙不\n可言");
	pchar PokedexDes125[] = _("全身都带着电 会一圈圈抡动手臂\n进行充电后再出拳");
	pchar PokedexDes126[] = _("全身都在燃烧 光是呼出的气息就\n带着高温 打喷嚏时会同时喷出火\n焰");
	pchar PokedexDes127[] = _("会和锹农炮虫争夺领地 在阿罗拉\n不知为何它和赫拉克罗斯的关系\n好像相当不错");
	pchar PokedexDes128[] = _("会组成一个群体生活 在群体中\n谁的角最粗最长 并伤痕累累 谁\n就是老大");
	pchar PokedexDes129[] = _("在非常遥远的过去 它还是十分强\n大的 但随着时间的推移 它变得\n越来越弱 越来越弱了");
	pchar PokedexDes130[] = _("能不断地吐出破坏光线 将周围一\n带燃烧殆尽 也有一些地区称其为\n破坏神");
	pchar PokedexDes131[] = _("喜欢乘载着人游泳 在阿罗拉地区\n这是重要的水上交通方式");
	pchar PokedexDes132[] = _("可以变身成任何东西 但好像每只\n百变怪都有着自己擅长和不擅长变\n形的东西");
	pchar PokedexDes133[] = _("至今未弄清为何只有伊布携带着非\n常不稳定的遗传基因");
	pchar PokedexDes134[] = _("美丽的水边是其主要的栖息地 如\n果感觉有外敌来袭 它就会跳入水\n中躲起来");
	pchar PokedexDes135[] = _("肺中有能产生电力的器官 从它的\n吐息中 能听到里面混杂着噼里啪\n啦的电流声");
	pchar PokedexDes136[] = _("大口吸入空气就是要攻击的前兆\n这意味着1700度的火焰即将来\n袭");
	pchar PokedexDes137[] = _("由大约20年前的科学力量创造出\n来的宝可梦 所以现在很多部分已\n经过时了");
	pchar PokedexDes138[] = _("生活在古代海洋中的宝可梦 好像\n曾是始祖大鸟的食物 发现过带有\n齿痕的化石");
	pchar PokedexDes139[] = _("被认为是由于身上沉重的壳而灭绝\n的古代宝可梦 好像是章鱼桶的远\n祖");
	pchar PokedexDes140[] = _("3亿年前繁衍兴旺的宝可梦 据说\n在某些地区 至今仍能偶尔看见活\n着的化石盔");
	pchar PokedexDes141[] = _("为了在陆地上也能活动 身体开始\n了演化 但没等演化完 它就灭绝\n了");
	pchar PokedexDes142[] = _("由琥珀中残留的遗传基因复原而来\n性情比想像的还要粗暴 甚至还\n出现了牺牲者");
	pchar PokedexDes143[] = _("平时不是吃就是睡 但如果因某些\n事而认真起来的话 好像就会发挥\n出惊人的力量");
	pchar PokedexDes144[] = _("操控冰的传说的鸟宝可梦 因为拍\n动翅膀就能冷却空气 所以据说急\n冻鸟飞过就会下雪");
	pchar PokedexDes145[] = _("操控电的传说的鸟宝可梦 平时生\n活在雷云之中 被雷电击中 体内\n就会涌现出力量");
	pchar PokedexDes146[] = _("操控火的传说的鸟宝可梦 据说身\n体受伤后 会进入火山口的熔岩里\n燃烧全身治愈伤口");
	pchar PokedexDes147[] = _("由于还很弱小 所以会潜伏在水底\n悄悄地生活 靠着吃沉入水中的东\n西为生");
	pchar PokedexDes148[] = _("人们相信它能操纵天气 所以在哈\n克龙栖息的湖里 供品总是源源不\n断");
	pchar PokedexDes149[] = _("即便是狂风暴雨的海上 它也能波\n澜不惊地飞过 目睹过它那身姿的\n船长称其为大海的化身");
	pchar PokedexDes150[] = _("通过操作遗传基因而制造出来的宝可梦\n人类的科学力量可以造出它的身体\n却无法造出一颗温柔的心");
	pchar PokedexDes151[] = _("据说它有着所有宝可梦的遗传基因\n因为可以随心所欲地隐形 所以\n就算接近人类也完全不会被察觉");
	pchar PokedexDes152[] = _("虽然会挥舞叶子威吓对手 但由于\n叶子上会飘散出甜甜的香气 所以\n双方都会变得心平气和下来哦");
	pchar PokedexDes153[] = _("在脖子周围那些圆圆卷起的叶子中\n都长有1个小树芽 那香味会让人\n焕发活力");
	pchar PokedexDes154[] = _("花的香味能够平复情绪 战斗的时\n候 它会散发出香味来削弱对手的\n战意");
	pchar PokedexDes155[] = _("会从背上喷出火焰保护自己 虽然\n生气时的火焰势头猛烈 但疲惫时\n就会不完全燃烧");
	pchar PokedexDes156[] = _("会用火势和热风威吓对手 在用敏\n捷的身手躲避对手攻击的同时会用\n火焰点燃对手");
	pchar PokedexDes157[] = _("会用灼热的火焰在周围制造出热浪\n隐藏身影 燃起的爆炸气浪能烧尽\n一切");
	pchar PokedexDes158[] = _("个子虽小但颚的力量很强 这力量\n强大到小锯鳄只是想轻轻咬一下\n但却会让对方遭受重伤的程度");
	pchar PokedexDes159[] = _("一旦咬住就绝不会松口 牙齿尖端\n像鱼钩那样向后弯曲 一旦刺进去\n就拔不出来了");
	pchar PokedexDes160[] = _("会张开大嘴威吓对手 能用强韧的\n后脚蹬地 并以惊人的速度猛撞过\n来");
	pchar PokedexDes161[] = _("睡觉的时候会轮流放哨 察觉到危\n险便会叫醒伙伴 和族群走散后会\n吓得睡不着觉");
	pchar PokedexDes162[] = _("就算受到敌人的袭击 也能一溜烟\n地钻进细小的缝隙里逃走 手脚虽\n短却十分灵活");
	pchar PokedexDes163[] = _("每天必定会按固定的节奏倾斜脖子\n过去人们会养它来代替时钟");
	pchar PokedexDes164[] = _("即便是在黑暗里 它的眼睛也能看\n得一清二楚 不会放过任何猎物\n所以也被称为黑夜帝王");
	pchar PokedexDes165[] = _("非常怕冷的宝可梦 在温暖的阿罗\n拉 可以看到它生气勃勃的样子");
	pchar PokedexDes166[] = _("据说它背上的花纹和夜空里的星星\n有关 但是具体情况至今未明");
	pchar PokedexDes167[] = _("由它吐丝制成的巢穴非常坚固 即\n便放上10公斤重的岩石也不会破\n掉");
	pchar PokedexDes168[] = _("每晚都会为了寻求猎物而四处游走\n发现猎物时会吐丝封住对方的行\n动 然后用牙齿啃食");
	pchar PokedexDes169[] = _("牙齿锋利 就算在黑暗中被它咬住\n吸血也不会感到疼痛 所以无法立\n刻发觉");
	pchar PokedexDes170[] = _("会通过2根触手发出微光来吸引猎\n物 是一种在夜钓时很有用的宝可\n梦");
	pchar PokedexDes171[] = _("栖息在触手里的细菌在吸食电灯怪\n的体液时 会产生强烈的发光现象");
	pchar PokedexDes172[] = _("仍旧很不擅长使用电力 一旦吃惊\n或是情绪高涨 就会立刻开始放电");
	pchar PokedexDes173[] = _("在流星众多的晚上 它们会聚集起来并\n围成一圈跳舞 如果能在那时看到它们\n就会遇到一些好事情哦");
	pchar PokedexDes174[] = _("为了能动听地歌唱 它会一直练习\n唱歌 就算是睡着了 也会在梦中\n不停地歌唱哦");
	pchar PokedexDes175[] = _("能将人和宝可梦发出的温情和喜悦\n这些情感转化成能量 会将壳里储\n存的幸福分发出去");
	pchar PokedexDes176[] = _("据说是会带来幸运的宝可梦 如果\n发现心灵纯洁的人或宝可梦 就会\n现身并将幸福分给他们");
	pchar PokedexDes177[] = _("虽然还无法飞行 但跳跃力超群\n能跳上很高的树枝啄食树芽");
	pchar PokedexDes178[] = _("据说该宝可梦虽然有着能预知未来\n的力量 但却没有能改变未来的力\n量");
	pchar PokedexDes179[] = _("用咩利羊的毛制成的衣服容易起静\n电 所以会做特殊加工");
	pchar PokedexDes180[] = _("毛发不生有如橡胶一样的皮肤不会\n导电 即便触电了也很安全");
	pchar PokedexDes181[] = _("尾巴上的光能传至宇宙 所以身在\n何处一目了然 因此它平时不会让\n尾巴发光");
	pchar PokedexDes182[] = _("在充分沐浴了阳光后 身上的叶子\n就会一圈圈地旋转起来 美丽花的\n舞蹈是南国有名的风景线");
	pchar PokedexDes183[] = _("充满油的尾巴能用来替代救生圈\n只有尾巴浮在水面上的时候 就表\n示它正潜在水中吃水草");
	pchar PokedexDes184[] = _("长长的耳朵是玛力露丽重要的感应器\n只要注意听 即使是在湍急的河流中\n也能分辨出那里猎物的种类");
	pchar PokedexDes185[] = _("很受老年人喜爱 甚至还有关于它\n的专门杂志 它的爱好者很讲究它\n手臂的长度和角度");
	pchar PokedexDes186[] = _("明明叫声有如嚎叫一般 但某位作\n曲家却受其影响创作了优美的叙事\n曲");
	pchar PokedexDes187[] = _("能随风轻轻飘浮的宝可梦 如果感到有\n强风要来的迹象 伙伴之间就会互相绑\n紧叶子 做好不被强风吹走的准备");
	pchar PokedexDes188[] = _("气温超过18度就会开花 开花方\n式会随温度的不同而变化 所以有\n时也会用它来代替温度计");
	pchar PokedexDes189[] = _("会乘着温暖的南风飞越大海 一直\n飞到外国的宝可梦 遇到冷空气就\n会降落到地面上");
	pchar PokedexDes190[] = _("习惯用尾巴做各种事情后 手就变\n得不怎么灵活了 会在很高的树上\n筑巢");
	pchar PokedexDes191[] = _("为了将体内储存的营养一直保留到\n进化那一刻 它几乎不会动一下\n平时它什么都不吃只饮朝露");
	pchar PokedexDes192[] = _("会从太阳的能量中制造出营养 在\n气温高的白天会频繁地活动 太阳\n下山后会突然变得一动不动");
	pchar PokedexDes193[] = _("不转动眼珠就可以360度环视\n擅长急停和转向 很快便能将它盯\n上的猎物追得走投无路");
	pchar PokedexDes194[] = _("平时生活在水中 觅食等时候偶尔\n会来到地上 在陆地上会用有毒的\n粘液覆盖身体");
	pchar PokedexDes195[] = _("会在水里张开嘴巴 然后就只是静静地\n等着食物自己碰巧跳进来 因为不会动\n所以肚子也不怎么会饿");
	pchar PokedexDes196[] = _("本来没有任何能力 但据说为了保\n护自己从而觉醒了预知能力");
	pchar PokedexDes197[] = _("夜行性宝可梦 大大的瞳孔即便在\n一片漆黑中也能看清猎物的样子");
	pchar PokedexDes198[] = _("对于发光的东西毫无抵抗力 为了\n追求宝物 有时候会潜入爱储存宝\n石的尖牙陆鲨的巢穴");
	pchar PokedexDes199[] = _("脑海中经常会涌现出一些像是改变\n世界的想法 但不久后会依次忘记");
	pchar PokedexDes200[] = _("吓唬别人是其活着的意义 如果把\n耳朵贴近它脖子上的红珠子 就能\n从中听到悲鸣声");
	pchar PokedexDes201[] = _("身体像是古代文字的宝可梦 虽然\n已有人在研究先出现的是文字还是\n未知图腾 但至今仍是个谜");
	pchar PokedexDes202[] = _("2只以上聚在一起就会开始比拼忍耐\n就算肚子饿了也会一直忍耐下去 所以\n果然翁的训练家对此要多加注意");
	pchar PokedexDes203[] = _("尾巴上的脑袋里也有着小小的大脑 会\n对臭味和声音产生反应进行攻击 因此\n从后面靠近的话会被突然咬住");
	pchar PokedexDes204[] = _("会挂在树上静静等待作为它猎物的\n虫宝可梦送上门来 在阿罗拉 它\n喜欢吃的是萌虻");
	pchar PokedexDes205[] = _("只要一有东西靠近 它就会射出钢\n铁外壳的碎片进行攻击 这是一种\n无意识的条件反射");
	pchar PokedexDes206[] = _("能挖掘地面移动 会友好地和地鼠\n共用各自的隧道");
	pchar PokedexDes207[] = _("它会像在地上滑行时一样悄无声息地滑\n过天空 能用双臂上的大爪子和脚上的\n爪子抓住猎物的脸 然后再刺入毒针");
	pchar PokedexDes208[] = _("在地下住得比大岩蛇还深 会朝着\n地球的中心挖掘 有时洞深可达1\n公里");
	pchar PokedexDes209[] = _("喜欢亲近人 爱撒娇 它的动作与\n长相之间的反差好像会让年轻女性\n为之着迷");
	pchar PokedexDes210[] = _("颚的力量很强 但不喜欢争斗 所\n以很少有展露的机会");
	pchar PokedexDes211[] = _("吞下水后 会利用水的力量将全身\n的毒针一起发射出去 是不太擅长\n游动的宝可梦");
	pchar PokedexDes212[] = _("有着钢铁般的身体 比起夹住敌人\n它粗重的钳子更适合用来把敌人\n砸扁");
	pchar PokedexDes213[] = _("会在岩石下面一边吃着甲壳里储存\n的树果一边隐藏身体 树果和体液\n混合后会变成果汁");
	pchar PokedexDes214[] = _("粗粗的角是其骄傲 在阿罗拉 锹\n农炮虫是它最大的竞争者 双方经\n常大打出手");
	pchar PokedexDes215[] = _("依靠团队合作从鸟宝可梦的巢穴里\n将蛋偷出来后 却会为了由谁来吃\n而争吵不休");
	pchar PokedexDes216[] = _("一直在舔渗入了蜂蜜的手掌 熊宝\n宝的蜂蜜是由水果和大针蜂收集的\n花粉混合后制成的");
	pchar PokedexDes217[] = _("据说森林里到处都是圈圈熊用来收\n集食物的大树和小河 每天都会为\n了搜集食物在森林里走动");
	pchar PokedexDes218[] = _("虽然体内有灼热的熔岩不断卷动\n但变冷后就会凝固崩裂 身体也会\n变小");
	pchar PokedexDes219[] = _("壳是由皮肤冷却后凝固而成的 只\n要碰一下就会崩裂成碎片 进入熔\n岩中就会恢复到原来的大小");
	pchar PokedexDes220[] = _("会用鼻子摩擦地面觅食 喜欢吃枯\n草下长出的蘑菇 偶尔也会挖到温\n泉哦");
	pchar PokedexDes221[] = _("身上覆盖着可以抵抗冰寒的又厚又\n长的毛皮 会用牙齿挖出埋在冰里\n的食物");
	pchar PokedexDes222[] = _("生活在阿罗拉的太阳珊瑚身上的粉\n红色非常鲜艳浓郁 这都是拜富含\n营养的大海所赐");
	pchar PokedexDes223[] = _("会粘在巨翅飞鱼身上 吃一点残羹\n剩饭 如果巨翅飞鱼受到袭击 它\n就会与其一同战斗");
	pchar PokedexDes224[] = _("逃跑时吐出来的墨汁很特别 里面\n有着能让嗅觉变迟钝的成分 连鼻\n子灵敏的宝可梦也能迷惑");
	pchar PokedexDes225[] = _("会把自己的食物分给遇难者 因为\n它是杂食性的宝可梦 所以有时会\n把虫宝可梦分给对方");
	pchar PokedexDes226[] = _("阿罗拉的人气特产是绘有巨翅飞鱼\n在海浪上优雅跳跃的明信片及海报");
	pchar PokedexDes227[] = _("用其脱落的翅膀加工制成的菜刀\n锋利得足以让一流厨师都点头认可");
	pchar PokedexDes228[] = _("擅长与伙伴的合作 如果成为同伴\n就会非常听从训练家的命令");
	pchar PokedexDes229[] = _("能喷出混有毒素的火焰结果对手\n会和群体中的成员平分猎物");
	pchar PokedexDes230[] = _("栖息在没有生物居住的深海 在很\n长一段时间内 人们相信刺龙王的\n哈欠能引发汹涌的海流");
	pchar PokedexDes231[] = _("在河边挖个竖坑生活 会在住处附\n近做上鼻子标记 以此来告诉伙伴\n这里是自己的领地哦");
	pchar PokedexDes232[] = _("擅长把身体蜷成一团 边高速滚动\n边向对手猛撞的攻击 一旦开始滚\n动就很难停下来");
	pchar PokedexDes233[] = _("搭载有AI 会自己学习各种各样\n的事情 但也会记住一些多余的东\n西");
	pchar PokedexDes234[] = _("由于形状完美的角作为艺术品可以\n卖出高价钱 因此该宝可梦曾遭滥\n捕差点灭绝");
	pchar PokedexDes235[] = _("从尾巴前端渗出的体液会随着图图\n犬情绪的变化而呈现不同的颜色");
	pchar PokedexDes236[] = _("如果每天不去锻炼 压力就会积攒下来\n所以训练家在培育它的时候 需要在\n日程管理上好好下番功夫");
	pchar PokedexDes237[] = _("高速旋转时施展出的脚踢是兼具攻\n击与防御的出色招式 比起走路\n旋转着前进会来得更快");
	pchar PokedexDes238[] = _("在确认某样东西时 会先用嘴唇而\n不是手去触碰试试 会经常用舌头\n舔去污渍");
	pchar PokedexDes239[] = _("听到打雷的声音会很高兴 如果事先将\n打雷的声音录下来 那么在它消沉的时\n候就能很方便地放给它听了哦");
	pchar PokedexDes240[] = _("当火焰哧溜哧溜地从鼻子里漏出来\n时 就表示它感冒了 这时就让它\n去熔岩里休息会吧");
	pchar PokedexDes241[] = _("每天能产出20升的牛奶 越是能\n长出优质牧草的土地 它所产出的\n牛奶也就越香浓可口");
	pchar PokedexDes242[] = _("这个蛋是天下一绝 甚至有吃下去\n就会获得幸福的说法 所以它在市\n场上的价格是最高的");
	pchar PokedexDes243[] = _("体内蕴藏着雷电般速度的宝可梦\n它的长嚎会如同天雷落地时一样震\n动空气 摇撼大地");
	pchar PokedexDes244[] = _("体内蕴藏着熔岩般热情的宝可梦\n被认为是从火山的喷发中诞生 能\n喷出燃尽一切的火焰");
	pchar PokedexDes245[] = _("体内蕴藏着泉水般温柔的宝可梦\n会用滑行一样的动作在大地上奔跑\n有着净化浑水的力量");
	pchar PokedexDes246[] = _("诞生于地下 会一边吃着泥土 一\n边朝至亲所在的地面前进 因为光\n线刺眼 所以它不太能适应哦");
	pchar PokedexDes247[] = _("它是令人头痛的宝可梦 不等进化\n完成就会利用压缩气体四处乱飞大\n闹来纾解压力");
	pchar PokedexDes248[] = _("会在山中徘徊以寻求战斗对手 但\n如果遇到的是比自己弱小的对手\n它就会视若无睹地离开");
	pchar PokedexDes249[] = _("有着只要轻轻挥动翅膀就可以吹飞\n民房的破坏力 因此去了海底隐居");
	pchar PokedexDes250[] = _("据说在不同角度光线的照射下 会\n闪耀七彩光芒的羽毛能带来幸福\n据传它住在彩虹的脚下");
	pchar PokedexDes251[] = _("从未来穿越时光而来的宝可梦 一\n般认为只要时拉比出现 就会有光\n明的未来在等着我们");
	pchar PokedexDes252[] = _("能够用脚底的小刺钩住垂直的墙壁\n攀爬 会甩动粗粗的尾巴进行摔打");
	pchar PokedexDes253[] = _("靠着体内长出的叶子 可以方便地\n在森林里隐藏身形躲避敌人 是生\n活在密林里的爬树高手");
	pchar PokedexDes254[] = _("体内长出的叶子非常锋利 会用敏\n捷的动作在树枝间跳来跳去 从敌\n人的头上或背后猛扑过去");
	pchar PokedexDes255[] = _("会紧贴着训练家摇摇晃晃地走路\n能从嘴里喷出摄氏1000度的灼\n热火球把对手烧焦");
	pchar PokedexDes256[] = _("会在山野上跑来跑去锻炼腰腿 能\n用兼具速度和力量的腿在1秒内连\n踢10次");
	pchar PokedexDes257[] = _("战斗时会从手腕喷出灼热的火焰\n勇敢地迎战对手 对手越强 火焰\n就会烧得越旺");
	pchar PokedexDes258[] = _("头上的鳍是非常灵敏的雷达 可以\n不靠眼睛 从水或空气的流动中探\n测周围的情况");
	pchar PokedexDes259[] = _("为了能在地面上也可以生存 它的\n身体表面覆盖着一层薄薄的粘膜\n会在退潮后的海岸边玩泥巴");
	pchar PokedexDes260[] = _("该宝可梦有着能轻松拖动1吨以上\n岩石块的力量 视力很好 在浑浊\n的水中也能看清");
	pchar PokedexDes261[] = _("找到动的东西就会立刻咬上去 虽然在\n猎物精疲力尽之前会一直追着不放 但\n受到反击的话 有时也会被吓退");
	pchar PokedexDes262[] = _("发出凶猛的吼声并压低身体的时候\n就是它准备发动攻击的前兆 会\n用锋利的尖牙一口咬住对手");
	pchar PokedexDes263[] = _("之所以会一直之字形地到处乱走\n是因为它的好奇心太过旺盛 对看\n到的各种东西都很感兴趣");
	pchar PokedexDes264[] = _("会笔直地猛跑 发现障碍物时就会\n通过直角转弯来躲避 非常不擅长\n慢慢转弯的道路");
	pchar PokedexDes265[] = _("会用尾部的刺剥开树皮 以渗出的\n树汁为食 有着吸盘的脚即使在玻\n璃上也不会打滑");
	pchar PokedexDes266[] = _("等待进化的时候 为了防止掉落\n会将丝线缠在树枝上支撑身体 能\n从小洞观察外面的情况");
	pchar PokedexDes267[] = _("非常喜欢甜甜花粉的宝可梦 如果\n把开着花的花盆放在窗边 它就一\n定会飞过来采集花粉哦");
	pchar PokedexDes268[] = _("盾甲茧的茧是由其口中吐出的细丝\n包裹身体后变硬而来的 它会在茧\n里准备进化");
	pchar PokedexDes269[] = _("有着被灯光吸引的习性 被路灯引\n诱的毒粉蛾群会把行道树上的叶子\n吃得一塌糊涂");
	pchar PokedexDes270[] = _("浮在池塘或湖泊的水面上生活 虽\n然叶子枯萎了就会变弱 但为了寻\n找清水 偶尔也会在陆地上移动");
	pchar PokedexDes271[] = _("夜行性 太阳下山后就会开始活动\n如果看到垂钓者 就会从水中扯\n线捣乱并引以为乐");
	pchar PokedexDes272[] = _("如果听到欢快的音乐就会开始跳舞\n据说会被郊游的孩子们的合唱吸\n引从而现身");
	pchar PokedexDes273[] = _("会把头顶粘在树枝上悬挂着吸收水\n分 水喝得越多 身体就会越滑越\n光亮");
	pchar PokedexDes274[] = _("住在茂密繁盛的森林里的宝可梦\n偶尔从森林里出来吓唬人 非常讨\n厌有谁抓自己的长鼻子");
	pchar PokedexDes275[] = _("据说是在树龄超过1000年的大\n树顶上居住的谜之宝可梦 会用叶\n子团扇掀起强风");
	pchar PokedexDes276[] = _("不管是怎样强大的对手都会勇敢地前去\n挑战 有着就算输了也不会气馁的毅力\n肚子饿了就会大声痛哭");
	pchar PokedexDes277[] = _("会盘旋在遥远的高空 发现猎物后\n就会俯冲而下 用脚爪紧紧抓住猎\n物令其无法逃脱");
	pchar PokedexDes278[] = _("翅膀又细又长 能乘着上升气流\n像滑翔机一样在空中翱翔");
	pchar PokedexDes279[] = _("会将小型宝可梦放入它那鼓得大大\n的鸟嘴中运送 但是要把它带到哪\n儿去就不得而知了");
	pchar PokedexDes280[] = _("能用头上的角感知人的情绪 虽然\n几乎不会出现在人的面前 但感受\n到积极向上的情绪后就会靠过来");
	pchar PokedexDes281[] = _("据说经常接触训练家开朗情绪的奇\n鲁莉安会成长得十分美丽 会用发\n达的头脑来操纵精神力量");
	pchar PokedexDes282[] = _("据说在使用预知未来的能力察觉到\n训练家有危险时 就会使出最强的\n精神能量");
	pchar PokedexDes283[] = _("如果遇到危险 就会从突起的地方\n分泌出甜汁 收集它制成糖浆 然\n后涂抹在面包上就会非常可口");
	pchar PokedexDes284[] = _("会用眼珠花纹威吓敌人 如果这样\n不起作用 就会挥动4根翅膀 灵\n活地四处逃窜");
	pchar PokedexDes285[] = _("栖息在森林深处潮湿的地面上 经常会\n一动不动地待在落叶下面 会以落叶堆\n积起来后形成的腐叶土为食");
	pchar PokedexDes286[] = _("会用轻巧的步法接近敌人 然后用\n能伸缩的手臂出拳 有着能令拳击\n手汗颜的技术");
	pchar PokedexDes287[] = _("每天会趴上20小时以上 因为它\n的身体几乎一动不动 所以1天只\n要吃3片叶子就吃饱了");
	pchar PokedexDes288[] = _("一直在蠢蠢欲动 想要大闹一番\n甚至连1分钟都坐不住 如果不动\n压力就会堆积起来");
	pchar PokedexDes289[] = _("整天横躺着生活的宝可梦 会吃触手能\n及的地方长出来的草 如果草吃光了\n就会很不情愿地换个地方");
	pchar PokedexDes290[] = _("长年生活在漆黑的土里 会从树根\n处吸取营养 一动不动地等待进化\n时刻的到来");
	pchar PokedexDes291[] = _("会在四周飞快地移动 无法看见它的身\n影 因为只能听见叫声 所以很长一段\n时间里 它一直被认为是透明的宝可梦");
	pchar PokedexDes292[] = _("坚硬的身体一动都不会动 人们相\n信如果从背上窥视它体内的空洞\n灵魂就会被吸走");
	pchar PokedexDes293[] = _("平时细声细气 不注意听就听不到\n但如果察觉到危险 就会用能引\n起头痛的叫声大叫");
	pchar PokedexDes294[] = _("会发出能将木质房屋吹成碎片的大\n叫声痛击对手 圆圆的耳朵有着扬\n声器的功能");
	pchar PokedexDes295[] = _("能靠大叫产生的震动引发地震 开\n始用身上的洞猛烈地吸入空气就是\n要进行大叫的前兆");
	pchar PokedexDes296[] = _("会朝着树干反复练习巴掌招数 有\n时会因为朝着椰蛋树练习巴掌招数\n而被扔飞");
	pchar PokedexDes297[] = _("虽然喜欢比试力气 但心地和善且\n注重礼仪 会慰劳自己的对战对手");
	pchar PokedexDes298[] = _("会运用套索的要领挥舞尾巴 利用\n投出去的力量把自己带飞出去 有\n着飞出10米的最远纪录");
	pchar PokedexDes299[] = _("1年只会移动1厘米 但在陷入危\n机时会旋转身体 瞬间潜入地下");
	pchar PokedexDes300[] = _("该宝可梦有看到动的东西就会不顾\n一切追着到处跑的习性 会追自己\n的尾巴追得头晕眼花");
	pchar PokedexDes301[] = _("我行我素喜欢自由散漫的生活 因\n为会想吃就吃 想睡就睡 所以每\n天都毫无规律可言");
	pchar PokedexDes302[] = _("用坚硬的爪子掘土 用粗粗的牙齿\n嘎嘣嘎嘣地嚼宝石 非常喜欢吃小\n碎钻");
	pchar PokedexDes303[] = _("狡黠而又恐怖的宝可梦 用可爱的\n举止让人麻痹大意 然后出其不意\n地用大颚一口吞下");
	pchar PokedexDes304[] = _("令人头疼的宝可梦 为了打造一副\n钢铁之躯 会从山上挖铁矿石吃\n但偶尔也会去吃桥梁或铁轨");
	pchar PokedexDes305[] = _("会通过喝上满满一肚子充满营养的\n泉水来锻炼自己的钢铁之躯 会在\n美味的泉水附近筑巢");
	pchar PokedexDes306[] = _("会把一座山当做自己的领地 要是\n谁敢来胡闹 它就会毫不留情地将\n其痛揍一顿 总是在山间巡逻");
	pchar PokedexDes307[] = _("会在深山里进行瑜伽的修行 但冥\n想时注意力总会被打断 所以修行\n一直无法结束");
	pchar PokedexDes308[] = _("据说通过冥想体内的能量就会提高 第\n6感也会随之变得敏锐起来 会和山野\n融为一体并借此来消除自己的气息");
	pchar PokedexDes309[] = _("通过空气与体毛的摩擦产生静电\n落雷兽如果奔跑 会发出噼里啪啦\n的声音");
	pchar PokedexDes310[] = _("在不自然的雷云之下有着雷电兽\n听说会用和雷同等的速度奔驰");
	pchar PokedexDes311[] = _("一直在给伙伴加油的宝可梦 伙伴加油\n努力的话 它就会让身体短路 产生噼\n里啪啦的火花声来表达自己的喜悦");
	pchar PokedexDes312[] = _("比起自己来 给伙伴加油更重要 会通\n过让体内发出的电流短路 一边放出华\n丽的火花 一边给伙伴加油");
	pchar PokedexDes313[] = _("太阳下山后就会从尾巴发出光 并\n通过亮度或闪烁来和伙伴交流 会\n被甜甜萤的甜甜香气吸引");
	pchar PokedexDes314[] = _("会利用甜甜的香气引诱电萤虫 然\n后诱导大量聚集而来的电萤虫 让\n它们在夜空中描绘几何图形");
	pchar PokedexDes315[] = _("会射出尖刺去攻击那些盯上自己手\n上花朵的对手 花的香味能抚平情\n绪");
	pchar PokedexDes316[] = _("因为整个身体几乎都是胃 所以能\n吞下和自己一样大的东西 会用特\n殊的胃液消化任何东西");
	pchar PokedexDes317[] = _("发现猎物后会向对方撒出自毛孔中\n喷出的带剧毒的体液 等猎物变弱\n后就会张开大嘴一口吞掉对方");
	pchar PokedexDes318[] = _("非常胆小 1只的话不会去狩猎\n如果聚集了5只左右的话 就会一\n下子变得很粗暴");
	pchar PokedexDes319[] = _("人们相信 如果带着它脱落的牙齿\n就不会在海上遭遇事故 因此会将\n牙齿加工为饰品等");
	pchar PokedexDes320[] = _("会张着嘴游泳 将食物连同海水一\n起吃下去 不要的水会从鼻子里喷\n出来舍弃");
	pchar PokedexDes321[] = _("因为会吃太多的鱼宝可梦 所以数\n量增加过多的话 会被渔夫们驱赶");
	pchar PokedexDes322[] = _("虽然迟钝到被人敲打也不会察觉\n但是对于饥饿1秒都无法忍耐 体\n内的熔岩一直在沸腾");
	pchar PokedexDes323[] = _("体内有着火山的宝可梦 时不时会\n从背上的驼峰里喷出体内储存的1\n万摄氏度的熔岩");
	pchar PokedexDes324[] = _("通过甲壳里喷出的烟就能了解它的\n身体状况 势头很旺时 说明很有\n精神");
	pchar PokedexDes325[] = _("会用尾巴蹦来蹦去弹跳的宝可梦\n靠着跳跃的震动来使心脏跳动 所\n以不能停止弹跳");
	pchar PokedexDes326[] = _("会用黑珍珠增强精神力量的波动\n并能随意操纵对手的宝可梦 使出\n力量的时候鼻息会变得粗重");
	pchar PokedexDes327[] = _("晃晃悠悠 步伐不稳健 如果长时\n间连续行走 就会变得状态很差");
	pchar PokedexDes328[] = _("颚部连岩石也能弄碎 但很重 如\n果翻身了 就会爬不起来 黑眼鳄\n会趁这个空当袭击它");
	pchar PokedexDes329[] = _("振动翅膀 发出超音波 会把晕厥\n的猎物活埋在沙子里保存");
	pchar PokedexDes330[] = _("挥动翅膀卷起沙暴 让流氓鳄潜伏\n在那里 捉到的猎物会一起分享");
	pchar PokedexDes331[] = _("栖息在沙漠之类的干燥地方 会用\n浓郁的花香引诱猎物 再射出身上\n的尖刺解决猎物");
	pchar PokedexDes332[] = _("为了不被沙漠的日照夺走水分 白\n天会一直站着不动 会在气温下降\n的夜间开始活动");
	pchar PokedexDes333[] = _("此宝可梦有着像棉花云一样蓬松的\n翅膀 不怕人 会像棉帽一样轻轻\n地站在人头上");
	pchar PokedexDes334[] = _("会混在棉花云里在空中起舞 如果\n用通透的声音鸣出旋律 就会让听\n者心醉神迷 仿佛置身梦境");
	pchar PokedexDes335[] = _("与宿敌饭匙蛇战斗的记忆已被刻入\n它体内的细胞中 会用敏捷的身手\n来躲避攻击");
	pchar PokedexDes336[] = _("祖祖辈辈与猫鼬斩战斗至今 身上\n的伤痕是激战的印记 会用锋利的\n尾巴进行攻击");
	pchar PokedexDes337[] = _("由于是从陨石坠落的地方发现的\n所以也有该宝可梦来自宇宙一说\n不过这种说法尚未被证明");
	pchar PokedexDes338[] = _("据说是从宇宙中落下来的新品种\n会飘浮在空中无声无息地移动 在\n战斗中会放出强光");
	pchar PokedexDes339[] = _("全身滑腻腻的 即使被鸟宝可梦啄\n到 也能哧溜一下滑着逃走");
	pchar PokedexDes340[] = _("猛烈地摇晃地面 威吓对手 会将\n沼泽底部的猎物连同泥巴一起整个\n吞下");
	pchar PokedexDes341[] = _("被没有坚持培育的训练家放生了的\n个体在增加 即使在阿罗拉也变得\n时常能见到了");
	pchar PokedexDes342[] = _("性格暴躁 喜欢打架 但如果钳子\n掉落 就会一下子弱下来 在再生\n之前 都会提心吊胆的");
	pchar PokedexDes343[] = _("在原始人所居住的洞穴墙壁上 描\n绘着像是天秤偶的宝可梦的样子");
	pchar PokedexDes344[] = _("如果淋湿 身体就会溶解掉 所以\n下雨时会用精神力量包住全身 保\n护自己");
	pchar PokedexDes345[] = _("曾生活在古代温暖的海里 伪装成\n海草 埋伏着等待猎物 等对方靠\n近的时候一口吞下");
	pchar PokedexDes346[] = _("平常栖息在海的浅滩底部 退潮的\n时候就爬到陆地上 四处寻找猎物");
	pchar PokedexDes347[] = _("从化石复原而来的太古羽虫即使放\n到海里 也不会有精神 因为现在\n的水质已和当时不同了");
	pchar PokedexDes348[] = _("生活在陆地上 曾为了寻找猎物而\n出发去海里狩猎 锐利的爪子是它\n最大的武器");
	pchar PokedexDes349[] = _("因为破破烂烂的 谁也不要捉 因为看\n起来不好吃 也不会被当做猎物 结果\n就是 数量嗖嗖地增加起来");
	pchar PokedexDes350[] = _("被称为最美的宝可梦 对于因喜爱\n丑丑鱼而培育它的训练家 好像很\n微妙");
	pchar PokedexDes351[] = _("被冰雹打到时飘浮泡泡的样子 在\n将它放入冷冻库的实验里 没有变\n成这个形态");
	pchar PokedexDes352[] = _("能改变身体的颜色 融入周围景色\n中 如果长时间不管它 就会闹别\n扭不现身");
	pchar PokedexDes353[] = _("因为会吞食类似于怨恨嫉妒之类\n的感情 所以对于有的人来说是可\n贵的存在");
	pchar PokedexDes354[] = _("怨念附在被丢弃的玩偶身上 打算\n寻找丢弃自己的人来报仇");
	pchar PokedexDes355[] = _("无论多厚的墙壁都能穿过 一旦被\n盯上 就会一直被追着 直到第二\n天早上太阳升起");
	pchar PokedexDes356[] = _("身体内部是空洞 什么都没有 据\n说会像黑洞般 无论什么都吸进去\n一旦被吸进去就回不来了");
	pchar PokedexDes357[] = _("栖息在阿罗拉的热带龙脖子里结的\n那串水果比其他地区的甜得多 是\n最最棒的");
	pchar PokedexDes358[] = _("会让声音在身体的空洞里回响 发\n怒时的叫声会变成超音波 拥有吹\n飞敌人的威力");
	pchar PokedexDes359[] = _("不祥的只是它的外表 实际上它是\n会帮忙守护田地 或是告知人们异\n变的难能可贵的存在");
	pchar PokedexDes360[] = _("小果然总是一脸笑眯眯的 生气的\n时候 注意看尾巴 会啪嗒啪嗒地\n敲击地面");
	pchar PokedexDes361[] = _("雪和冰是它的主要食物 在温暖的\n阿罗拉只能在限定的地方生存");
	pchar PokedexDes362[] = _("将猎物冻住 整个咬住 但喜欢吃\n的是迷你冰等原本就冻着的宝可梦");
	pchar PokedexDes363[] = _("翻滚的话会比走路快很多 吃饭的\n时候会大家一起高兴地拍手 所以\n会相当的吵");
	pchar PokedexDes364[] = _("有着遇上第一次看到的物体时 必\n定会用鼻子顶着转转看的习性 有\n时候也会转海豹球玩");
	pchar PokedexDes365[] = _("2根发达的獠牙连10吨重的冰山\n也能一击粉碎 脂肪丰厚 即使在\n冰点下也很淡定");
	pchar PokedexDes366[] = _("别看它长这样 它可是食肉的 用\n2片外壳牢牢夹住猎物 直到完全\n不动了才会放开");
	pchar PokedexDes367[] = _("游泳能力不太强 会挥动尾巴来吸\n引猎物 在很接近的时候一口咬住");
	pchar PokedexDes368[] = _("身体的颜色根据水温而变化 阿罗\n拉的樱花鱼呈现出令人炫目的鲜艳\n色彩");
	pchar PokedexDes369[] = _("曾被认为已经灭绝 古空棘鱼的名\n字是模仿发现者的名字而起的");
	pchar PokedexDes370[] = _("如果拥有它的心形鳞片 就能交往\n到恋人 也曾有个时期因为这个谣\n传而遭到滥捕");
	pchar PokedexDes371[] = _("每次见到在空中飞行的鸟宝可梦\n就会变得非常羡慕 而用头锤把周\n围的东西砸得粉碎");
	pchar PokedexDes372[] = _("体内的细胞正处于千变万化的时期\n坚硬的壳与骨头的成分相同");
	pchar PokedexDes373[] = _("因为终于能飞的喜悦 而在天空四\n处疾飞 不到精疲力竭要睡觉就几\n乎不落地");
	pchar PokedexDes374[] = _("体内循环着的不是血液而是磁力\n身体状况不好时 就给它磁铁吧");
	pchar PokedexDes375[] = _("会从2个大脑里放射出强力的精神\n能量 封住猎物的行动");
	pchar PokedexDes376[] = _("不只是精神力量 还以怪力而自豪\n能用4只脚抓住猎物 用爪子封\n住对方的行动");
	pchar PokedexDes377[] = _("过去曾被人封印的宝可梦 听说\n如果身体在战斗中损坏 就会自己\n寻找新的岩石来修复");
	pchar PokedexDes378[] = _("身体是由冰河时期形成的冰构成\n即便用火焰也无法融化 能操控零\n下200度的冷气");
	pchar PokedexDes379[] = _("拥有比任何金属都坚硬的身体 身\n体内部好像成为了空洞 不清楚该\n宝可梦以什么为食");
	pchar PokedexDes380[] = _("能非常敏锐地感知人心 一旦察觉\n到敌意 就会竖起全身羽毛 用激\n烈的叫声威吓对方");
	pchar PokedexDes381[] = _("拥有将所见所思用影像展现给对方\n的能力 能理解人类的语言");
	pchar PokedexDes382[] = _("通过自然的能量进行原始回归 恢\n复原本的样子 其力量可以呼风唤\n雨扩张海洋");
	pchar PokedexDes383[] = _("该宝可梦据说是大地的化身 传说\n为了寻求自然的能量 它曾不断\n与盖欧卡争斗");
	pchar PokedexDes384[] = _("据说已经生存了数亿年 世间流传\n着其调解固拉多与盖欧卡之间争斗\n的传说");
	pchar PokedexDes385[] = _("传说 它会在醒来时实现写在它头\n部许愿笺上的愿望 如果感知到危\n险 会在睡梦中战斗");
	pchar PokedexDes386[] = _("它是宇宙病毒的DNA受到激光照\n射后 发生突变而生成的宝可梦\n胸部的水晶体好像是它的大脑");
	pchar PokedexDes387[] = _("沐浴着阳光 用全身进行光合作用\n甲壳是泥土变硬后形成的");
	pchar PokedexDes388[] = _("生活在森林中的水边 白天会去森\n林的外面 让甲壳上的树木晒晒阳\n光");
	pchar PokedexDes389[] = _("在遥远的过去 人们曾假想过 在\n大地的下面存在着巨大土台龟");
	pchar PokedexDes390[] = _("屁屁的火焰以腹部产生的瓦斯为燃\n料 即使被雨淋到也不会熄灭");
	pchar PokedexDes391[] = _("能熟练控制尾部火焰的大小 以自\n己擅长的距离进行战斗");
	pchar PokedexDes392[] = _("性格像头上燃烧的火焰一样激烈\n在速度方面无可匹敌");
	pchar PokedexDes393[] = _("非常讨厌被别人照顾 因为不听训\n练家的指示 所以要和它关系变好\n是很困难的");
	pchar PokedexDes394[] = _("不集结成群 独来独往 似乎所有\n波皇子都认为自己是最了不起的");
	pchar PokedexDes395[] = _("能以不输摩托艇的速度游泳 翅膀\n的边缘很锐利 能将浮冰切断");
	pchar PokedexDes396[] = _("会很多只一起群体行动 虽然身体\n很小 但拍打翅膀的力量非常强");
	pchar PokedexDes397[] = _("有组成庞大的团队来行动的习性\n各个团队之间的争斗很激烈");
	pchar PokedexDes398[] = _("翅膀和脚的肌肉很发达 能抓着小\n的宝可梦轻轻松松地飞行");
	pchar PokedexDes399[] = _("遇到任何事都不慌不忙 神经很大\n条的家伙 能做出与外表不符的灵\n敏动作");
	pchar PokedexDes400[] = _("勤劳地用锐利的门牙啃断树枝和树\n根 堆积起来在水边筑巢");
	pchar PokedexDes401[] = _("用互相撞击触角发出的声音和伙伴\n对话 那音色是秋夜的风景诗");
	pchar PokedexDes402[] = _("鸣叫的时候会将刀子般的前臂交叉\n在胸前 即兴创作出旋律");
	pchar PokedexDes403[] = _("每当活动身体时 肌肉就会伸缩产\n生电 危机时刻 身体会发光");
	pchar PokedexDes404[] = _("从爪子释放出一击就能令人晕厥的\n电流 由数只组成团队生活");
	pchar PokedexDes405[] = _("瞳孔闪着金色时 能发现躲藏在墙\n壁另一侧的猎物");
	pchar PokedexDes406[] = _("如果沐浴到温暖的阳光 花苞就会\n打开 飞散出花粉 住在清澈的水\n边");
	pchar PokedexDes407[] = _("用甜甜的香气引诱猎物 并用双臂\n的毒刺鞭刺入或勒紧 以了结对方");
	pchar PokedexDes408[] = _("太古时代的宝可梦 拥有坚硬而结\n实的头盖骨 但是脑子相当不好使");
	pchar PokedexDes409[] = _("过去的人们曾在挖出化石后 用比\n钢铁还硬的头盖骨做成头盔");
	pchar PokedexDes410[] = _("食草的温顺宝可梦 用结实的脸部\n皮肤挖掘地面 连树根之类的也会\n吃");
	pchar PokedexDes411[] = _("脸部的骨头又大又硬 所以在复原\n成功前 一直被错误地认作了脊椎");
	pchar PokedexDes412[] = _("为了抵御寒冷的秋风 会用小树枝\n和落叶当材料 做成蓑衣裹在身上");
	pchar PokedexDes413[] = _("根据进化地点的不同 样子会发生\n变化 身边的材料会成为身体的一\n部分");
	pchar PokedexDes414[] = _("非常喜欢吃花蜜 会抢夺三蜜蜂采\n集到的蜜 然后自己吃掉");
	pchar PokedexDes415[] = _("从出生时起就是3只一起 为了取\n悦蜂女王 一直都在采集着花蜜");
	pchar PokedexDes416[] = _("躯体是孩子们的巢穴 释放出各种\n各样的费洛蒙 自由地控制孩子们");
	pchar PokedexDes417[] = _("把储存了静电帕奇作响的毛球和最\n喜欢吃的树果一起藏在树干的洞穴\n里");
	pchar PokedexDes418[] = _("会像螺旋桨一样旋转2条尾巴来游\n泳 潜水的时候浮囊会瘪掉");
	pchar PokedexDes419[] = _("用发达的浮囊浮在水面 是会帮忙\n拯救溺水者的宝可梦");
	pchar PokedexDes420[] = _("在阳光下会渐渐变红 吸收养分\n小球瘪掉的话 就是说快要进化了");
	pchar PokedexDes421[] = _("花苞沐浴阳光后 会绽开花瓣并活\n泼地动起来");
	pchar PokedexDes422[] = _("平常在海里生活 但只要皮肤没有\n干燥 也可以在陆地活动");
	pchar PokedexDes423[] = _("曾经一直背着壳 在背的里面有着\n又硬又薄的壳的痕迹");
	pchar PokedexDes424[] = _("围绕着舒适的树木的问题 一直在\n和投掷猴群体争夺领地 但结果是\n五五分");
	pchar PokedexDes425[] = _("圆圆的身体里塞满了许多魂魄 每\n次带着谁一起走的时候 身体就会\n鼓起来");
	pchar PokedexDes426[] = _("谣传说 如果被乘着风在暮色里飞\n行的随风球捉住 就会被运送往那\n个世界");
	pchar PokedexDes427[] = _("手脚的力量很弱 但如果死命伸长\n紧紧卷起的耳朵 连大岩石也能粉\n碎");
	pchar PokedexDes428[] = _("一年会换2次毛 用这个毛制作的\n围巾和帽子非常温暖");
	pchar PokedexDes429[] = _("因为四处作祟 播撒诅咒而被人们\n所恐惧 也会随性地使用帮助人类\n的咒文");
	pchar PokedexDes430[] = _("绝对不能容忍失败或是背叛的跟班\n是为了维持群体的秩序 不得已\n而为之的");
	pchar PokedexDes431[] = _("一不称心 就会竖起爪子 但偶尔\n会从喉咙里发出声响来撒娇 这样\n的性格很受部分人喜爱");
	pchar PokedexDes432[] = _("即使是其他宝可梦的住所 如果感\n觉很舒服的话 就会赖着当做自己\n的住所");
	pchar PokedexDes433[] = _("每次跳跃都会发出铃铃声 用高频\n率的叫声让对手失聪");
	pchar PokedexDes434[] = _("从屁屁喷出的臭液的气味会扩散到\n半径2公里的范围 周围的宝可梦\n都会逃得无影无踪");
	pchar PokedexDes435[] = _("从尾巴尖端喷出带有恶臭的液体进\n行攻击 喷射距离能达到50米以\n上");
	pchar PokedexDes436[] = _("过去的人们相信 铜镜怪背上的花\n纹里蕴藏着神秘的力量");
	pchar PokedexDes437[] = _("从遥远的过去开始就作为能召唤雨\n云的宝可梦被供奉着 时不时会被\n埋入地下");
	pchar PokedexDes438[] = _("会从眼睛里排出水分 看起来就像\n是正在哭泣 所以似乎也有让敌人\n麻痹大意的效果");
	pchar PokedexDes439[] = _("会拼命地模仿对方的动作和表情\n但还说不上模仿得很好");
	pchar PokedexDes440[] = _("是非常温顺的宝可梦 但如果被夺\n走了腹部的圆石头 就会哭着大吵\n大闹");
	pchar PokedexDes441[] = _("通过发出与对手相同的叫声 让对\n方深信自己是同伴 从而免受袭击");
	pchar PokedexDes442[] = _("108个魂魄聚集在一起生成的宝\n可梦 被绑缚在楔石的裂缝里");
	pchar PokedexDes443[] = _("会对动的东西发生反应 飞扑过去\n咬住 有时候会伤到自己 但也不\n太在意");
	pchar PokedexDes444[] = _("非常喜欢发光的东西 如果发现正\n在攻击小碎钻的勾魂眼 就会非常\n生气地发动袭击");
	pchar PokedexDes445[] = _("以音速飞行 寻找猎物 围绕着食\n物的问题 和暴飞龙展开空中战");
	pchar PokedexDes446[] = _("长长的毛发下面藏着食物 但有时\n也会忘记藏了东西而发生异臭的问\n题");
	pchar PokedexDes447[] = _("能看见被称为波导的一种波 感知\n人和宝可梦的心情 不会靠近危险\n的对手");
	pchar PokedexDes448[] = _("它集中精神所放出的一种神奇的波\n被称为波导 连巨大的岩石都能\n击得粉碎");
	pchar PokedexDes449[] = _("在干燥的土地生活 是身体会分泌\n出沙粒而不是汗水的宝可梦");
	pchar PokedexDes450[] = _("嘴巴张得大大的 炫耀自己的强大\n向上卷起大量的沙子进行攻击");
	pchar PokedexDes451[] = _("用尾巴上的钩爪夹住猎物并注入毒\n素 很执着 毒不发作就绝不松开");
	pchar PokedexDes452[] = _("用引以为傲的力量把对手打得七零\n八落 而且还要用剧毒给对手致命\n一击");
	pchar PokedexDes453[] = _("脸颊上带有毒囊 会抓住对手的空\n当 用渗透了剧毒的手指猛戳");
	pchar PokedexDes454[] = _("喉咙里带有毒囊 如果从喉咙发出\n声响 储存的毒素会被炼制得更强\n劲");
	pchar PokedexDes455[] = _("先用甜香的唾液引诱猎物 然后用\n大颚大口地嚼 要花1整天吃掉猎\n物");
	pchar PokedexDes456[] = _("粉红色的花纹到了夜里就会发光\n很受潜水者欢迎 所以有时会被驯\n养在度假地");
	pchar PokedexDes457[] = _("深海的海底猎物很少 四处寻找宝\n贵的食物 和电灯怪展开激烈争夺");
	pchar PokedexDes458[] = _("非常不认生 很容易亲近 与小球\n飞鱼的互动巡游是非常受欢迎的海\n滩活动");
	pchar PokedexDes459[] = _("在寒冷的季节里 会迁移到山脚下\n一到春天就会返回积雪残留的山\n顶");
	pchar PokedexDes460[] = _("会引发暴风雪 让周围变得一片雪\n白 别名叫冰雪怪物");
	pchar PokedexDes461[] = _("1只负责绊住穿山鼠的脚 将其翻\n过来后 另1只用锐利的爪子给予\n致命一击");
	pchar PokedexDes462[] = _("用雷达监视着自己的领地 一旦发\n现入侵者 就会立即用破坏光线惩\n治");
	pchar PokedexDes463[] = _("会举行看谁舌头伸得远的大赛 目\n前的最高纪录是25米");
	pchar PokedexDes464[] = _("从手掌的洞里发射出小拳石 全身\n的护具连火山喷发都能经受住");
	pchar PokedexDes465[] = _("伸出由植物的藤蔓长成的手臂缠住\n猎物 即便手臂被吃掉也毫不在意");
	pchar PokedexDes466[] = _("握住冒着电火花的尾巴做成带电的\n拳头后 就会用尽全力猛殴");
	pchar PokedexDes467[] = _("至今仍依靠鸭嘴炎兽的火焰来加工\n金属的工厂也不少");
	pchar PokedexDes468[] = _("据说 波克基斯会访问没有争端的\n和平之地 给那里带去各种恩惠");
	pchar PokedexDes469[] = _("高速飞行着 在擦肩而过的瞬间咬\n断对手的脖子 它热衷这样的战斗\n方式");
	pchar PokedexDes470[] = _("本身并不好斗 但如果是为了保护\n伙伴 就会削尖尾巴上的叶片 变\n成刀刃来作战");
	pchar PokedexDes471[] = _("把体毛冻住 变成锐利的针来保护\n身体 体温最低可下降到零下60\n度");
	pchar PokedexDes472[] = _("用尾巴倒挂在树枝上观察猎物 瞅\n准空当就从上空发动袭击");
	pchar PokedexDes473[] = _("从遥远的过去就存在的宝可梦 甚\n至在1万年前的冰层中也发现过它");
	pchar PokedexDes474[] = _("不稳定的举动很惹人注目 这问题\n好像要归咎于负责升级程序的技术\n人员的水平");
	pchar PokedexDes475[] = _("因为有着能敏锐感知对手想法的能\n力 所以可以率先攻击");
	pchar PokedexDes476[] = _("操纵着被称为小朝北鼻的部件 但\n这些部件好像偶尔也会迷路 没法\n回来");
	pchar PokedexDes477[] = _("据说 会把无处可去的魂魄吸入它\n那具有弹力的身体中 并带往另一\n个世界");
	pchar PokedexDes478[] = _("把前来爬雪山的登山男冻成冰块\n带回自己的巢穴 而且只会盯上美\n男子");
	pchar PokedexDes479[] = _("作为驱动特殊马达的动力能源而被\n长期研究的宝可梦");
	pchar PokedexDes480[] = _("被称为知识之神 据说拥有消除与\n之目光交会者的记忆的力量");
	pchar PokedexDes481[] = _("教会了人们悲伤的痛苦和快乐的宝\n贵 被称为感情之神");
	pchar PokedexDes482[] = _("被称为意志之神 一直沉睡在湖底\n维持着世界的平衡");
	pchar PokedexDes483[] = _("由于帝牙卢卡的诞生 时间才开始\n流动 是有着这样传说的宝可梦");
	pchar PokedexDes484[] = _("据说居住在平行排列的空间狭缝中\n是出现在神话中的宝可梦");
	pchar PokedexDes485[] = _("栖息在火山的洞穴里 用十字形的\n爪子钩住墙壁和洞顶爬来爬去");
	pchar PokedexDes486[] = _("据说用特殊的冰山岩石和熔岩制\n作出了形似自己的宝可梦");
	pchar PokedexDes487[] = _("据说栖息在位于这个世界背面的毁\n坏的世界里 那里所有的常规都与\n这个世界不同");
	pchar PokedexDes488[] = _("飞行的时候 会从薄纱一样的翅膀\n中发出闪光粒子 被称为新月的化\n身");
	pchar PokedexDes489[] = _("如果海水的温度上升 该宝可梦就\n会让头部的浮囊膨胀起来 然后集\n体在海面上漂浮");
	pchar PokedexDes490[] = _("如果使用与生俱来的神奇力量 就\n可以和任何宝可梦心意相通");
	pchar PokedexDes491[] = _("用能引诱对方进入深度睡眠的力量\n让人和宝可梦做恶梦 并将其驱\n逐出自己的领地");
	pchar PokedexDes492[] = _("拥有分解大气中的毒素 让荒芜大\n地瞬间变成花圃的力量");
	pchar PokedexDes493[] = _("神奥神话里说 它从蛋中现身 并\n创造出了整个世界");
	pchar PokedexDes494[] = _("是会带来胜利的宝可梦 据说带着\n比克提尼的训练家会赢得任何对战");
	pchar PokedexDes495[] = _("如果沐浴在阳光下 就能比平时动\n作迅速 比起手 藤蔓用得更灵活");
	pchar PokedexDes496[] = _("像滑行一样在地面奔跑 用敏捷的\n动作迷惑敌人 然后用藤鞭了结");
	pchar PokedexDes497[] = _("君主蛇只会对那些即使被它高贵的\n眼眸盯着 也毫不畏惧的强大对手\n动真格");
	pchar PokedexDes498[] = _("可以轻巧地躲避敌人的攻击 从鼻\n子里射出火球来 会用火烤树果吃");
	pchar PokedexDes499[] = _("吃得越多 可供燃烧的东西就越多\n胃里的火会增强 力量也会源源\n不断地溢出");
	pchar PokedexDes500[] = _("用下颚的火焰燃烧拳头 连续使出\n火焰拳 是对伙伴非常体贴的宝可\n梦");
	pchar PokedexDes501[] = _("腹部长出的扇贝贝不只是战斗时使\n用 还能用来割开坚硬的树果");
	pchar PokedexDes502[] = _("通过严格的修炼 将使用2片扇贝\n贝的刀法运用得行云流水");
	pchar PokedexDes503[] = _("能在敌人眨眼的瞬间 用前脚上带\n有的双足刃切斩对手 然后将其收\n回");
	pchar PokedexDes504[] = _("会在颊囊里藏食物 连续放哨好几\n天 用尾巴给伙伴发出暗号");
	pchar PokedexDes505[] = _("用体内的发光物质让眼珠和身体闪\n闪发光 使来袭的敌人畏缩");
	pchar PokedexDes506[] = _("是拥有优秀判断力的宝可梦 如果\n判断出自己无法战胜对手 就会立\n即夹着尾巴逃走");
	pchar PokedexDes507[] = _("黑色的体毛会随着成长而变得坚硬\n结实 连爪子和牙齿也不能轻易穿\n透");
	pchar PokedexDes508[] = _("多亏了那身又长又暖和的毛 抵御\n寒冷根本不在话下 阿罗拉的长毛\n狗看上去有点辛苦");
	pchar PokedexDes509[] = _("用可爱的动作让对手疏忽 抓住那\n个空当抢夺持有物 一旦生气 就\n会竖起爪子反击");
	pchar PokedexDes510[] = _("优美的身姿归功于全身发达的肌肉\n能悄无声息地在夜间飞奔");
	pchar PokedexDes511[] = _("会把头上的叶子分给没有精神的宝\n可梦 具有缓解疲劳的效果");
	pchar PokedexDes512[] = _("用带有很多尖刺的尾巴摔打对手进\n行攻击 是性格很粗暴的宝可梦");
	pchar PokedexDes513[] = _("智商很高 有着将树果烤熟后再吃\n的习性 很喜爱给人类帮忙");
	pchar PokedexDes514[] = _("燃烧体内的火焰 从头和尾巴纷纷\n扬扬地撒出火花 把敌人都烧焦");
	pchar PokedexDes515[] = _("头上的毛发丛里储藏的水充满了营\n养 会用尾巴给草木浇这种水");
	pchar PokedexDes516[] = _("如果从尾巴发射出高压水 那威力\n甚至能破坏混凝土墙壁");
	pchar PokedexDes517[] = _("会出现在为恶梦所苦的宝可梦和人\n的面前 吃掉那个恶梦");
	pchar PokedexDes518[] = _("从额头冒出的烟雾里载满许许多多\n的人和宝可梦做的梦");
	pchar PokedexDes519[] = _("非常健忘的宝可梦 明明训练家已\n经下了命令 却还在等待着新命令");
	pchar PokedexDes520[] = _("人们相信 咕咕鸽所居住的森林深\n处有着没有战争的和平国度");
	pchar PokedexDes521[] = _("雄性会摇晃头上的冠羽威吓对手\n雌性的飞行能力在雄性之上");
	pchar PokedexDes522[] = _("天空雷雨云密布时就会出现 用鬃\n毛捕捉雷电 储存电力");
	pchar PokedexDes523[] = _("性格粗暴的宝可梦 如果发脾气\n就会从鬃毛里向着四面八方放电");
	pchar PokedexDes524[] = _("六角形的洞是它的耳朵 耳朵里面\n有能量核心 所以如果把手伸进去\n就会发怒");
	pchar PokedexDes525[] = _("从身体里溢出的能量变成了橙色的\n结晶 其硬度连钻石都能弄碎");
	pchar PokedexDes526[] = _("如果以全力射出能量 那力量能让\n它自己的身体骤然产生出无数裂缝");
	pchar PokedexDes527[] = _("生活在昏暗的森林和洞穴中 从鼻\n孔里发出超音波探查周边的情形");
	pchar PokedexDes528[] = _("发出连混凝土都能破坏的强力超音\n波时 尾巴会激烈地振动");
	pchar PokedexDes529[] = _("将双掌上的爪子并拢 并让身体高\n速旋转的话 就会以迅猛的速度在\n地里前进");
	pchar PokedexDes530[] = _("进化成钢的钻头拥有穿透铁板的破\n坏力 在隧道工程里非常活跃");
	pchar PokedexDes531[] = _("通过耳朵上的触角 能了解对方的\n身体状况 甚至连宝可梦何时从蛋\n里孵出来都能知道");
	pchar PokedexDes532[] = _("总是抱着方材 是会出现在建筑工\n地帮忙干活的宝可梦");
	pchar PokedexDes533[] = _("肌肉锻炼得很棒 能够灵巧地操纵\n工字钢 将整座屋子拆除");
	pchar PokedexDes534[] = _("制作混凝土的技术 被认为是20\n00年前从修建老匠那儿学来的");
	pchar PokedexDes535[] = _("振动脸颊上的振动膜 发出人类无\n法听见的音波向伙伴们传递危险警\n告");
	pchar PokedexDes536[] = _("如果让头上的瘤振动 不只是水里\n泛起波浪 连地面也会像地震一样\n摇晃");
	pchar PokedexDes537[] = _("如果让拳头上的瘤振动 拳击的威\n力就会倍增 能一拳把巨大岩石击\n得粉碎");
	pchar PokedexDes538[] = _("如果系紧带子 力量就会提升 野\n生的投摔鬼会编织藤蔓做成自己的\n带子");
	pchar PokedexDes539[] = _("因追求最强的空手劈而隐居在深山\n里 不眠不休地修行");
	pchar PokedexDes540[] = _("咬断叶子 用嘴里吐出的粘丝进行\n缝合 是会自己做衣服的宝可梦");
	pchar PokedexDes541[] = _("宝包茧会把落叶转换成养分 所以\n它居住的森林总是草木繁茂");
	pchar PokedexDes542[] = _("如果发现幼小的宝可梦 就会用嘴\n里吐出的粘丝为它缝制叶子衣服");
	pchar PokedexDes543[] = _("用头和尾巴上的触角探查周围的情\n形 性格非常粗暴");
	pchar PokedexDes544[] = _("被坚硬的壳保护着 像轮胎那样地\n旋转 猛烈地撞击敌人");
	pchar PokedexDes545[] = _("用颈部的爪子夹住猎物 让对方动\n弹不得之后 施以剧毒 一击毙命");
	pchar PokedexDes546[] = _("会喷出棉花保护身体 如果淋到雨\n棉花就会受潮变重 身体变得动\n弹不得");
	pchar PokedexDes547[] = _("潜入民居 藏起重要的东西 或是\n在屋子里到处撒棉花 是个捣蛋的\n家伙");
	pchar PokedexDes548[] = _("如果利用阳光晒干它头上的叶子\n再煎煮后饮用 会马上变得有活力\n在老年人中很受欢迎");
	pchar PokedexDes549[] = _("根据栽培土壤的成分不同 花香也\n会略微不一样 闻一下就能治愈心\n灵 心情舒畅");
	pchar PokedexDes550[] = _("是性格粗暴又凶猛的宝可梦 红色\n和蓝色的野蛮鲈鱼总是为了领地问\n题打架");
	pchar PokedexDes551[] = _("对它来说 全年温暖的阿罗拉是很\n容易生活的环境 即使在沙漠以外\n也时常能见到");
	pchar PokedexDes552[] = _("非常害怕身体变冷 在气温下降的\n夜晚会潜藏在沙漠的沙子深处");
	pchar PokedexDes553[] = _("如果发现前方50公里处的猎物\n就会像游泳一样在沙漠里移动 扑\n过去咬住");
	pchar PokedexDes554[] = _("火红不倒翁的粪便是热的 因此过\n去的人们会放入怀中取暖");
	pchar PokedexDes555[] = _("如果在激烈的战斗中受伤 就会像\n岩石一样一动不动 沉思着磨炼自\n己的心智");
	pchar PokedexDes556[] = _("对于那些以花的种子为目标的天敌\n鸟宝可梦 会用节奏轻快的舞蹈和\n音乐来驱赶");
	pchar PokedexDes557[] = _("在合适的石头上开洞作为住所 如\n果被破坏 在找到替代的石头之前\n会一直心里不踏实");
	pchar PokedexDes558[] = _("脚力非常的好 身上背负着很重的\n岩石 还能在干燥的土地上移动多\n日");
	pchar PokedexDes559[] = _("几只为一组行动 漫无目的地到处\n走 会冷不丁地向视线相遇的对手\n施以头锤");
	pchar PokedexDes560[] = _("性格粗鲁 但是对于自己的家族\n群体的伙伴和领地 非常重视");
	pchar PokedexDes561[] = _("曾是古代都市的守护神 用精神力\n量攻击入侵领地的敌人");
	pchar PokedexDes562[] = _("埋葬在墓穴里的人类灵魂变化而成\n的宝可梦 还残留着死前的记忆");
	pchar PokedexDes563[] = _("有传言说 它会吞掉接近它的人类\n做成木乃伊 喜欢吃金块");
	pchar PokedexDes564[] = _("由古代的化石复活而来 曾生活在\n海里 但也会到陆地上来寻找猎物");
	pchar PokedexDes565[] = _("颚部的力量非常惊人 连多刺菊石\n兽和菊石兽的壳也能轻轻松松地整\n个吃掉");
	pchar PokedexDes566[] = _("被认为是所有鸟宝可梦的祖先 但\n最近的研究里也有说法认为这个是\n错误的");
	pchar PokedexDes567[] = _("古代的宝可梦 因为羽毛很细 所\n以如果不是熟练的匠人 就会复原\n失败");
	pchar PokedexDes568[] = _("呼吸的时候会有毒瓦斯漏出 臭臭\n泥闻到气味就会流着口水赶过来");
	pchar PokedexDes569[] = _("用左臂锁住敌人后 会将有毒的液\n体泼向对方全身 封住其行动");
	pchar PokedexDes570[] = _("性格胆小的宝可梦 不和伙伴呆在\n一起的时候 通常都会幻化成其他\n东西");
	pchar PokedexDes571[] = _("不只是幻化成其他东西 还拥有让\n几百人看见幻像的力量");
	pchar PokedexDes572[] = _("因为有洁癖 所以不能容忍一丁点\n儿的脏污 会把尾巴当做拖把彻底\n地清除脏污");
	pchar PokedexDes573[] = _("白色的毛发上涂满身体里渗出的油\n连敌人的攻击也能滑溜溜地避开");
	pchar PokedexDes574[] = _("用蝴蝶结一样的触角让精神力量增\n强 一直都目不转睛地盯着什么");
	pchar PokedexDes575[] = _("星光是其力量的来源 到了夜里就\n会用精神力量让石头浮起 按星星\n的分布排列");
	pchar PokedexDes576[] = _("受强大的精神力量的影响 哥德小\n姐周围的空间会扭曲 数万光年之\n外的星空也能映照出来");
	pchar PokedexDes577[] = _("身体被特殊的液体包裹着 所以无\n论多么严峻的情况都能平安无事");
	pchar PokedexDes578[] = _("因为有着一分为二的大脑 所以有\n时会突然采取不同的行动");
	pchar PokedexDes579[] = _("使用发出的精神力量 操纵特殊液\n体做成的手臂将岩石击碎");
	pchar PokedexDes580[] = _("如果被敌人袭击 就会从全身的羽\n毛里喷出水花 混在一片水雾中逃\n之夭夭");
	pchar PokedexDes581[] = _("尽管有着优雅的外表 挥动翅膀时\n却很用力 可以连续飞行几千公里");
	pchar PokedexDes582[] = _("会吐出零下50度的冷气 如果呆\n在温暖的场所 就会一点点地变小");
	pchar PokedexDes583[] = _("喷出冰粒 冻住敌人的身体 阿罗\n拉的多多冰整体都是小型的");
	pchar PokedexDes584[] = _("从2张嘴里喷出暴风雪 无论在哪\n里都能制作出雪来 所以很受滑雪\n和滑雪板爱好者欢迎");
	pchar PokedexDes585[] = _("不只是换季时 即使是气温和湿度\n的变化 身体颜色也会有稍稍改变");
	pchar PokedexDes586[] = _("会根据季节改变住所 人们会通过\n萌芽鹿的角来感知季节的变迁");
	pchar PokedexDes587[] = _("蓄着电在空中飞行 有时甚至会在\n雷鸣的深夜里 密密麻麻布满整个\n天空");
	pchar PokedexDes588[] = _("与小嘴蜗在一起时 如果受到电的\n刺激就会进化的神奇宝可梦");
	pchar PokedexDes589[] = _("用从小嘴蜗那里抢来的壳盖住自己\n的身体 一边防守一边用2根长矛\n突刺");
	pchar PokedexDes590[] = _("以酷似精灵球的花纹引诱对手并向\n其喷出毒孢子 为何那么像还是一\n个谜");
	pchar PokedexDes591[] = _("显摆着精灵球状的菌伞引诱猎物靠\n近 但是被骗到的宝可梦很少");
	pchar PokedexDes592[] = _("会用薄纱般的手脚缠住正在游泳的\n猎物 将其拖入深海之中");
	pchar PokedexDes593[] = _("会缠着豪华客轮或是油轮周围 目\n的是将猎物拖进海里");
	pchar PokedexDes594[] = _("渔夫在长距离航海时会带着它 因\n为有了保姆曼波 医生和药都不需\n要了");
	pchar PokedexDes595[] = _("因为自己不能制造电 所以会附在\n其它大型宝可梦身上吸取静电");
	pchar PokedexDes596[] = _("会用带电的丝设下陷阱 会慢慢地\n享用触电后无法动弹的猎物");
	pchar PokedexDes597[] = _("察觉到危险的同时会发射尖刺反击\n然后趁机翻滚着逃跑");
	pchar PokedexDes598[] = _("挥打3根触手 然后射出尖刺 将\n对手粉碎 不留痕迹");
	pchar PokedexDes599[] = _("通过2个身体的咬合旋转 制造出\n用以生存的能量");
	pchar PokedexDes600[] = _("通过改变旋转的方向来向伙伴传递\n感情 越是生气 旋转得就越快");
	pchar PokedexDes601[] = _("让带有红色核心的齿轮高速旋转\n便能快速填充能量");
	pchar PokedexDes602[] = _("1条的电力虽小 但是许多麻麻小\n鱼聚在一起 其威力可以比得上雷\n电");
	pchar PokedexDes603[] = _("缠住对手 从圆圆的斑点放出电流\n通过对方身体 使其麻痹后啃食");
	pchar PokedexDes604[] = _("用吸盘一样的嘴巴吸住猎物 并从\n刺入的牙齿中释放电流 使对方触\n电");
	pchar PokedexDes605[] = _("操纵着非常惊人的精神力量 大多\n数目击外星人的信息都是错把小灰\n怪看成外星人了");
	pchar PokedexDes606[] = _("会用精神力量改写对手的记忆 你\n说不定也已经被改写了");
	pchar PokedexDes607[] = _("假装点亮烛光 指引道路 实际上\n是在吸取对方的生命力");
	pchar PokedexDes608[] = _("吸取灵魂来点亮灯火 为了等待人\n类死去 而在医院里彷徨游荡");
	pchar PokedexDes609[] = _("如果被水晶灯火灵的火焰包围 魂\n魄就会被吸取燃烧 只剩下行尸走\n肉");
	pchar PokedexDes610[] = _("用牙齿粉碎树果后食用 牙齿会通\n过多次再生 变得无比强劲锐利");
	pchar PokedexDes611[] = _("拥有能粉碎巨大岩石的牙齿 争夺\n领地的斧牙龙们会进行非常激烈的\n争斗");
	pchar PokedexDes612[] = _("性格温和 但对于入侵领地者绝不\n会手软 会用削铁如泥的牙齿发起\n挑战");
	pchar PokedexDes613[] = _("总是流着鼻涕 吸着鼻涕使出招式\n鼻涕是招式的本源");
	pchar PokedexDes614[] = _("喜欢北方冰冷的大海 将嘴里吐出\n的气息冻结 在海上铺成道路来行\n走");
	pchar PokedexDes615[] = _("在雪云之中诞生 用冰的结晶所形\n成的锁捕捉猎物");
	pchar PokedexDes616[] = _("与盖盖虫在一起时 如果受到电的\n刺激 双方的身体就会进化");
	pchar PokedexDes617[] = _("因为脱掉了沉重的壳 而变得轻巧\n会用简直是忍者般的身手战斗");
	pchar PokedexDes618[] = _("皮肤坚硬 所以即使被相扑力士踩\n踏也照样淡定自如 释放电流时\n会喜笑颜开");
	pchar PokedexDes619[] = _("可以在早上看到用慢悠悠的动作摆\n出各种姿势的群体哦");
	pchar PokedexDes620[] = _("会用连续攻击压倒对手 致命的一\n击会在缓慢蓄力后施展出来");
	pchar PokedexDes621[] = _("红色脸孔上的皮肤比岩石还要硬\n在狭窄的洞窟中 会用脸朝向敌人\n发动突击");
	pchar PokedexDes622[] = _("因谜一般的能量而活动 因为从古\n代开始就持续活动 说不定很快就\n会用尽力量");
	pchar PokedexDes623[] = _("据说 古代人发明了泥偶巨人作为\n他们的劳动力 它很忠实于主人的\n命令");
	pchar PokedexDes624[] = _("在劈开猎物后 会用河滩的石头将\n刀刃磨快 不同的驹刀小兵都有各\n自喜欢的石头");
	pchar PokedexDes625[] = _("据说 无论是多么强大的劈斩司令\n一旦头部的刀刃有损伤 就会从\n首领的位置上引退");
	pchar PokedexDes626[] = _("一往无前地猛冲 使出头锤 拥有\n让奔跑的列车脱轨的破坏力");
	pchar PokedexDes627[] = _("用强大的脚力和结实的爪子 连大\n舌贝的坚硬外壳都能弄碎 将里面\n的东西啄出来");
	pchar PokedexDes628[] = _("正面伤越多 就表示越勇敢 而背\n面受伤多的则会在群体中受到轻视");
	pchar PokedexDes629[] = _("骸骨是秃鹰娜所给予的 翅膀很短\n还不会飞 但是一直憧憬着天空\n而蹦蹦跳跳的");
	pchar PokedexDes630[] = _("会使用所吃猎物的骨头灵巧地做成\n自己的巢穴 大多数骨头都是卡拉\n卡拉的");
	pchar PokedexDes631[] = _("用高温燃烧的火焰舌头熔化铁蚁的\n钢铁身体 并吃掉其内部");
	pchar PokedexDes632[] = _("面对天敌熔蚁兽时 大家会分工合\n作进行反击 把它从巢穴中驱赶出\n去");
	pchar PokedexDes633[] = _("因为眼睛看不见 所以会又撞又咬\n地来探索周围 浑身新伤不断");
	pchar PokedexDes634[] = _("2个头之间关系恶劣 都想比对方\n吃得更多来掌握主导权");
	pchar PokedexDes635[] = _("双臂上的头是没有大脑的 用3个\n头把一切都吃光并破坏掉");
	pchar PokedexDes636[] = _("从5只角中喷出火焰与对手战斗\n那温度最高可达3000度");
	pchar PokedexDes637[] = _("一边挥撒火焰鳞粉一边到处飞翔\n古代的人们惧怕地称之为太阳的怒\n火");
	pchar PokedexDes638[] = _("拥有钢铁的身体和心灵 只要瞪一\n眼 连粗暴的宝可梦也会俯首称臣");
	pchar PokedexDes639[] = _("拥有一击冲破巨大城墙的猛撞力\n是传说中所描述的宝可梦");
	pchar PokedexDes640[] = _("头上的角是锋利的刀刃 用旋风般\n的动作戏弄敌人 迅速切斩");
	pchar PokedexDes641[] = _("下半身被云一样的能量体包裹着\n以300公里的时速在空中飞行");
	pchar PokedexDes642[] = _("用尾巴上的尖刺射电攻击 在合众\n地区的天空飞来飞去制造雷电");
	pchar PokedexDes643[] = _("用火焰让世界燃烧殆尽的传说的宝\n可梦 会帮助构筑真实世界的人");
	pchar PokedexDes644[] = _("用闪电让世界燃烧殆尽的传说的宝\n可梦 会辅佐创造理想世界的人");
	pchar PokedexDes645[] = _("土地云造访的土地 作物收成必定\n大好 因此被称为农田之神");
	pchar PokedexDes646[] = _("等待着用真实与理想填补自己失去\n的身体的英雄 是冰之传说的宝可\n梦");
	pchar PokedexDes647[] = _("在江河湖海的水面奔跑 驰骋全世\n界 会出现在美丽的水边");
	pchar PokedexDes648[] = _("美洛耶塔演奏的旋律拥有让周围的\n宝可梦或悲或喜的力量");
	pchar PokedexDes649[] = _("被等离子队改造过的古代的虫宝可\n梦 背上的大炮力量得到了提升");
	pchar PokedexDes650[] = _("头部的刺平时很柔软 如果注入了\n力量 就会变尖锐 硬得连岩石也\n能刺穿");
	pchar PokedexDes651[] = _("覆盖着身体的结实外壳能反弹敌人\n的攻击 会用锐利的刺反击");
	pchar PokedexDes652[] = _("有着用身体撞击来弄翻50吨重坦\n克的力量 会把自己当作护盾来保\n护伙伴");
	pchar PokedexDes653[] = _("吃小树枝后就会变得充满活力 会\n从大大的耳朵里喷出超过摄氏20\n0度的热气");
	pchar PokedexDes654[] = _("尾巴上插着树枝 通过尾巴上的毛\n摩擦生热 点燃树枝来战斗");
	pchar PokedexDes655[] = _("盯着木杖前端燃烧着的火焰 集中\n精神的话 就能看透未来发生之事");
	pchar PokedexDes656[] = _("从胸部和背部发出泡泡 用具有弹\n力的泡泡抵挡攻击 减少伤害");
	pchar PokedexDes657[] = _("使用投掷被泡泡包着的小石头的招\n式 控制力很强 可以击中30米\n外的空罐子");
	pchar PokedexDes658[] = _("压缩水 制造出手里剑 让它高速\n旋转后飞出的话 连金属也能一劈\n两半");
	pchar PokedexDes659[] = _("用大大的耳朵挖掘地面制造巢穴\n可以整晚不休息连续不停地挖");
	pchar PokedexDes660[] = _("大大的耳朵拥有轻松举起超过1吨\n重的岩石的力量 在施工现场非常\n活跃");
	pchar PokedexDes661[] = _("是和人很亲近的宝可梦 但如果强\n行触碰 它就会让身体一下子发热\n从而造成灼伤");
	pchar PokedexDes662[] = _("向草丛挥撒火花 然后大口吞食被\n火焰吓到从草丛跳出来的虫宝可梦");
	pchar PokedexDes663[] = _("羽毛很结实 连火都烧不穿 过去\n的消防员服就是用烈箭鹰的羽毛做\n成的");
	pchar PokedexDes664[] = _("如果被鸟宝可梦袭击 就会挥撒黑\n色的粉 是一旦接触就会麻痹的毒\n粉");
	pchar PokedexDes665[] = _("隐藏在繁茂的树荫中生活 一旦被\n敌人袭击 就会尖尖地竖起体毛威\n吓对方");
	pchar PokedexDes666[] = _("世界上有着各种各样翅膀花纹的彩\n粉蝶 好像是受所居住土地的气候\n影响");
	pchar PokedexDes667[] = _("小时候会与伙伴们群居生活 一旦\n自己能捕猎后 就会被赶出群体独\n立生活");
	pchar PokedexDes668[] = _("雄性平时总是拖拖拉拉的 但如果\n有强敌来袭 就会不顾自身 保护\n伙伴");
	pchar PokedexDes669[] = _("如果没有花的力量 就会很危险\n但是在找到喜爱的颜色和形状之前\n会不断地旅行");
	pchar PokedexDes670[] = _("会培育花朵当作自己的武器来用\n越是开得美丽的花 蕴藏着的力量\n就越强大");
	pchar PokedexDes671[] = _("会操纵自己培育的花 花洁夫人释\n放的落英缤纷 其美貌和力量都是\n压倒性的");
	pchar PokedexDes672[] = _("据说是最早能够和人一起生活的宝\n可梦 性格很温和");
	pchar PokedexDes673[] = _("从握角的细微差异就能读取训练家\n的心情 所以会心灵一体奔跑");
	pchar PokedexDes674[] = _("像跟班那样跟在流氓熊猫后头 如\n果犯了重大错误 叶子就会被拿走");
	pchar PokedexDes675[] = _("以腕力为傲的野性的宝可梦 性格\n豪爽 因此迷恋它的训练家也很多");
	pchar PokedexDes676[] = _("曾有过一个时代 贵族之间会比赛\n如何把它的体毛修剪得美丽");
	pchar PokedexDes677[] = _("为了不让强大的精神力量漏出 用\n耳朵捂住释放力量的器官");
	pchar PokedexDes678[] = _("如果危险逼近 就会竖起耳朵 释\n放出能拧碎10吨重卡车的精神力\n量");
	pchar PokedexDes679[] = _("好像是死者的灵魂寄宿在古剑上转\n生而成 会附在人类身上吸食生命");
	pchar PokedexDes680[] = _("进化后分裂为2把 通过心灵感应\n对话 用配合攻击砍碎敌人");
	pchar PokedexDes681[] = _("曾跟随着历代国王 用灵力控制人\n和宝可梦的心 使之服从");
	pchar PokedexDes682[] = _("从身体里飘出令闻者神魂颠倒的香\n气 香气会因所吃的食物而改变");
	pchar PokedexDes683[] = _("制作出各种各样的气味 发出对手\n讨厌的气味 让战斗朝对自己有利\n的方向推进");
	pchar PokedexDes684[] = _("放出像棉花糖那样又甜又黏的白丝\n缠住对手 封住其行动");
	pchar PokedexDes685[] = _("拥有即便是细微气味也能区分的敏\n锐嗅觉 是西点师傅的好帮手");
	pchar PokedexDes686[] = _("闪烁着光 让猎物受诱惑靠近后\n会用长长的触手缠住对方 封住其\n行动");
	pchar PokedexDes687[] = _("会使用强力的催眠术 用此来做坏\n事者源源不断");
	pchar PokedexDes688[] = _("2只龟脚脚生活在一块岩石上 如\n果吵架了 就会有某只转移到其他\n岩石上去");
	pchar PokedexDes689[] = _("进化的时候 2只龟脚脚会分裂为\n7只的宝可梦 会以7只的力量战\n斗");
	pchar PokedexDes690[] = _("同碎藻混杂在一起 为了不被大型\n宝可梦袭击 一直一动不动的 以\n腐烂的海藻为主要食物");
	pchar PokedexDes691[] = _("性格粗暴 会朝靠近的对手喷出毒\n液 不知为何 只和破破舵轮关系\n非常好");
	pchar PokedexDes692[] = _("钳子时常会掉落 在再生之前 会\n悄悄地生活 钳子里面的肉非常美\n味哦");
	pchar PokedexDes693[] = _("压缩吸入的水 然后射出去 那威\n力连很厚的铁板都能打穿一个洞");
	pchar PokedexDes694[] = _("在沙漠生活 只要能沐浴着阳光发\n电 即使不吃食物也安然无恙");
	pchar PokedexDes695[] = _("会张开颈伞发电 1只光电伞蜥就\n能制造出一栋高层建筑所必需的电");
	pchar PokedexDes696[] = _("大颚有着非常惊人的破坏力 有说\n法 即使复原 也没法恢复到原本\n的样子");
	pchar PokedexDes697[] = _("有说法 要完全复原是不可能的\n实际上它全身都是羽毛一样的毛发");
	pchar PokedexDes698[] = _("曾栖息在古代寒冷的土地上 据说\n冰雪龙鸣叫的时候 夜空中会出\n现极光");
	pchar PokedexDes699[] = _("报道里说 在冰山中发现了被冻住\n的冰雪巨龙 仍保持着当时的样子");
	pchar PokedexDes700[] = _("一旦进入战斗状态 即使面对比自\n己大几倍的龙宝可梦 也会毫不畏\n惧地飞扑过去");
	pchar PokedexDes701[] = _("用速度快的招式压倒对手 使出必\n杀技时的展示时间过长 有时候会\n陷入危机");
	pchar PokedexDes702[] = _("潜入民居 从插座里偷电 电费很\n奇怪的时候 就是这家伙的杰作");
	pchar PokedexDes703[] = _("据说 在地底的深处 有着小碎钻\n群体和它们的女王共同生活的宝石\n王国");
	pchar PokedexDes704[] = _("用角探索周围的情况 非常敏感\n所以只要被握住 就会因震惊而无\n法动弹");
	pchar PokedexDes705[] = _("慢吞吞地爬行移动 旋涡状的突起\n里装着大脑和内脏");
	pchar PokedexDes706[] = _("和人非常亲近 变得亲密后 会用\n被黏糊糊的黏液包裹着的身体抱住\n人的身体 要忍耐哦");
	pchar PokedexDes707[] = _("不知为何要收集钥匙 但如果给它\n的话 就会很高兴 不过好像不是\n万能钥匙就不喜欢");
	pchar PokedexDes708[] = _("会模拟孩子的声音将人引入森林的\n深处让其迷失 因为打算让对方做\n自己的伙伴");
	pchar PokedexDes709[] = _("人们惧怕它 认为它是森林的妖怪\n樵夫们会带着朽木妖讨厌的火属\n性宝可梦再进入森林");
	pchar PokedexDes710[] = _("南瓜的身体里有无法往生的灵魂\n黄昏到来便开始活动");
	pchar PokedexDes711[] = _("在朔月的夜晚一边在街上游荡一边\n用诡异的声音唱歌 如果听到那歌\n声 就会被诅咒");
	pchar PokedexDes712[] = _("覆盖着身体的冰可以抵御敌人的攻\n击 即使被打破也能立即用冷气结\n起冰");
	pchar PokedexDes713[] = _("冻住的身体像钢铁一样坚硬 用巨\n大身躯压碎挡道的东西移动");
	pchar PokedexDes714[] = _("喜欢吃水果 会用超音波击中水果\n然后只挑选出已成熟的来食用\n是个美食家");
	pchar PokedexDes715[] = _("性格粗暴 但如果给它喜爱吃的成\n熟水果 就会一反常态 变得很亲\n切");
	pchar PokedexDes716[] = _("据说 能够分享出永恒的生命 以\n树木的样子睡了1000年后复活");
	pchar PokedexDes717[] = _("展开翅膀和尾羽 闪着红色光芒时\n就会吸取生物的生命 是传说的\n宝可梦");
	pchar PokedexDes718[] = _("基格尔德的一部分大约聚集了一半\n的样子 有着监视生态系统的职责");
	pchar PokedexDes719[] = _("小碎钻的突变体 闪着粉红色光辉\n的身体被赞为全世界最美");
	pchar PokedexDes720[] = _("真正的样子拥有着巨大的力量 传\n说 因为对财宝的欲望 曾将藏着\n财宝的整个城堡连根拔起夺走");
	pchar PokedexDes721[] = _("喷出水蒸气 用浓雾隐藏自己 据\n说住在人类不会进入的山里");
	pchar PokedexDes722[] = _("射出像刀刃般锐利的羽毛进行攻击\n脚上的力量也很强 脚踢也不可\n小觑");
	pchar PokedexDes723[] = _("非常自恋 又爱美 如果不勤快地\n给它打理 或许会不听话");
	pchar PokedexDes724[] = _("会搭上箭羽射向对手 在绝对不想\n射偏时 会拉紧头上的藤蔓集中精\n神");
	pchar PokedexDes725[] = _("如果被纠缠不休 就不会再打开心\n扉 即使亲近起来 过多的亲密接\n触也是禁忌");
	pchar PokedexDes726[] = _("如果亲近了 也会对训练家撒娇\n但是力量很强 爪子也很锋利 所\n以会被弄得全身是伤");
	pchar PokedexDes727[] = _("性格暴躁又任性 但讨厌欺凌弱小\n这类无聊的事 对于强大的对手会\n拿出干劲来");
	pchar PokedexDes728[] = _("通过每天不断地重复练习 用鼻子\n吹起来的气球一点点地变大起来");
	pchar PokedexDes729[] = _("如果看到没见过的舞蹈 就会很兴\n奋 会拼命练习直到自己也会跳为\n止 是个很努力的家伙哦");
	pchar PokedexDes730[] = _("对于西狮海壬来说 战斗就是舞台\n华丽地唱着歌跳着舞 给猎物致\n命一击");
	pchar PokedexDes731[] = _("会用坚硬的鸟嘴啄树木 通过啄击\n的节奏 大致就能知道它当时的心\n情和身体状况");
	pchar PokedexDes732[] = _("嘟起鸟嘴的嘴尖 可以自由地叫出\n100种以上的声音");
	pchar PokedexDes733[] = _("与伙伴互相敲击鸟嘴进行交流 通\n过敲击的强度和次数来互相传达心\n情");
	pchar PokedexDes734[] = _("长长的躯体里面基本都是胃 因为\n食量很大 伙食费不可小觑");
	pchar PokedexDes735[] = _("原本在阿罗拉是没有的 但过去小\n拉达大量出现的时候被带了过来");
	pchar PokedexDes736[] = _("即使发现了它的巢穴 也不能贸然\n把手伸进去 会被强颚鸡母虫厌烦\n而咬住");
	pchar PokedexDes737[] = _("埋在落叶里一动不动 专心致志地\n吃着腐叶土 如果不小心错踩到它\n就会被电到");
	pchar PokedexDes738[] = _("腹部拥有发电器官 在大颚里收集\n能量 释放出惊人的电击");
	pchar PokedexDes739[] = _("坚硬的钳子攻守皆宜 好胜蟹同类\n之间的战斗就像是拳击一样");
	pchar PokedexDes740[] = _("在钳子中积蓄冷气 然后猛殴 即\n使是很厚的冰壁也能打得粉碎");
	pchar PokedexDes741[] = _("用欢乐的舞蹈振奋敌人的心 趁其\n麻痹大意时发出电击让其触电");
	pchar PokedexDes742[] = _("喜欢吃花蜜和花粉 会在花圃里寻\n找食物 和巴大蝶展开小冲突");
	pchar PokedexDes743[] = _("因为花粉会湿 所以讨厌下雨 如\n果开始阴云密布了 就会静静地躲\n在树洞里不行动");
	pchar PokedexDes744[] = _("随着成长 性格也会变得粗暴而有\n攻击性 因难以应付而丢弃它的训\n练家也不少");
	pchar PokedexDes745[] = _("鬃毛里的岩石像刀子一样锋利 会\n对猎物穷追不舍 待其慢慢虚弱后\n再给予致命一击");
	pchar PokedexDes746[] = _("因为很弱小 所以会群体行动 但\n也经常能见到走散后独自1只在游\n泳的样子");
	pchar PokedexDes747[] = _("因为它会吃太阳珊瑚的枝 所以被\n收集自然掉落的枝来加工的匠人们\n所厌恶");
	pchar PokedexDes748[] = _("会射出有剧毒的尖刺攻击敌人 用\n脚上的爪子扫平靠近的对手");
	pchar PokedexDes749[] = _("非常喜欢玩泥巴 如果不每天在泥\n巴里玩的话 就会因压力而不听话");
	pchar PokedexDes750[] = _("无论发生什么都不会动 非常好静\n把嘴里含着的土和唾液混合 制\n作成特殊的泥");
	pchar PokedexDes751[] = _("如果滴蛛同类之间相遇 它们会自\n豪地用头上的水泡炫耀 水泡小的\n一方就会让路");
	pchar PokedexDes752[] = _("平常就是水里生活 肚子饱的时候\n会把抓获的猎物收纳在头部的水\n泡里");
	pchar PokedexDes753[] = _("太阳升起后 就会展开4片叶子进\n行日光浴 会从头顶发出好闻的味\n道哦");
	pchar PokedexDes754[] = _("为了保护自己而伪装成虫宝可梦\n双臂的花瓣非常锋利");
	pchar PokedexDes755[] = _("在周围到处撒发光的孢子 虽然危\n险 但去睡睡菇居住的森林进行夜\n巡很受人们欢迎");
	pchar PokedexDes756[] = _("让猎物睡着 然后从手腕处夺走对\n方的生命气息 伙伴虚弱的话 就\n会输送生命气息给予拯救");
	pchar PokedexDes757[] = _("雄性基本对雌性唯命是从 获得的\n食物也基本都会上缴 所以因营养\n不足而无法进化");
	pchar PokedexDes758[] = _("居住在洞窟的深处 让那些因费洛\n蒙而着迷的夜盗火蜥侍奉自己");
	pchar PokedexDes759[] = _("以连大树都能折断的力量而自豪\n从臀部的器官发出气味 与伙伴进\n行交流");
	pchar PokedexDes760[] = _("大幅度地挥手是威吓和警戒的信号\n一刻也不能耽误 不逃就没命了");
	pchar PokedexDes761[] = _("因为闻起来又甜又香的气味而被鸟\n宝可梦袭击 但是不太聪明 所以\n根本没在意");
	pchar PokedexDes762[] = _("因为被坚硬的壳盖保护着 所以和\n鸟宝可梦都能淡定地玩耍 就算反\n复被啄也不会在意");
	pchar PokedexDes763[] = _("优美的脚踢招式的行家 就连搏击\n冠军也能用一招脚踢将对方击倒");
	pchar PokedexDes764[] = _("从头上伸出有粘性的藤蔓 用摘下\n的花朵装饰自己 没有花就会感到\n不安");
	pchar PokedexDes765[] = _("平常就在树上冥想着度日 会随意\n投掷精灵球 命令宝可梦");
	pchar PokedexDes766[] = _("使用唾液将叶片贴在肩上做标记\n通过叶片的分布就能明白是哪个群\n体哦");
	pchar PokedexDes767[] = _("无论是什么掉落的东西 都会捡\n因为有时候也会拿着硬币 所以会\n被黑暗鸦和喵喵袭击");
	pchar PokedexDes768[] = _("覆盖着身体的坚硬外壳拥有媲美钻\n石的强度 为了胜利会不择手段");
	pchar PokedexDes769[] = _("很喜欢头上的小铲子,会和回来拿\n的孩子打架 互相打着打着就当真\n了");
	pchar PokedexDes770[] = _("即使是一粒沙子也有思想 会吞下\n小型的宝可梦 活生生地夺走对方\n的生命气息");
	pchar PokedexDes771[] = _("扔拳海参的文化始于将冲上岸的拳\n海参扔回海里这个习俗");
	pchar PokedexDes772[] = _("是为了某个任务而被开发出来的宝\n可梦武器 因为在试验中暴走而被\n冻结了");
	pchar PokedexDes773[] = _("觉醒进化后的样子 从沉重的面罩\n里被解放出来 速度大幅提升");
	pchar PokedexDes774[] = _("能遇到从夜空掉落的小陨星的地点\n是有限的 阿罗拉正是这宝贵的地\n方之一");
	pchar PokedexDes775[] = _("出生后就一直都睡着 进入深度睡\n眠的时候 会变的一动也不动");
	pchar PokedexDes776[] = _("栖息在火山 吃硫磺和矿物 所吃\n食物的成分会成为爆炸的甲壳的来\n源");
	pchar PokedexDes777[] = _("背上的14根针毛在受惊或是兴奋\n的时候会随意竖起来");
	pchar PokedexDes778[] = _("站在镜子前 拼命竖直折了的脖子\n因为怎么都竖不直而在身体里哭\n泣");
	pchar PokedexDes779[] = _("潜藏在沙子里 从头部的突起物里\n放射出精神力量 会边探查周围的\n情形边等待猎物");
	pchar PokedexDes780[] = _("如果和自己成为朋友的孩子被欺负\n就会找到欺负他的那个孩子家\n然后用火燃烧殆尽");
	pchar PokedexDes781[] = _("缠绕着绿色的海藻 抢夺并吸取生\n命气息 光喜欢吃吼鲸王那样的大\n型生物 会攻击它们");
	pchar PokedexDes782[] = _("用头部的鳞片砰砰砰地敲响岩石和\n地面 威吓对手 也会用声音和伙\n伴联络");
	pchar PokedexDes783[] = _("让鳞片互相敲击 发出声响 在节\n奏达到最高潮的时候发动袭击");
	pchar PokedexDes784[] = _("一招制住猎物 发出长嚎后 伙伴\n们祝福的金属音会从各个地方回荡\n起来");
	pchar PokedexDes785[] = _("被称为守护神 但也会袭击破坏自\n己心情的人类和宝可梦 是性情凶\n悍的神");
	pchar PokedexDes786[] = _("会到处撒着闪闪发光的鳞粉 治愈\n人类和宝可梦的伤 是阿卡拉所供\n奉的守护神");
	pchar PokedexDes787[] = _("被称为守护神 但拥有将视为敌人\n者彻底击溃的强悍");
	pchar PokedexDes788[] = _("栖息在浓雾深处而被人们敬畏着\n是操纵着水的波尼的守护神");
	pchar PokedexDes789[] = _("那不可靠的气体状身体只要稍微有\n点风就会被吹走 但却总是完全不\n在意的样子");
	pchar PokedexDes790[] = _("太古时代支配着阿罗拉的国王 称\n之为星之茧 因为崇拜它而建造了\n祭坛");
	pchar PokedexDes791[] = _("打开了究极之洞的结果是 把异世\n界的能量和生命召唤到这个世界的\n事也时有发生");
	pchar PokedexDes792[] = _("在遥远过去的文献里 以邀引月亮\n之兽为名留下了记录");
	pchar PokedexDes793[] = _("是被称为究极异兽的其他世界的生\n命体 被认为拥有强力的神经毒素");
	pchar PokedexDes794[] = _("在这个世界是异类 很危险 但在\n它原本栖息的世界 好像只是寻常\n能见的生物");
	pchar PokedexDes795[] = _("栖息在其他世界的生命体 身体纤\n细柔软 但是看起来蕴藏着强大的\n力量");
	pchar PokedexDes796[] = _("在这个世界是异类 很危险 但在\n它原本栖息的世界 好像只是寻常\n能见的生物");
	pchar PokedexDes797[] = _("是危险的究极异兽中的一种 从它\n巨大的双臂中检测出来很高的能量\n反应");
	pchar PokedexDes798[] = _("从纸一样薄的身体上能感觉到像磨\n过的刀刃一般的锋利度 是一种究\n极异兽");
	pchar PokedexDes799[] = _("在这个世界是异类 很危险 但在\n它原本栖息的世界 好像只是寻常\n能见的生物");
	pchar PokedexDes800[] = _("为了寻找作为能量的光而发狂的样\n子看上去有些痛苦 好像存在于其\n他世界");
	pchar PokedexDes801[] = _("能够让意识同步 理解对方的心情\n用来照料人的话是很方便的能力");
	pchar PokedexDes802[] = _("能潜入对方的影子 模仿对方的动\n作和力量 在模仿的过程中会变得\n比本尊更强");
	pchar PokedexDes803[] = _("在异世界是亲切的究极异兽 甚至\n能被选为踏上旅程的同伴");
	pchar PokedexDes804[] = _("体内储存着几百升的毒液 是被称\n为究极异兽的生物中的一种");
	pchar PokedexDes805[] = _("从究极之洞里出现 好像是复数的\n生命累积起来 形成了1只");
	pchar PokedexDes806[] = _("扭啊扭地移动着 靠近人后会突然\n让头爆炸 好像是究极异兽中的一\n种");
	pchar PokedexDes807[] = _("让双手双脚的爪子带电 将对手撕\n得稀碎 即使被躲开 也会用飞散\n的电击让其触电");
#elif (LANGUAGE == ENGLISH)
	pchar PokedexUnknown[] = _("This Pokémon is currently unknown.");
	pchar PokedexDes1[] = _("A strange seed was planted on\nits back at birth. The plant\nsprouts and grows with this Pokémon.");
	pchar PokedexDes2[] = _("There is a plant bulb on its back.\nWhen it absorbs nutrients, the bulb is\nsaid to blossom into a large flower.");
	pchar PokedexDes3[] = _("By spreading the broad petals of its\nflower and catching the sun’s rays, it\nfills its body with power.");
	pchar PokedexDes4[] = _("The flame on its tail indicates\nCharmander’s life force. If it is healthy,\nthe flame burns brightly.");
	pchar PokedexDes5[] = _("It lashes about with its tail to\nknock down its foe. It then tears\nup the fallen opponent with sharp claws.");
	pchar PokedexDes6[] = _("When expelling a blast of superhot fire,\nthe red flame at the tip of its tail\n burns more intensely.");
	pchar PokedexDes7[] = _("It shelters itself in its shell,\nthen strikes back with spouts of\nwater at every opportunity.");
	pchar PokedexDes8[] = _("When tapped, this Pokémon will pull\nin its head, but its tail will still\nstick out a little bit.");
	pchar PokedexDes9[] = _("It crushes its foe under its heavy body\nto cause fainting. In a pinch, it will\nwithdraw inside its shell.");
	pchar PokedexDes10[] = _("Perhaps because it would like to grow\nup quickly, it has a voracious appetite,\neating a hundred leaves a day.");
	pchar PokedexDes11[] = _("Its hard shell doesn’t crack a bit even\nif Pikipek pecks at it, but it will\ntip over, spilling out its insides.");
	pchar PokedexDes12[] = _("Nectar from pretty flowers is its favorite\nfood. In fields of flowers, it has heated\nbattles with Cutiefly for territory.");
	pchar PokedexDes13[] = _("Often found in forests and grasslands.\nIt has a sharp, toxic barb of around\ntwo inches on top of its head.");
	pchar PokedexDes14[] = _("Almost incapable of moving, this Pokémon\ncan only harden its shell to protect\nitself when it is in danger.");
	pchar PokedexDes15[] = _("It has three poisonous stingers on its\nforelegs and its tail. They are used\nto jab its enemy repeatedly.");
	pchar PokedexDes16[] = _("A common sight in forests and woods.\nIt flaps its wings at ground level\nto kick up blinding sand.");
	pchar PokedexDes17[] = _("The claws on its feet are well developed.\nIt can carry prey such as an Exeggcute\nto its nest over 60 miles away.");
	pchar PokedexDes18[] = _("When hunting, it skims the surface of\nwater at high speed to pick off\nunwary prey such as Magikarp.");
	pchar PokedexDes19[] = _("This Pokémon is common but hazardous.\nIts sharp incisors can easily cut\nright through hard wood.");
	pchar PokedexDes20[] = _("People say that it fled from its enemies\nby using its small webbed hind feet to\nswim from island to island in Alola.");
	pchar PokedexDes21[] = _("Its reckless nature leads it to stand up\nto others even large Pokémon if\nit has to protect its territory.");
	pchar PokedexDes22[] = _("Carrying food through Fearow’s territory\nis dangerous. It will snatch the food\naway from you in a flash!");
	pchar PokedexDes23[] = _("By dislocating its jaw, it can swallow\nprey larger than itself. After a meal,\nit curls up and rests.");
	pchar PokedexDes24[] = _("The latest research has determined that\nthere are over 20 possible arrangements\nof the patterns on its stomach.");
	pchar PokedexDes25[] = _("A plan was recently announced\nto gather many Pikachu and\nmake an electric power plant.");
	pchar PokedexDes26[] = _("Because so many Trainers like the\nway Pikachu looks, you don’t see\nthis Pokémon very often.");
	pchar PokedexDes27[] = _("It lives in areas of limited rainfall.\nWhen danger approaches, it curls up into\na ball to protect its soft stomach.");
	pchar PokedexDes28[] = _("Its claws and horns often break off. The\nbroken claws and horns can be used to\ncarve plows for tilling farm fields.");
	pchar PokedexDes29[] = _("Although small, its venomous barbs render\nthis Pokémon dangerous. The female has\nsmaller horns.");
	pchar PokedexDes30[] = _("The female has a gentle temperament. It\nemits ultrasonic cries that have the power\nto befuddle foes.");
	pchar PokedexDes31[] = _("It uses its scaly, rugged body to\nseal the entrance of its nest and\nprotect its young from predators.");
	pchar PokedexDes32[] = _("It scans its surroundings by raising\nits ears out of the grass.\nIts toxic horn is for protection.");
	pchar PokedexDes33[] = _("It raises its big ears to\ncheck its surroundings. If it senses\nanything, it attacks immediately.");
	pchar PokedexDes34[] = _("It is recognized by its rock-hard hide\nand its extended horn. Be careful with\nthe horn, as it contains venom.");
	pchar PokedexDes35[] = _("They’re popular, but they’re rare.\nTrainers who show them off recklessly\nmay be targeted by thieves.");
	pchar PokedexDes36[] = _("Some scientists believe that it gazes\nintently at the sky on nights with a\nfull moon because it’s homesick.");
	pchar PokedexDes37[] = _("Its beautiful fur and tails have made it\nvery popular. As it grows, its tails split\nto form more tails.");
	pchar PokedexDes38[] = _("Legend has it that this\nmystical Pokémon was formed when\nnine saints coalesced into one.");
	pchar PokedexDes39[] = _("The songs they sing are totally different\ndependingon the region they live in.\nSome even sound like they’re shouting!");
	pchar PokedexDes40[] = _("Thanks to its bouncy body and fine fur,\nthis Pokémon is sought after. Holding one\nin your arms while sleep feels great.");
	pchar PokedexDes41[] = _("It has no eyeballs, so it can’t\nsee. It checks its surroundings via the\nultrasonic waves it emits from its mouth.");
	pchar PokedexDes42[] = _("Its thick fangs are hollow like straws,\nmaking them unexpectedly fragile. These\nfangs are specialized for sucking blood.");
	pchar PokedexDes43[] = _("During the day, it stays in the\ncold underground to avoid the sun.\nIt grows by bathing in moonlight.");
	pchar PokedexDes44[] = _("Smells incredibly foul! However,\naround one out of a thousand people\nenjoy sniffing its nose-bending stink.");
	pchar PokedexDes45[] = _("The larger its petals, the more toxic\npollen it contains. Its big head is heavy\nand hard to hold up.");
	pchar PokedexDes46[] = _("Whether it’s due to a lack of moisture or\na lack of nutrients, in Alola mushrooms\non Paras don’t grow up quite right.");
	pchar PokedexDes47[] = _("The large mushroom on its\nback controls it. It often\nfights over territory with Shiinotic.");
	pchar PokedexDes48[] = _("Its big eyes are actually clusters of\ntiny eyes. At night, its kind is\ndrawn by light.");
	pchar PokedexDes49[] = _("The scales it scatters will paralyze\nanyone who touches them, making that\nperson unable to stand.");
	pchar PokedexDes50[] = _("It travels through tunnels that it digs\nunderground. It hates sunlight, so it\ncomes out only after the sun goes down.");
	pchar PokedexDes51[] = _("Dugtrio’s heads are sleek and smooth\nand incredibly hard. It can dig\nthrough any soil with its headbutts.");
	pchar PokedexDes52[] = _("When visiting a junkyard, you may catch\nsight of it having an intense fight\nwith Murkrow over shiny objects.");
	pchar PokedexDes53[] = _("This Pokémon is popular with rich people.\nIt’s also targeted by hunters who are\nafter the jewel in its forehead.");
	pchar PokedexDes54[] = _("Using psychokinesis gives it a headache,\nso it normally passes the time spacing out\nand doing as little as possible.");
	pchar PokedexDes55[] = _("Even fast-swimming fish Pokémon can be\ndisabled by Golduck. It brings them\nto a standstill and seizes them.");
	pchar PokedexDes56[] = _("If one gets angry, all the others around\nit will get angry, so silence is a rare\nvisitor in a troop of Mankey.");
	pchar PokedexDes57[] = _("It has been known to become so angry\nthat it dies as a result. Its face\nlooks peaceful in death, however.");
	pchar PokedexDes58[] = _("It has lived alongside humans since ages\nago. Its bones have been found in\nexcavations of ruins from the Stone Age.");
	pchar PokedexDes59[] = _("Legends tell of its fighting\nalongside a general and conquering\na whole country.");
	pchar PokedexDes60[] = _("It’s still not very good at walking.\nIts Trainers should train this Pokémon to\nwalk every day.");
	pchar PokedexDes61[] = _("Its health suffers when its\nskin dries out, so be\nsure to moisturize it diligently.");
	pchar PokedexDes62[] = _("It’s quite a gifted swimmer, even among\nWater-type Pokémon, but it normally\nspends its time on land.");
	pchar PokedexDes63[] = _("It uses various psychic powers even\nwhile it’s sleeping, so you can’t\ntell whether or not it’s awake.");
	pchar PokedexDes64[] = _("It stares at a silver spoon to amplify\n its psychic powers before it lets loose.\nApparently, gold spoons are no good.");
	pchar PokedexDes65[] = _("It is said to have an IQ of approximately\n5000. Its overflowing psychokinetic\npowers cause headaches to anyone nearby.");
	pchar PokedexDes66[] = _("It likes food that’s highly\nnutritious because its instincts drive\nit to build muscle efficiently.");
	pchar PokedexDes67[] = _("A popular motif for sculptures, its\nincredibly well-shaped muscles have\ncaptured the imagination of many artists.");
	pchar PokedexDes68[] = _("It grasps its opponents with its four arms\nand twists them up in an intricate hold.\nPeople call it the Machamp special.");
	pchar PokedexDes69[] = _("Even though its body is\nextremely skinny, it is blindingly\nfast when catching its prey.");
	pchar PokedexDes70[] = _("The leafy parts act as cutters\nfor slashing foes. It spits a\nfluid that dissolves everything.");
	pchar PokedexDes71[] = _("Said to live in huge colonies deep\nin jungles, although no one has ever\nreturned from there.");
	pchar PokedexDes72[] = _("Its body is 0.99 water.\nThe remaining 0.01 contains the\norgan that makes its poison.");
	pchar PokedexDes73[] = _("It fires off ultrasonic waves from its\nred orbs to weaken its prey, and then it\nwraps them up in its 80 tentacles.");
	pchar PokedexDes74[] = _("It uses both hands to climb precipitous\ncliffs. People who see it in action\nhave been known to take up bouldering.");
	pchar PokedexDes75[] = _("It travels by rolling down cliffs. If\nit falls into a river, it will\nexplode with its last gasp.");
	pchar PokedexDes76[] = _("When Golem grow old, they stop shedding\ntheir shells. Those that have lived a\nlong time have shells green with moss.");
	pchar PokedexDes77[] = _("As a newborn, it can barely stand.\nHowever, through galloping, its legs are\nmade tougher and faster.");
	pchar PokedexDes78[] = _("Very competitive, this Pokémon will chase\nanything that moves fast in the\nhopes of racing it.");
	pchar PokedexDes79[] = _("There are some places where Slowpoke is\nworshiped because of an old belief that\nwhenever Slowpoke yawns, it rains.");
	pchar PokedexDes80[] = _("Spacing out is basically all it does. It\nturns back into Slowpoke if its tail, along\nwith Shellder, breaks off.");
	pchar PokedexDes81[] = _("It’s frequently the cause of power outages,\nwhich is why some power plants send\nout electrical signals that it can’t stand.");
	pchar PokedexDes82[] = _("Delicate equipment can malfunction in\nareas inhabited by Magneton, which\nsend out mysterious electrical signals.");
	pchar PokedexDes83[] = _("The plant stalk it holds is its\nweapon. The stalk is used like a\nsword to cut all sorts of things.");
	pchar PokedexDes84[] = _("A two-headed Pokémon that was discovered\n as a sudden mutation. It runs at a\npace of over 60 miles per hour.");
	pchar PokedexDes85[] = _("An enemy that takes its eyes\noff any of the three heads even\nfor a second will get pecked severely.");
	pchar PokedexDes86[] = _("It has always been supposed that Seel\nlive only in cold seas. Their having\nshown up in Alola is a mystery.");
	pchar PokedexDes87[] = _("It sunbathes on the beach after\nmeals. The rise in its body\ntemperature helps its digestion.");
	pchar PokedexDes88[] = _("It was born from sludge on the sea floor.\nIn a sterile environment, the germs within\nits body can’t multiply and it dies.");
	pchar PokedexDes89[] = _("The stench it gives off will make your\nnose scrunch up. Still, there are Muk fans\nwho think that’s a good thing.");
	pchar PokedexDes90[] = _("The hardness of its shell surpasses the\nhardness of a diamond. In days gone by,\npeople used the shells to make shields.");
	pchar PokedexDes91[] = _("If areas of Cloyster’s very hard\nshell get damaged, those areas swell,\ngradually growing into large sharp spikes.");
	pchar PokedexDes92[] = _("It’s said that gas emanating from a grave-\nyard was possessed by the grievances\nof the deceased and thus became a Pokémon.");
	pchar PokedexDes93[] = _("On moonless nights, Haunter searches for\nsomeone to curse, so it’s best\nnot to go out walking around.");
	pchar PokedexDes94[] = _("You can hear tales told all over\nthe world about how Gengar will pay\na visit to children who are naughty.");
	pchar PokedexDes95[] = _("Burrows at high speed in search\nof food. The tunnels it leaves\nare used as homes by Diglett.");
	pchar PokedexDes96[] = _("A Pokémon that nourishes itself by eating\ndreams, it is thought to share common\nancestry with Munna and Musharna.");
	pchar PokedexDes97[] = _("In Alola, Komala is Hypno’s\nmain target. It rarely harms\npeople.");
	pchar PokedexDes98[] = _("If it senses danger approaching, it\ncloaks itself with bubbles from its\nmouth so it will look bigger.");
	pchar PokedexDes99[] = _("Its large and hard pincer has 10,000\nhorsepower strength. However,\nbeing so big, it is unwieldy to move.");
	pchar PokedexDes100[] = _("It was discovered when PokéBalls\nwere introduced. It is said that\nthere is some connection.");
	pchar PokedexDes101[] = _("It explodes in response to even\nminor stimuli. It is feared, with\nthe nickname of The Bomb Ball.");
	pchar PokedexDes102[] = _("Six of them form a single Pokémon. Should\none of the six be lost, the next morning\nthere will once more be six.");
	pchar PokedexDes103[] = _("It engages its enemies using psychic powers\nEach of its three heads fires off\npsychokinetic energy, tripling its power.");
	pchar PokedexDes104[] = _("At night, it weeps loudly for its\ndead mother, but those cries only attract\nits natural enemy Mandibuzz.");
	pchar PokedexDes105[] = _("It throws bones at Mandibuzz to knock\nit down. It’s thought that Marowak is\ntrying to avenge its parent.");
	pchar PokedexDes106[] = _("The legs freely contract and stretch.\nThe stretchy legs allow it to hit\na distant foe with a rising kick.");
	pchar PokedexDes107[] = _("The arm-twisting punches it throws\npulverize even concrete. It rests\nafter three minutes of fighting.");
	pchar PokedexDes108[] = _("Its long tongue, slathered with a\ngooey saliva, sticks to anything, so\nit is very useful.");
	pchar PokedexDes109[] = _("Its thin, balloon-like body is inflated\nby horribly toxic gases. It reeks\nwhen it is nearby.");
	pchar PokedexDes110[] = _("If one of the twin Koffing inflates,\nthe other one deflates. It constantly\nmixes its poisonous gases.");
	pchar PokedexDes111[] = _("Strong, but not too bright, this\nPokémon can shatter even a skyscraper\nwith its charging Tackles.");
	pchar PokedexDes112[] = _("Protected by an armor-like hide, it is\ncapable of living in molten lava of\n3600 degrees Fahrenheit.");
	pchar PokedexDes113[] = _("Because the eggs on their bellies have\nbeen overharvested by people in the past,\nits population remains very small.");
	pchar PokedexDes114[] = _("Many writhing vines cover it, so its\nTRUE identity remains unknown.\nThe blue vines grow its whole life long.");
	pchar PokedexDes115[] = _("Kangaskhan’s maternal love is so\ndeep that it will brave\ndeath to protect its offspring.");
	pchar PokedexDes116[] = _("Known to shoot down flying bugs with\nprecision blasts of ink from the surface\nof the water.");
	pchar PokedexDes117[] = _("Its body bristles with sharp spikes.\nCarelessly trying to touch it could cause\nfainting from the spikes.");
	pchar PokedexDes118[] = _("The way it swims along fluttering\nits dress-like fins has earned it\nthe name princess of the water.");
	pchar PokedexDes119[] = _("Its horn spins like a drill to steadily\nhollow out rocks even harder ones.\nThe coloration of the male is more vivid.");
	pchar PokedexDes120[] = _("In many places, there are\nfolktales of stardust falling into\nthe ocean and becoming Staryu.");
	pchar PokedexDes121[] = _("It rotates its geometrically shaped body\nto swim in the water. It always seems\nto be sending out mysterious radio waves.");
	pchar PokedexDes122[] = _("It creates invisible walls with its\npantomiming. If you don’t act impressed, it will\nattack you with a double slap!");
	pchar PokedexDes123[] = _("Its two sharp scythes are more than just\nweapons. It uses them with dexterity to\ndress its prey before eating.");
	pchar PokedexDes124[] = _("It sways its hips to a rhythm\nall its own. The precise movements of\nJynx living in Alola are truly wonderful.");
	pchar PokedexDes125[] = _("Electricity permeates its body. It swings\nits arms round and round to charge up\nelectricity before unleashing a punch.");
	pchar PokedexDes126[] = _("Its entire body is burning. When it\nbreathes, the temperature rises.\nWhen it sneezes, flames shoot out!");
	pchar PokedexDes127[] = _("It gets into territorial disputes with\nVikavolt. For some reason, it apparently\ngets along well with Heracross in Alola.");
	pchar PokedexDes128[] = _("They live in groups. The one with the\n longest, thickest, and most-scarred horns\n is the boss of the herd.");
	pchar PokedexDes129[] = _("In the distant past, they were\nfairly strong, but they have become\ngradually weaker over time.");
	pchar PokedexDes130[] = _("The energy from evolution stimulated\nits brain cells strongly, causing\nit to become very ferocious.");
	pchar PokedexDes131[] = _("Its high intelligence enables it to\ncomprehend human speech. When it’s in a\ngood mood, it sings in its beautiful voice.");
	pchar PokedexDes132[] = _("While it can transform into anything, it\napparently has its own strengths and\nweaknesses when it comes to transformations.");
	pchar PokedexDes133[] = _("The question of why only\nEevee has such unstable genes\nhas still not been solved.");
	pchar PokedexDes134[] = _("It detects nearby moisture with its fin.\nWhen its fin begins trembling rapidly,\nthat means rain will fall in a few hours.");
	pchar PokedexDes135[] = _("Its lungs contain an organ that creates\nelectricity. The crackling sound of\nelectricity can be heard when it exhales.");
	pchar PokedexDes136[] = _("If it inhales deeply, that’s a sign it’s\nabout to attack. Prepare to be hit by\nflames of over 3000 degrees Fahrenheit!");
	pchar PokedexDes137[] = _("This Pokémon was created using the cutting-\nedge science of 20 years ago, so many\nparts of it have since become obsolete.");
	pchar PokedexDes138[] = _("It was restored from an ancient fossil.\nThose Helix Fossils are excavated\nfrom areas that were once oceans long ago.");
	pchar PokedexDes139[] = _("Its heavy shell is thought to be the\nreason this ancient Pokémon died out.\nIt’s a distant ancestor of Octillery.");
	pchar PokedexDes140[] = _("This Pokémon became extinct everywhere,\nexcept in a few areas. It protects\nitself with its hard shell.");
	pchar PokedexDes141[] = _("Its body had begun to change so\nit could function on land. But it\ndidn’t adapt in time and went extinct.");
	pchar PokedexDes142[] = _("Restored from DNA found in amber, this\nPokémon showed much greater ferocity\nthan expected. Some casualties resulted.");
	pchar PokedexDes143[] = _("Its stomach is said to be incomparably\nstrong. Even Muk’s poison is nothing more\nthan a hint of spice on Snorlax’s tongue.");
	pchar PokedexDes144[] = _("A legendary bird Pokémon. It can\ncreate blizzards by freezing moisture in\nthe air.");
	pchar PokedexDes145[] = _("A legendary bird Pokémon that is\nsaid to appear from clouds while\ndropping enormous lightning bolts.");
	pchar PokedexDes146[] = _("It is said to be the legendary bird\nPokémon of fire. Every flap of its wings\ncreates a dazzling flare of flames.");
	pchar PokedexDes147[] = _("It’s still weak, so it lurks on the floor\nof bodies of water, eats whatever\nfood sinks down and lives a quiet life.");
	pchar PokedexDes148[] = _("It has long been thought that\nits crystalline orbs are imbued with\nthe power to control the weather.");
	pchar PokedexDes149[] = _("You’ll often hear tales of\nthis kindhearted Pokémon rescuing people\nor Pokémon that are drowning.");
	pchar PokedexDes150[] = _("It was created by a scientist\nafter years of horrific gene-splicing and\nDNA-engineering experiments.");
	pchar PokedexDes151[] = _("Because it can use all kinds\nof moves, many scientists believe Mew\nto be the ancestor of Pokémon.");
	pchar PokedexDes152[] = _("A sweet aroma gently wafts from the\nleaf on its head. It is docile\nand loves to soak up sun rays.");
	pchar PokedexDes153[] = _("A spicy aroma emanates from around its\nneck. The aroma acts as a stimulant\nto restore health.");
	pchar PokedexDes154[] = _("The aroma that rises from its\npetals contains a substance that calms\naggressive feelings.");
	pchar PokedexDes155[] = _("It is timid and always curls itself up\nin a ball. If attacked, it flares up\nits back for protection.");
	pchar PokedexDes156[] = _("Before battle, it turns its back\non its opponent to demonstrate how\nferociously its fire blazes.");
	pchar PokedexDes157[] = _("If its rage peaks, it becomes so\nhot that anything that touches it will\ninstantly go up in flames.");
	pchar PokedexDes158[] = _("It is small but rough and tough.\nIt won’t hesitate to take a bite\nout of anything that moves.");
	pchar PokedexDes159[] = _("If it loses a fang, a new\none grows back in its place. There\nare always 48 fangs lining its mouth.");
	pchar PokedexDes160[] = _("It usually moves slowly, but it\ngoes at blinding speed when it\nattacks and bites prey.");
	pchar PokedexDes161[] = _("When acting as a lookout, it warns\nothers of danger by screeching and\nhitting the ground with its tail.");
	pchar PokedexDes162[] = _("The mother puts its offspring to sleep\nby curling up around them. It corners\nfoes with speed.");
	pchar PokedexDes163[] = _("Every day, it tilts its head in the\nsame rhythm. A long time ago, people\nraised these Pokémon to serve as clocks.");
	pchar PokedexDes164[] = _("With eyes that can see in pitch-darkness,\nit never lets its prey escape. Some even\ncall it the emperor of dark nights.");
	pchar PokedexDes165[] = _("This Pokémon is very sensitive to\ncold. In the warmth of Alola,\nit appears quite lively.");
	pchar PokedexDes166[] = _("It’s said that the patterns on its back\nare related to the stars in the night\nsky, but the details remain unclear.");
	pchar PokedexDes167[] = _("With threads from its mouth, it fashions\nsturdy webs that won’t break even if you\nset a rock on them.");
	pchar PokedexDes168[] = _("It spews threads from its mouth to\ncatch its prey. When night falls, it\nleaves its web to go hunt aggressively.");
	pchar PokedexDes169[] = _("Both its legs became wings, and as a\nresult, it can’t move well on the ground.\nAll it can do is crawl around.");
	pchar PokedexDes170[] = _("Its two antennae glow softly to lure\nin prey, making it a useful Pokémon\nfor night fishing.");
	pchar PokedexDes171[] = _("When the bacteria living inside its\nantennae absorb Lanturn’s bodily fluids,\na strong luminescent effect is produced.");
	pchar PokedexDes172[] = _("It still can’t use electricity well.\nWhen it’s surprised or excited,\nit discharges electricity unintentionally.");
	pchar PokedexDes173[] = _("Said to have ridden here on a shooting\nstar, Cleffa seem to appear in places\nwhere meteorites have struck in the past.");
	pchar PokedexDes174[] = _("It’s always practicing singing because it\nwants to improve. Even when it’s asleep,\nit keeps singing in its dreams!");
	pchar PokedexDes175[] = _("The shell seems to be filled with joy.\nIt is said that it will share good\nluck when treated kindly.");
	pchar PokedexDes176[] = _("It grows dispirited if it is not\nwith kind people. It can float in\nmidair without moving its wings.");
	pchar PokedexDes177[] = _("The look in its eyes gives the impression\nthat it’s carefully observing you.\nIf you approach it, Natu will hop away.");
	pchar PokedexDes178[] = _("While it can see the future, it has no\ndesire to change it, which is probably\nwhy it remains motionless at all times.");
	pchar PokedexDes179[] = _("Clothing made from Mareep’s fleece is\neasily charged with static electricity,\nso a special process is used on it.");
	pchar PokedexDes180[] = _("It stores electricity in its fluffy fleece.\nIf it stores up too much, it will start\nto go bald in those patches.");
	pchar PokedexDes181[] = _("Its tail shines bright and strong.\nIt has been prized since long\nago as a beacon for sailors.");
	pchar PokedexDes182[] = _("Bellossom gather at times and seem to\ndance. They say that the dance is a ritual\nto summon the sun.");
	pchar PokedexDes183[] = _("The fur on its body naturally repels\nwater. It can stay dry, even when\nit plays in the water.");
	pchar PokedexDes184[] = _("Its long ears are superb sensors.\nIt can distinguish the movements of\nliving things on riverbeds.");
	pchar PokedexDes185[] = _("The result of its holding the same\npose all the time is arms that\nhave become supple yet strong.");
	pchar PokedexDes186[] = _("Although its cries sound like screams,\na composer created a beautiful ballad\nthat was influenced by the sounds.");
	pchar PokedexDes187[] = _("Its body is so light, it must grip\nthe ground firmly with its feet to keep\nfrom being blown away.");
	pchar PokedexDes188[] = _("The bloom on top of its head opens and\ncloses as the temperature fluctuates\nup and down.");
	pchar PokedexDes189[] = _("Blown by seasonal winds, it circles\nthe globe, scattering cotton spores as\nit goes.");
	pchar PokedexDes190[] = _("As it did more and more with\nits tail, its hands became clumsy. It\nmakes its nest high in the treetops.");
	pchar PokedexDes191[] = _("It may plummet from the sky. If\nattacked by a Spearow, it will violently\nshake its leaves.");
	pchar PokedexDes192[] = _("As the hot season approaches, the\npetals on this Pokémon’s face become\nmore vivid and lively.");
	pchar PokedexDes193[] = _("Its eyes can see 360 degrees without\nmoving its head. It won’t miss prey--even\nthose behind it.");
	pchar PokedexDes194[] = _("This Pokémon lives in cold water. It will\nleave the water to search for food when\nit gets cold outside.");
	pchar PokedexDes195[] = _("It has a sluggish nature. It lies\nat the river’s bottom, waiting for prey\nto stray into its mouth.");
	pchar PokedexDes196[] = _("Psychic power builds up in the orb on\nits forehead as it bathes in the sunshine.\nEspeon is not good at battling at night.");
	pchar PokedexDes197[] = _("This Pokémon is nocturnal. Even in\ntotal darkness, its large eyes can\nspot its prey clearly!");
	pchar PokedexDes198[] = _("It searches for shiny things for its boss.\nMurkrow’s presence is said to be unlucky,\nso many people detest it.");
	pchar PokedexDes199[] = _("It’s called the sage of the sea.\nIt engages in battles of wits with Oranguru,\nbut the result is usually a draw.");
	pchar PokedexDes200[] = _("If you hear a sobbing sound emanating\nfrom a vacant room, it’s undoubtedly a\nbit of mischief from Misdreavus.");
	pchar PokedexDes201[] = _("Its flat, thin body is always\nstuck on walls. Its shape appears\nto have some meaning.");
	pchar PokedexDes202[] = _("It hates light and shock. If\nattacked, it inflates its body to\nbuild up its counterstrike.");
	pchar PokedexDes203[] = _("While it sleeps, the head on\nits tail keeps watch. The tail\ndoesn’t need to sleep.");
	pchar PokedexDes204[] = _("Motionless, it hangs from trees, waiting for\nits bug Pokémon prey to come to\nit. Its favorite in Alola is Cutiefly.");
	pchar PokedexDes205[] = _("It is encased in a steel shell. Its\npeering eyes are all that can be seen\nof its mysterious innards.");
	pchar PokedexDes206[] = _("It travels by digging through\nthe ground. Diglett and Dunsparce\nshare one another’s tunnels happily.");
	pchar PokedexDes207[] = _("It usually clings to cliffs. When it\nspots its prey, it spreads its wings\nand glides down to attack.");
	pchar PokedexDes208[] = _("Tempered underground under high\npressure and heat, its body is\nharder than any metal.");
	pchar PokedexDes209[] = _("In contrast to its appearance, it’s\nquite timid. When playing with other\npuppy Pokémon, it sometimes gets bullied.");
	pchar PokedexDes210[] = _("While it has powerful jaws, it doesn’t care\nfor disputes, so it rarely has a chance\nto display their might.");
	pchar PokedexDes211[] = _("To fire its poison spikes, it must inflate\nits body by drinking over 2.6 gallons of\nwater all at once.");
	pchar PokedexDes212[] = _("Its body is like steel. Its\ntough, heavy pincers are more suited\nto smashing enemies than grabbing them.");
	pchar PokedexDes213[] = _("The berries stored in its\njar-like shell eventually become a\nthick, pulpy juice.");
	pchar PokedexDes214[] = _("It’s proud of its thick horn.\nIn Alola, its biggest rival is\nVikavolt, which it’s always fighting with.");
	pchar PokedexDes215[] = _("It has a cunning yet savage disposition.\nIt waits for parents to leave their nests,\nthen sneaks in to steal their eggs.");
	pchar PokedexDes216[] = _("If it finds honey, its crescent\nmark glows. It always licks its\npaws because they’re soaked with honey.");
	pchar PokedexDes217[] = _("With its ability to distinguish\nany aroma, it unfailingly finds\nall food buried deep underground.");
	pchar PokedexDes218[] = _("A common sight in volcanic areas, it\nslowly slithers around in a constant\nsearch for warm places.");
	pchar PokedexDes219[] = _("Its brittle shell occasionally\nspouts intense flames that\ncirculate throughout its body.");
	pchar PokedexDes220[] = _("It rubs its snout on the ground to\n find and dig up food.\n It sometimes discovers hot springs.");
	pchar PokedexDes221[] = _("Although its legs are short, its\nrugged hooves prevent it from slipping,\neven on icy ground.");
	pchar PokedexDes222[] = _("The pink of Corsola that live\nin Alola is deep and vibrant,\nthanks to seas filled with nutrition.");
	pchar PokedexDes223[] = _("Also known as the sniper of the seas,\nits water gun can hit prey without fail\nfrom over 300 feet away.");
	pchar PokedexDes224[] = _("It usually sleeps in caves. The\npitch-black ink that Octillery spits is\nalso used for cooking.");
	pchar PokedexDes225[] = _("It wraps food in its tail to carry\nit around. The Delibird with the biggest\ntail is the boss of the flock!");
	pchar PokedexDes226[] = _("Postcards and posters featuring Mantine\nleaping elegantly above the waves\nare popular souvenirs of Alola.");
	pchar PokedexDes227[] = _("The wing feathers it sheds can be\nprocessed and made into knives whose\nsharpness is recognized by finest chefs.");
	pchar PokedexDes228[] = _("They make repeated eerie howls\nbefore dawn to call attention\nto their pack.");
	pchar PokedexDes229[] = _("Identifiable by its eerie howls, people a\nlong time ago thought it was the\ngrim reaper and feared it.");
	pchar PokedexDes230[] = _("It is said that it usually\nhides in underwater caves. It can\ncreate whirlpools by yawning.");
	pchar PokedexDes231[] = _("As a sign of affection, it bumps with\nits snout. However, it is so strong, it\nmay send you flying.");
	pchar PokedexDes232[] = _("It has sharp, hard tusks and a\nrugged hide. Its Tackle is strong enough\nto knock down a house.");
	pchar PokedexDes233[] = _("AI has been installed in it. It learns\nvarious things all on its own, but it even\nremembers things it doesn’t need to know.");
	pchar PokedexDes234[] = _("Staring at its antlers creates an odd\nsensation as if one were being drawn\ninto their centers.");
	pchar PokedexDes235[] = _("The fluid of Smeargle’s tail secretions\nchanges in the intensity of its\nhue as the Pokémon’s emotions change.");
	pchar PokedexDes236[] = _("It is always bursting with energy.\nTo make itself stronger, it keeps\non fighting even if it loses.");
	pchar PokedexDes237[] = _("It fights while spinning like a\ntop. The centrifugal force boosts its\ndestructive power by 10");
	pchar PokedexDes238[] = _("Highly perceptive sensors, Smoochum’s\nlips are kept moist by its daily\n application of tree sap.");
	pchar PokedexDes239[] = _("When its horns shine a bluish white, that’s\nthe sign it’s fully charged. You’ll get a\nshocking jolt if you touch it!");
	pchar PokedexDes240[] = _("When flames drip from its nose, that\nmeans it has a cold. Have it lie down\nfor a nice rest in some magma.");
	pchar PokedexDes241[] = _("Most people raise it for its milk, but\nit’s quite tough and strong, so it’s also\nwell suited for battle.");
	pchar PokedexDes242[] = _("This Pokémon is overflowing with love. Only\nChansey that share a strong bond with\ntheir Trainer can evolve, so people say.");
	pchar PokedexDes243[] = _("The rain clouds it carries let\nit fire thunderbolts at will. They\nsay that it descended with lightning.");
	pchar PokedexDes244[] = _("A Pokémon that races across the land. It\nis said that one is born every time\na new volcano appears.");
	pchar PokedexDes245[] = _("It races around the world to\npurify fouled water. It dashes away\nwith the north wind.");
	pchar PokedexDes246[] = _("Raised on nutrients it finds in the\ndirt, it eats roughly a mountain’s worth\nof dirt before it becomes a pupa.");
	pchar PokedexDes247[] = _("This dangerous pupa thrashes about.\nIts shell is as hard as bedrock, containing\nits gradually forming new body within.");
	pchar PokedexDes248[] = _("This Pokémon is a mobile\ndisaster, leaving mountains crumbled and\nhouses destroyed in its wake.");
	pchar PokedexDes249[] = _("It sleeps in a deep-sea trench. If\nit flaps its wings, it is said\nto cause a 40-day storm.");
	pchar PokedexDes250[] = _("A legend says that its body glows\nin seven colors. A rainbow is said\nto form behind it when it flies.");
	pchar PokedexDes251[] = _("This Pokémon wanders across time.\nGrass and trees flourish in the forests\nin which it has appeared.");
	pchar PokedexDes252[] = _("It quickly scales even vertical walls.\nIt senses humidity with its tail\nto predict the next day’s weather.");
	pchar PokedexDes253[] = _("Its strongly developed thigh\nmuscles give it astounding\nagility and jumping performance.");
	pchar PokedexDes254[] = _("The leaves that grow on its arms\ncan slice down thick trees. It is\nwithout peer in jungle combat.");
	pchar PokedexDes255[] = _("It has a flame sac inside\nits belly that perpetually burns. It\nfeels warm if it is hugged.");
	pchar PokedexDes256[] = _("Its kicking mastery lets it loose 10\nkicks per second. It emits sharp cries\nto intimidate foes.");
	pchar PokedexDes257[] = _("It can clear a 30-story\nbuilding in a leap. Its\nfiery punches scorch its foes.");
	pchar PokedexDes258[] = _("Its large tail fin propels it through\nwater with powerful acceleration.\nIt is strong in spite of its size.");
	pchar PokedexDes259[] = _("Its sturdy legs give it sure\nfooting, even in mud. It burrows\ninto dirt to sleep.");
	pchar PokedexDes260[] = _("Its arms are hard as rock.\nWith one swing, it can break\na boulder into pieces.");
	pchar PokedexDes261[] = _("A Pokémon with a persistent nature,\nit chases its chosen prey until\nthe prey becomes exhausted.");
	pchar PokedexDes262[] = _("It will always obey the commands of\na skilled Trainer. Its behavior arises from\nits living in packs in ancient times.");
	pchar PokedexDes263[] = _("It walks in zigzag fashion. It’s\ngood at finding items in the\ngrass and even in the ground.");
	pchar PokedexDes264[] = _("When running in a straight line, it can\neasily top 60 miles an hour. It has\na tough time with curved roads.");
	pchar PokedexDes265[] = _("It loves to eat leaves. If it is\nattacked by a Starly, it will defend\nitself with its spiked rear.");
	pchar PokedexDes266[] = _("It wraps silk around the branches\nof a tree. It drinks rainwater\non its silk while awaiting evolution.");
	pchar PokedexDes267[] = _("Vibrantly patterned wings are its prominent\nfeature. It sucks sweet flower nectar\nwith its long mouth.");
	pchar PokedexDes268[] = _("Its body, which is made of soft\nsilk, hardens over time. When cracks\nappear, evolution is near.");
	pchar PokedexDes269[] = _("A nocturnal Pokémon. Drawn by\nstreetlights, they messily eat the\nleaves of trees lining boulevards.");
	pchar PokedexDes270[] = _("It looks like an aquatic plant\nand serves as a ferry to\nPokémon that can’t swim.");
	pchar PokedexDes271[] = _("It lives at the water’s edge where it is\nsunny. It sleeps on a bed of water-grass\nby day and becomes active at night.");
	pchar PokedexDes272[] = _("If it hears festive music, all its\nmuscles fill with energy. It can’t help\nbreaking out into a dance.");
	pchar PokedexDes273[] = _("It attaches itself to a tree branch using\nthe top of its head. Strong winds can\nsometimes make it fall.");
	pchar PokedexDes274[] = _("The sound of its grass\nflute makes its listeners uneasy.\nIt lives deep in forests.");
	pchar PokedexDes275[] = _("A Pokémon that was feared as a\nforest guardian. It can read the foe’s\nmind and take preemptive action.");
	pchar PokedexDes276[] = _("It has a gutsy spirit that makes it\nbravely take on tough foes. It flies in\nsearch of warm climates.");
	pchar PokedexDes277[] = _("If its two tail feathers are standing\nat attention, it is proof of good\nhealth. It soars elegantly in the sky.");
	pchar PokedexDes278[] = _("With its long, thin wings, it\ncatches updrafts and flies like a\nglider high up into the sky.");
	pchar PokedexDes279[] = _("It places small Pokémon into its spacious\nbeak and carries them around. No one\nknows where it’s taking them.");
	pchar PokedexDes280[] = _("If its horns capture the warm\nfeelings of people or Pokémon, its\nbody warms up slightly.");
	pchar PokedexDes281[] = _("The cheerful spirit of its Trainer gives\nit energy for its psychokinetic power. It\nspins and dances when happy.");
	pchar PokedexDes282[] = _("To protect its Trainer, it will expend\nall its psychic power to create a\nsmall black hole.");
	pchar PokedexDes283[] = _("It moves as if skating on\nthe surface of the water. It\noften fights with Dewpider over food.");
	pchar PokedexDes284[] = _("Its thin, winglike antennae are\nhighly absorbent. It waits out\nrainy days in tree hollows.");
	pchar PokedexDes285[] = _("It prefers damp places. By day it\nremains still in the forest shade.\nIt releases toxic powder from head.");
	pchar PokedexDes286[] = _("Its short arms stretch when it throws\npunches. Its technique is equal to that\nof pro boxers.");
	pchar PokedexDes287[] = _("The way Slakoth lolls around\nmakes anyone who watches it\nfeel like doing the same.");
	pchar PokedexDes288[] = _("Its heartbeat is fast and its blood\nso agitated that it can’t sit still\nfor one second.");
	pchar PokedexDes289[] = _("The world’s laziest Pokémon. It moves to\nanother spot when there’s no food left\nwithin its reach.");
	pchar PokedexDes290[] = _("Because it lived almost entirely\nunderground, it is nearly blind.\nIt uses its antennae instead.");
	pchar PokedexDes291[] = _("Its cry leaves a lasting headache if heard\nfor too long. It moves so quickly that\nit is almost invisible.");
	pchar PokedexDes292[] = _("A discarded bug shell that came to\nlife. Peering into the crack on its\nback is said to steal one’s spirit.");
	pchar PokedexDes293[] = _("It usually murmurs but starts crying\nloudly if it senses danger. It stops when\nits ear covers are shut.");
	pchar PokedexDes294[] = _("It shouts loudly by inhaling air,\nand then uses its well-developed\nstomach muscles to exhale.");
	pchar PokedexDes295[] = _("Its howls can be heard over six\nmiles away. It emits all sorts of\nnoises from the ports on its body.");
	pchar PokedexDes296[] = _("It practices its slaps by repeatedly\nslapping tree trunks. It has been known to\nslap an Exeggutor and get flung away.");
	pchar PokedexDes297[] = _("Although they enjoy comparing their\nstrength, they’re also kind. They value\netiquette, praising opponents they battle.");
	pchar PokedexDes298[] = _("A Pokémon that lives by water. It\nmoves quickly on land by bouncing on\nits big tail.");
	pchar PokedexDes299[] = _("It moves less than an inch a year, but\nwhen it’s in a jam, it will spin and\ndrill down into the ground in a split");
	pchar PokedexDes300[] = _("It can’t stop itself from chasing\nmoving things, and it runs in\na circle, chasing its own tail.");
	pchar PokedexDes301[] = _("It dislikes dirty places. It often\nsearches for a comfortable place in\nwhich to groom itself.");
	pchar PokedexDes302[] = _("It’s a fiend for gemstones, so it stalks\n Carbink. Unfortunately, Gabite\nalmost always grabs them first.");
	pchar PokedexDes303[] = _("It uses its docile-looking face to lull\nfoes into complacency, then bites with its\nhuge, relentless jaws.");
	pchar PokedexDes304[] = _("It usually lives deep in mountains.\nHowever, hunger may drive it to eat\nrailroad tracks and cars.");
	pchar PokedexDes305[] = _("It loves iron ore. Groups of\nthem fight for territory by bashing\none another with their steel bodies.");
	pchar PokedexDes306[] = _("It claims an entire mountain as its own.\nThe more wounds it has, the more it has\nbattled, so don’t take it lightly.");
	pchar PokedexDes307[] = _("It always trains deep in mountains.\nIt levitates when it heightens its\nspiritual power through meditation.");
	pchar PokedexDes308[] = _("It elegantly avoids attacks with dance-\nlike steps, then launches a devastating\nblow in the same motion.");
	pchar PokedexDes309[] = _("Friction between the air and its fur\n produces static electricity. When\nElectrike runs, it makes a crackling sound.");
	pchar PokedexDes310[] = _("Manectric can be found beneath unnatural\nthunderclouds. People say it can run at the\nsame speed as lightning striking.");
	pchar PokedexDes311[] = _("It cheers on friends with\npom-poms made of sparks. It\ndrains power from telephone poles.");
	pchar PokedexDes312[] = _("Exposure to electricity from Minun\nand Plusle promotes blood circulation\nand relaxes muscles.");
	pchar PokedexDes313[] = _("It communicates with others by lighting\nup its rear at night. It\nloves Illumise’s sweet aroma.");
	pchar PokedexDes314[] = _("Its fragrance attracts a swarm of Volbeat,\nso they draw over 200 patterns in\nthe night sky.");
	pchar PokedexDes315[] = _("It uses the different poisons in each hand\nseparately when it attacks. The stronger\nits aroma, the healthier it is.");
	pchar PokedexDes316[] = _("It has a small heart and brain.\nIts stomach comprises most of its body,\nwith enzymes to dissolve anything.");
	pchar PokedexDes317[] = _("It swallows anything whole. It sweats\ntoxic fluids from its follicles to\ndouse foes.");
	pchar PokedexDes318[] = _("They’re such cowards that they won’t hunt\nalone. When five or so of them get together,\nthey suddenly turn ferocious!");
	pchar PokedexDes319[] = _("It drinks in seawater and jets it\nfrom its rear to propel itself. It’s\nvery sensitive to the scent of blood.");
	pchar PokedexDes320[] = _("Due to their memories of when they\nonce lived on land, pods of them\nwill, very rarely, wash up on shore.");
	pchar PokedexDes321[] = _("They eat so many fish Pokémon\nthat when Wailord become too numerous,\nfishermen have to chase them off.");
	pchar PokedexDes322[] = _("Its humped back stores intensely\nhot magma. In rain, the\nmagma cools, slowing its movement.");
	pchar PokedexDes323[] = _("The volcanoes on its back have a\nmajor eruption every 10 years--or\nwhenever it becomes really angry.");
	pchar PokedexDes324[] = _("You can tell how it’s feeling by the smoke\n spouting from its shell. Tremendous\nvelocity is a sign of good health.");
	pchar PokedexDes325[] = _("It bounces constantly, using its tail like\na spring. The shock of bouncing keeps\nits heart beating.");
	pchar PokedexDes326[] = _("It uses black pearls to amplify\nits psychic power. It does a\nstrange dance to control foes?minds.");
	pchar PokedexDes327[] = _("Its steps are shaky and\nstumbling. Walking for a long\ntime makes it feel sick.");
	pchar PokedexDes328[] = _("It can live for a week without eating a\nthing. It waits patiently at the bottom\nof its nest for prey to appear.");
	pchar PokedexDes329[] = _("It vibrates its wings to send out\nodd sound waves. Trainers who are with\nit need earplugs.");
	pchar PokedexDes330[] = _("By flapping their wings, Flygon cause\nsandstorms that conceal Krookodile.\nThe team then splits the prey they catch.");
	pchar PokedexDes331[] = _("It lives in arid\nlocations. Its yellow flowers\nbloom once a year.");
	pchar PokedexDes332[] = _("It becomes active at night,\nseeking prey that is exhausted\nfrom the day’s desert heat.");
	pchar PokedexDes333[] = _("For some reason, it likes to land\non people’s heads softly and act like\nit’s a hat.");
	pchar PokedexDes334[] = _("It flies gracefully through the sky. Its\nmelodic humming makes you feel like you’re\nin a dream.");
	pchar PokedexDes335[] = _("It has feuded with Seviper\nfor many generations. Its sharp\nclaws are its biggest weapons.");
	pchar PokedexDes336[] = _("In battle, it uses its bladed tail\nto counter any Zangoose. It secretes a\ndeadly venom in its tail.");
	pchar PokedexDes337[] = _("Because it turns active on nights of\nthe full moon, it is said to\nhave some link to the lunar phases.");
	pchar PokedexDes338[] = _("Solar energy is the source of its\npower, so it is strong during the\ndaytime. When it spins, its body shines.");
	pchar PokedexDes339[] = _("Its entire body is gooey. When pecked\nat by bird Pokémon, it slips and\nslides its way to freedom.");
	pchar PokedexDes340[] = _("Its vision is not that good. It senses\nvibrations in the water with its whiskers to\ndetermine the location of its prey.");
	pchar PokedexDes341[] = _("It can adapt very well to its\nenvironment. Feebas and Corphish are about the\nonly Pokémon to live in stagnant ditches.");
	pchar PokedexDes342[] = _("Its pincers often fall off. Unlike with\nCrabrawler or Clauncher, the meat in its\nclaws is utterly nasty and stinking.");
	pchar PokedexDes343[] = _("Depictions of Pokémon similar to Baltoy\nhave been found on the walls\nof caves where primitive humans lived.");
	pchar PokedexDes344[] = _("An ancient clay figurine that came to\nlife as a Pokémon from exposure to\na mysterious ray of light.");
	pchar PokedexDes345[] = _("It sticks to rocks with its powerful\nsuckers and can’t be washed away no matter\nhow rough the surf gets.");
	pchar PokedexDes346[] = _("Normally, it lived on shallow sea shoals.\nWhen the tide went out, this Pokémon\ncame up on land to search for prey.");
	pchar PokedexDes347[] = _("This is one kind of primeval bug Pokémon.\nWith eight wings, it could apparently\nswim a lot faster than you’d expect.");
	pchar PokedexDes348[] = _("It lived on land and went out\ninto the sea to hunt for prey.\nIts sharp claws were its greatest weapon.");
	pchar PokedexDes349[] = _("Although unattractive and unpopular, this\nPokémon’s marvelous vitality has made\nit a subject of research.");
	pchar PokedexDes350[] = _("Its dwelling place is the bottom of\nbig lakes. Those who behold its loveliness\nare said to have their hearts purified.");
	pchar PokedexDes351[] = _("Its form changes depending on\nthe weather. The rougher conditions\nget, the rougher Castform’s disposition!");
	pchar PokedexDes352[] = _("Its color changes for concealment and also\nwhen its mood or health changes. The\ndarker the color, the healthier it is.");
	pchar PokedexDes353[] = _("It eats up emotions like malice, jealousy,\nand resentment, so some people are\ngrateful for its presence.");
	pchar PokedexDes354[] = _("A doll that became a Pokémon over\nits grudge from being junked. It seeks\nthe child that disowned it.");
	pchar PokedexDes355[] = _("It doggedly pursues its prey\nwherever it goes. However, the\nchase is abandoned at sunrise.");
	pchar PokedexDes356[] = _("Anyone who dares peer into its body to\nsee its spectral ball of fire will have\ntheir spirit stolen away.");
	pchar PokedexDes357[] = _("The bunches of fruit growing around the\nnecks of Tropius in Alola are especially\nsweet compared to those in other regions.");
	pchar PokedexDes358[] = _("It uses the sucker on its head to\nhang from a tree or from eaves.\nIt can produce seven different tones.");
	pchar PokedexDes359[] = _("The elderly call it the disaster Pokémon\nand detest it, but interest in its power\nto predict disasters is on the rise.");
	pchar PokedexDes360[] = _("It tends to move in a pack with\nothers. They cluster in a tight group to\nsleep in a cave.");
	pchar PokedexDes361[] = _("It feeds mainly on ice and snow. It’s only\nable to survive in a limited number of\nplaces in the warm Alola region.");
	pchar PokedexDes362[] = _("It freezes its prey and chews them whole.\nHowever, it prefers to eat Pokémon like\nVanillite that are already frozen.");
	pchar PokedexDes363[] = _("They can’t swim well yet, and\nthey move much faster by rolling.\nWhen they’re happy, they clap fins.");
	pchar PokedexDes364[] = _("It has a very sensitive nose.\nIt touches new things with its\nnose to examine them.");
	pchar PokedexDes365[] = _("It shatters ice with its big tusks.\nIts thick blubber repels not only the\ncold, but also enemy attacks.");
	pchar PokedexDes366[] = _("Clamperl’s pearls are exceedingly precious.\nThey can be more than 10 times as\ncostly as Shellder’s pearls.");
	pchar PokedexDes367[] = _("It’s not the strongest swimmer. It wags its tail\nto lure in its prey and then gulps them\ndown as soon as they get close.");
	pchar PokedexDes368[] = _("The color of its body changes with the\nwater temperature. Its coloration\nin Alola is almost blindingly vivid.");
	pchar PokedexDes369[] = _("Thought to have gone extinct, Relicanth\nwas given a name that is a variation of\nthe name of the person who discovered it.");
	pchar PokedexDes370[] = _("Luvdisc makes its home in coral reefs in\nwarm seas. It especially likes sleeping in\nthe space between Corsola’s branches.");
	pchar PokedexDes371[] = _("Its belief that it will be able to fly\none day is apparently the influence\nof information carried in its genes.");
	pchar PokedexDes372[] = _("The cells within its body are changing at\na bewildering pace. Its hard shell is made\nfrom the same substance as bone.");
	pchar PokedexDes373[] = _("Thanks to its fervent wishes, the cells in\nits body finally mutated, and at last it\nhas its heart’s desire wings.");
	pchar PokedexDes374[] = _("Instead of blood, magnetism flows through\nits body. When it’s feeling bad, try giving\nit a magnet.");
	pchar PokedexDes375[] = _("With its two brains, it fires\npowerful psychic energy to stop its\nprey in their tracks.");
	pchar PokedexDes376[] = _("It analyzes its opponents with more\naccuracy than a supercomputer, which\nenables it to calmly back them into a corner.");
	pchar PokedexDes377[] = _("Its entire body is made of rock. If\nany part chips off in battle, it attaches\nrocks to repair itself.");
	pchar PokedexDes378[] = _("It is said to have slept in\na glacier for thousands of years. Its\nbody can’t be melted, even by magma.");
	pchar PokedexDes379[] = _("Tempered by pressure underground over\ntens of thousands of years,\nits body cannot be scratched.");
	pchar PokedexDes380[] = _("It communicates using telepathy. Its body\nis covered in down that refracts light\nto make it invisible.");
	pchar PokedexDes381[] = _("A highly intelligent Pokémon. By folding\nback its forelegs in flight, it\ncan overtake jet planes.");
	pchar PokedexDes382[] = _("A mythical Pokémon said to have\nswelled the seas with rain and\ntidal waves. It battled with Groudon.");
	pchar PokedexDes383[] = _("Said to have expanded the lands by\nevaporating water with raging heat.\nIt battled titanically with Kyogre.");
	pchar PokedexDes384[] = _("It lives in the ozone layer far\nabove the clouds and cannot be seen\nfrom the ground.");
	pchar PokedexDes385[] = _("Generations have believed that any wish\nwritten on a note on its head will\ncome TRUE when it awakens.");
	pchar PokedexDes386[] = _("An alien virus that fell to\nearth on a meteor underwent a\nDNA mutation to become this Pokémon.");
	pchar PokedexDes387[] = _("Photosynthesis occurs across its body\nunder thesun. The shell on its back is\nactually hardened soil.");
	pchar PokedexDes388[] = _("It lives along water in forests.\nIn the daytime, it leaves the\nforest to sunbathe its treed shell.");
	pchar PokedexDes389[] = _("Ancient people imagined that beneath\nthe ground, a gigantic Torterra\ndwelled.");
	pchar PokedexDes390[] = _("Its fiery rear end is fueled\nby gas made in its belly.\nEven rain can’t extinguish the fire.");
	pchar PokedexDes391[] = _("It skillfully controls the intensity\nof the fire on its tail to keep its\nfoes at an ideal distance.");
	pchar PokedexDes392[] = _("Its crown of fire is indicative of\nits fiery nature. It is beaten by\nnone in terms of quickness.");
	pchar PokedexDes393[] = _("It doesn’t like to be taken care of.\nIt’s difficult to bond with since it won’t\nlisten to its Trainer.");
	pchar PokedexDes394[] = _("It lives alone, away from others.\nApparently,every one of them believes\nit is the most important.");
	pchar PokedexDes395[] = _("It swims as fast as a jet\nboat. The edges of its wings are\nsharp and can slice apart drifting ice.");
	pchar PokedexDes396[] = _("They flock in great numbers. Though\nsmall, they flap their wings with\ngreat power.");
	pchar PokedexDes397[] = _("They maintain huge flocks,\nalthough fierce scuffles break\nout between various flocks.");
	pchar PokedexDes398[] = _("The muscles in its wings and\nlegs are strong. It can easily\nfly while gripping a small Pokémon.");
	pchar PokedexDes399[] = _("With nerves of steel, nothing can perturb\nit. It is more agile and active\nthan it appears.");
	pchar PokedexDes400[] = _("It busily makes its nest with stacks\nof branches and roots it has cut\nup with its sharp incisors.");
	pchar PokedexDes401[] = _("It chats with others using the\nsounds of its colliding antennae. These\nsounds are fall hallmarks.");
	pchar PokedexDes402[] = _("It crosses its knifelike arms in front\nof its chest when it cries. It\ncan compose melodies ad lib.");
	pchar PokedexDes403[] = _("The extension and contraction of its\nmuscles generates electricity.\nIt glows when in trouble.");
	pchar PokedexDes404[] = _("Its claws loose electricity with\nenough amperage to cause fainting.\nThey live in small groups.");
	pchar PokedexDes405[] = _("When its eyes gleam gold, it\ncan spot hiding prey even those taking\nshelter behind a wall.");
	pchar PokedexDes406[] = _("When it feels the sun’s warm touch,\nit opens its bud to release pollen.\nIt lives alongside clear pools.");
	pchar PokedexDes407[] = _("Luring prey with a sweet scent, it\nuses poison whips on its arms to\npoison, bind, and finish off the prey.");
	pchar PokedexDes408[] = _("A primeval Pokémon, it possesses a\nhard and sturdy skull, lacking any\nintelligence within.");
	pchar PokedexDes409[] = _("Its skull withstands impacts of any\nmagnitude. As a result, its brain\nnever gets the chance to grow.");
	pchar PokedexDes410[] = _("A mild-mannered, herbivorous Pokémon,\nit used its face to dig up tree roots to eat.\nThe skin on its face was plenty tough.");
	pchar PokedexDes411[] = _("This Pokémon is from roughly 100 million\nyears ago. Its terrifyingly tough face is\nharder than steel.");
	pchar PokedexDes412[] = _("To shelter itself from cold, wintry\nwinds, it covers itself with a\ncloak made of twigs and leaves.");
	pchar PokedexDes413[] = _("Its appearance changes depending on\nwhere it evolved. The materials on hand\nbecome a part of its body.");
	pchar PokedexDes414[] = _("It loves the honey\nof flowers and steals\nhoney collected by Combee.");
	pchar PokedexDes415[] = _("The trio is together from\nbirth. It constantly gathers honey\nfrom flowers to please Vespiquen.");
	pchar PokedexDes416[] = _("It houses its colony in cells in its\nbody and releases various pheromones\nto make thosegrubs do its bidding.");
	pchar PokedexDes417[] = _("It makes fur balls that crackle with\nstatic electricity. It stores them\nwith berriesin tree holes.");
	pchar PokedexDes418[] = _("It swims by rotating its two tails\nlike a screw. When it dives, its\nflotation sac collapses.");
	pchar PokedexDes419[] = _("It floats using its well-developed\nflotation sac. It assists in\nthe rescues of drowning people.");
	pchar PokedexDes420[] = _("Sunlight colors it red. When the small\nball is drained of nutrients, it shrivels\nto herald evolution.");
	pchar PokedexDes421[] = _("During times of strong sunlight, its bud\nblooms, its petals open fully, and it\nbecomes very active.");
	pchar PokedexDes422[] = _("While they normally live in the\nsea, they can function on land,\ntoo, until their skin dries out.");
	pchar PokedexDes423[] = _("Long ago, it had a shell on\nits back. There’s now a vestigial plate\non its back that’s hard but thin.");
	pchar PokedexDes424[] = _("They work in large colonies\nand make rings by linking\ntheir tails, apparently in friendship.");
	pchar PokedexDes425[] = _("Its round body is stuffed\nwith souls and expands each\ntime it leads someone away.");
	pchar PokedexDes426[] = _("There’s a rumor that if you catch a\nDrifblim floating on the wind at dusk,\nyou’ll be carried away to the afterlife.");
	pchar PokedexDes427[] = _("The reason it keeps one ear rolled up\nis so it can launch a swift counterattack\nif it’s attacked by an enemy.");
	pchar PokedexDes428[] = _("Lopunny regrows its coat twice a year.\nMufflers and hats made from its fur\nare really warm.");
	pchar PokedexDes429[] = _("Feared for its wrath and the curses\nit spreads, this Pokémon will also, on\na whim, cast spells that help people.");
	pchar PokedexDes430[] = _("A single cry from this nocturnal\nPokémon, and more than a hundred\nof its Murkrow cronies will assemble.");
	pchar PokedexDes431[] = _("It claws if displeased and\npurrs when affectionate. Its fickleness\nis very popular among some.");
	pchar PokedexDes432[] = _("It would claim another Pokémon’s nest\nas its own if it finds\na nest sufficiently comfortable.");
	pchar PokedexDes433[] = _("Each time it hops, it makes\na ringing sound. It deafens foes\nby emitting high-frequency cries.");
	pchar PokedexDes434[] = _("It sprays a foul fluid from\nits rear. Its stench spreads over\na mile radius, driving Pokémon away.");
	pchar PokedexDes435[] = _("It sprays a vile-smelling fluid from the\ntip of its tail to attack. Its\nrange is over 160 feet.");
	pchar PokedexDes436[] = _("Ancient people believed that the\npattern on Bronzor’s back contained\na mysterious power.");
	pchar PokedexDes437[] = _("In ages past, this Pokémon was revered\nas a bringer of rain. It was\nfound buried in the ground.");
	pchar PokedexDes438[] = _("If its body gets too damp, it will die.\nSo, in a process reminiscent of\nsweating, its eyes expel moisture.");
	pchar PokedexDes439[] = _("It does its absolute best to mimic the\nmovements and expressions of its\nopponents, but it’s still not very good at it.");
	pchar PokedexDes440[] = _("Usually it’s a well-behaved Pokémon, but\nif you take its round rock away, it will cry\nand fuss and throw a big old tantrum.");
	pchar PokedexDes441[] = _("It mimics the cries of other Pokémon to\ntrick them into thinking it’s one of them.\nThis way they won’t attack it.");
	pchar PokedexDes442[] = _("A Pokémon that was formed by\n108 spirits. It is bound to\na fissure in an odd keystone.");
	pchar PokedexDes443[] = _("It reacts to anything that moves flies\nright at it and bites it. Sometimes it injures\nitself, but it doesn’t care too much.");
	pchar PokedexDes444[] = _("It loves sparkly things. It seeks\ntreasures in caves and hoards the\nloot in its nest.");
	pchar PokedexDes445[] = _("Its fine scales don’t just reduce wind\nresistance their sharp edges also cause\ninjury to any opponent who attacks it.");
	pchar PokedexDes446[] = _("It hides food under its long\nfur, but it sometimes forgets about\nit and causes a stinky disturbance.");
	pchar PokedexDes447[] = _("It knows how people and Pokémon feel\nby looking at their auras. It doesn’t\napproach dangerous opponents.");
	pchar PokedexDes448[] = _("Not only does it perceive auras, but\nit has also gained the power to\ncontrol them. It employs them in battle.");
	pchar PokedexDes449[] = _("It lives in arid places.\nInstead of perspiration, it expels\ngrainy sand from its body.");
	pchar PokedexDes450[] = _("It brandishes its gaping mouth in a\ndisplay of fearsome strength. It raises\nvast quantities of sand while attacking.");
	pchar PokedexDes451[] = _("It grips prey with its tail\nclaws and injects poison. It tenaciously\nhangs on until the poison takes.");
	pchar PokedexDes452[] = _("It takes pride in its strength. Even\nthough it can tear foes apart, it\nfinishes them off with powerful poison.");
	pchar PokedexDes453[] = _("Its cheeks hold poison sacs. It\ntries to catch foes off guard\nto jab them with toxic fingers.");
	pchar PokedexDes454[] = _("It has a poison sac at its\nthroat. When it croaks, the stored poison\nis churned for greater potency.");
	pchar PokedexDes455[] = _("It attracts prey with its sweet-smelling\nsaliva, then chomps down. It takes\na whole day to eat prey.");
	pchar PokedexDes456[] = _("It absorbs sunlight with the pink areas\nof its skin, which then shine. This\nappears to be a form of camouflage.");
	pchar PokedexDes457[] = _("Deep down at the bottom of the ocean,\nprey is scarce. Lumineon get into\nfierce disputes with Lanturn over food.");
	pchar PokedexDes458[] = _("It’s highly friendly and easily tamed.\nTours that take people swimming with\nthem are a super-popular beach activity.");
	pchar PokedexDes459[] = _("During cold seasons, it migrates to the\nmountain’s lower reaches. It returns to\nthe snow-covered summit in the spring.");
	pchar PokedexDes460[] = _("It blankets wide areas in snow\nby whipping up blizzards. It is\nalso known as The Ice Monster.");
	pchar PokedexDes461[] = _("It lives in snowy regions. It\ncarves patterns in trees with its\nclaws as a signal to others.");
	pchar PokedexDes462[] = _("It uses radar to monitor its territory.\nIntruders are quickly disposed\nof with a hyper beam.");
	pchar PokedexDes463[] = _("It wraps things with its extensible\ntongue. Getting too close to it\nwill leave you soaked with drool.");
	pchar PokedexDes464[] = _("From holes in its palms, it fires\n out Geodude. Its carapace\ncan withstand volcanic eruptions.");
	pchar PokedexDes465[] = _("It ensnares prey by extending arms made\nof vines. Losing arms to predators does\nnot trouble it.");
	pchar PokedexDes466[] = _("It grips its tail, which spews\nelectricity, and then beats down opponents\nwith the power of its electrified fist.");
	pchar PokedexDes467[] = _("There are still quite a few\nfactories that rely on the flames\nprovided by Magmortar to process metals.");
	pchar PokedexDes468[] = _("As everyone knows, it visits\npeaceful regions, bringing them gifts\nof kindness and sweet blessings.");
	pchar PokedexDes469[] = _("It prefers to battle by biting\napart foes?heads instantly while flying\nby at high speed.");
	pchar PokedexDes470[] = _("It gets its nutrition from photosynthesis.\nIt lives a quiet life deep\nin forests where clean rivers flow.");
	pchar PokedexDes471[] = _("It protects itself by freezing its fur into\nsharp needles. It can drop its body\ntemperature below -75 degrees Fahrenheit.");
	pchar PokedexDes472[] = _("It observes prey while hanging\ninverted from branches. When the\nchance presents itself, it swoops!");
	pchar PokedexDes473[] = _("A frozen Mamoswine was dug from ice\ndating back 10000 years. This Pokémon\nhas been around a long, long, long time.");
	pchar PokedexDes474[] = _("Its program was modified to facilitate\nextra-dimensional activities, but that\nled to noticeably strange behavior.");
	pchar PokedexDes475[] = _("Because it can sense what its foe\nis thinking, its attacks burst out first,\nfast, and fierce.");
	pchar PokedexDes476[] = _("Although it can control its units known\nas Mini-Noses, they sometimes get\nlost and don’t come back.");
	pchar PokedexDes477[] = _("It is said to take\nlost spirits into its pliant\nbody and guide them home.");
	pchar PokedexDes478[] = _("When it finds humans or Pokémon it\nlikes, it freezes them and takes them\nto its chilly den as decorations.");
	pchar PokedexDes479[] = _("Research continues on this Pokémon,\nwhich could be the power\nsource of a unique motor.");
	pchar PokedexDes480[] = _("Known as The Being of Knowledge. It is\nsaid that it can wipe out the memory\nof those who see its eyes.");
	pchar PokedexDes481[] = _("Known as The Being of Emotion. It\ntaught humans the nobility of\nsorrow, pain, and joy.");
	pchar PokedexDes482[] = _("Known as The Being of Willpower. It\nsleeps at the bottom of a lake to keep\nthe world in balance.");
	pchar PokedexDes483[] = _("A Pokémon spoken of in legend. It\nis said that time began moving when\nDialga was born.");
	pchar PokedexDes484[] = _("It is said to live in a\ngap in the spatial dimension parallel to\nours. It appears in mythology.");
	pchar PokedexDes485[] = _("It dwells in volcanic caves. It\ndigs in with its cross-shaped feet\nto crawl on ceilings and walls.");
	pchar PokedexDes486[] = _("It is said to have made Pokémon\nthat look like itself from a special\nice mountain, rocks, and magma.");
	pchar PokedexDes487[] = _("This Pokémon is said to live in a world\non the reverse side of ours, where com\n-mon knowledge is distorted and strange.");
	pchar PokedexDes488[] = _("Shiny particles are released from its\nwings like a veil. It is\nsaid to represent the crescent moon.");
	pchar PokedexDes489[] = _("When the water warms, they inflate\nthe flotation sac on their heads and drift\nlanguidly on the sea in packs.");
	pchar PokedexDes490[] = _("It is born with a wondrous\npower that lets it bond with\nany kind of Pokémon.");
	pchar PokedexDes491[] = _("It chases people and Pokémon from\nits territory by causing them to\nexperience deep, nightmarish slumbers.");
	pchar PokedexDes492[] = _("It can dissolve toxins in the\nair to instantly transform ruined land\ninto a lush field of flowers.");
	pchar PokedexDes493[] = _("According to the legends of Sinnoh,\nthis Pokémon emerged from an egg and\nshaped all there is in this world.");
	pchar PokedexDes494[] = _("This Pokémon brings victory. It is said\nthat Trainers with Victini always win,\nregardless of the type of encounter.");
	pchar PokedexDes495[] = _("Being exposed to sunlight makes its\nmovements swifter. It uses vines more\nadeptly than its hands.");
	pchar PokedexDes496[] = _("It moves along the ground as if sliding.\nIts swift movements befuddle its foes,\nand it then attacks with a vine whip.");
	pchar PokedexDes497[] = _("It only gives its all against strong\nopponents who are not fazed by the\nglare from Serperior’s noble eyes.");
	pchar PokedexDes498[] = _("It can deftly dodge its foe’s attacks\nwhile shooting fireballs from its nose.\nIt roasts berries before it eats them.");
	pchar PokedexDes499[] = _("The more it eats, the more fuel it has to\nmake the fire in its stomach stronger.\nThis fills it with even more power.");
	pchar PokedexDes500[] = _("It can throw a fire punch by setting\nits fists on fire with its fiery chin.\nIt cares deeply about its friends.");
	pchar PokedexDes501[] = _("The scalchop on its stomach isn’t just\nused for battle it can be used to\nbreak open hard berries as well.");
	pchar PokedexDes502[] = _("Strict training is how\nit learns its flowing\ndouble-scalchop technique.");
	pchar PokedexDes503[] = _("In the time it takes a foe\nto blink, it can draw and sheathe\nthe seamitars attached to its front legs.");
	pchar PokedexDes504[] = _("Using food stored in cheek pouches,\nthey can keep watch for days. They use\ntheir tails to communicate with others.");
	pchar PokedexDes505[] = _("Using luminescent matter, it makes its\neyes and body glow and stuns\nattacking opponents.");
	pchar PokedexDes506[] = _("This Pokémon has excellent judgment. If\nit decides it can’t defeat an opponent,\nit immediately turns tail and vamooses.");
	pchar PokedexDes507[] = _("The longer its black fur grows, the\nharder and more impervious it gets. Claws\nand fangs can’t easily penetrate it.");
	pchar PokedexDes508[] = _("It pays no mind to the cold, thanks\nto its long warm coat. Stoutland in Alola\nlook a little uncomfortable.");
	pchar PokedexDes509[] = _("Its cute act is a ruse. When victims\nlet down their guard, they find their\nitems taken. It attacks with sharp claws.");
	pchar PokedexDes510[] = _("Their beautiful form comes from the\nmuscles they have developed. They run\nsilently in the night.");
	pchar PokedexDes511[] = _("It shares the leaf on its head with\nweary-looking Pokémon. These leaves\nare known to relieve stress.");
	pchar PokedexDes512[] = _("It attacks enemies with strikes of\nits thorn-covered tail. This Pokémon is\nwild tempered.");
	pchar PokedexDes513[] = _("Very intelligent, it roasts berries\nbefore eating them. It likes\nto help people.");
	pchar PokedexDes514[] = _("A flame burns inside its body.\nIt scatters embers from its head\nand tail to sear its opponents.");
	pchar PokedexDes515[] = _("The water stored inside the tuft on\nits head is full of nutrients. It\nwaters plants with it using its tail.");
	pchar PokedexDes516[] = _("The high-pressure water expelled from\nits tail is so powerful, it can destroy\na concrete wall.");
	pchar PokedexDes517[] = _("This Pokémon appears before people\nand Pokémon who are having\nnightmares and eats those dreams.");
	pchar PokedexDes518[] = _("The mist emanating from their\nforeheads is packed with the\ndreams of people and Pokémon.");
	pchar PokedexDes519[] = _("This very forgetful Pokémon will wait for\na new order from its Trainer even\nthough it already has one.");
	pchar PokedexDes520[] = _("Many people believe that, deep in the\nforest where Tranquill live, there is a\npeaceful place where there is no war.");
	pchar PokedexDes521[] = _("Males swing their head plumage to\nthreaten opponents. The females?flying\nabilities surpass those of the males.");
	pchar PokedexDes522[] = _("When thunderclouds cover the sky, it will\nappear. It can catch lightning with its\nmane and store the electricity.");
	pchar PokedexDes523[] = _("When this ill-tempered Pokémon runs\nwild, it shoots lightning from\nits mane in all directions.");
	pchar PokedexDes524[] = _("Its ear is hexagonal in\nshape. Compressed underground, its body\nis as hard as steel.");
	pchar PokedexDes525[] = _("The energy overflowing from its body\nhas turned into orange crystals that\nare hard enough to smash diamonds.");
	pchar PokedexDes526[] = _("When it fires off energy with all\nits might, the power creates\ncountless fissures on its body.");
	pchar PokedexDes527[] = _("Its habitat is dark forests and caves.\nIt emits ultrasonic waves from its nose\nto learn about its surroundings.");
	pchar PokedexDes528[] = _("It shakes its tail vigorously when it\nemits ultrasonic waves strong enough\nto reduce concrete to rubble.");
	pchar PokedexDes529[] = _("It makes its way swiftly through\nthe soil by putting both claws\ntogether and rotating at high speed.");
	pchar PokedexDes530[] = _("It can help in tunnel construction. Its\ndrill has evolved into steel strong\nenough to bore through iron plates.");
	pchar PokedexDes531[] = _("Using the feelers on its ears, it\ncan tell how someone is feeling or\nwhen an egg might hatch.");
	pchar PokedexDes532[] = _("These Pokémon appear at building sites\nand help out with construction. They\nalways carry squared logs.");
	pchar PokedexDes533[] = _("With strengthened bodies, they\nskillfully wield steel beams\nto take down buildings.");
	pchar PokedexDes534[] = _("It is thought that Conkeldurr taught\nhumans how to make concrete more\nthan 2000 years ago.");
	pchar PokedexDes535[] = _("By vibrating its cheeks, it emits\nsound waves imperceptible to humans and\nwarns others of danger.");
	pchar PokedexDes536[] = _("When they vibrate the bumps on their\nheads, they can make waves in water\nor earthquake-like vibrations on land.");
	pchar PokedexDes537[] = _("It increases the power of its punches by\nvibrating the bumps on its fists. It can\nturn a boulder to rubble with one punch.");
	pchar PokedexDes538[] = _("When it tightens its belt, it becomes\nstronger. Wild Throh use vines to weave\ntheir own belts.");
	pchar PokedexDes539[] = _("Desiring the strongest karate chop, they\nseclude themselves in mountains and train\nwithout sleeping.");
	pchar PokedexDes540[] = _("This Pokémon makes clothes for itself.\nIt chews up leaves and sews them with\nsticky thread extruded from its mouth.");
	pchar PokedexDes541[] = _("Forests where Swadloon live have superb\nfoliage because the nutrients they make\nfrom fallen leaves nourish the plant life.");
	pchar PokedexDes542[] = _("Upon finding a small Pokémon, it weaves\nclothing for it from leaves by using\nthe sticky silk secreted from its mouth.");
	pchar PokedexDes543[] = _("It discovers what is going on around\nit by using the feelers on its\nhead and tail. It is brutally aggressive.");
	pchar PokedexDes544[] = _("Protected by a hard shell, it\nspins its body like a wheel\nand crashes furiously into its enemies.");
	pchar PokedexDes545[] = _("It clasps its prey with the claws on\nits neck until it stops moving. Then it\nfinishes it off with deadly poison.");
	pchar PokedexDes546[] = _("When attacked, it expels cotton from\nits body to create a diversion. The cotton\nit loses grows back in quickly.");
	pchar PokedexDes547[] = _("This nuisance sneaks into people’s homes,\nwhere it hides important things and\nscatters cotton all over the place.");
	pchar PokedexDes548[] = _("By pruning the leaves on its head\nwith regularity, this Pokémon can be\ngrown into a fine plump shape.");
	pchar PokedexDes549[] = _("No matter how much time and money is\nspent raising it, its flowers are the most\nbeautiful when they bloom in the wild.");
	pchar PokedexDes550[] = _("Savage, violent Pokémon, red and blue\nBasculin are always fighting each other\nover territory.");
	pchar PokedexDes551[] = _("It moves along below the sand’s surface,\nexcept for its nose and eyes. A dark\nmembrane shields its eyes from the sun.");
	pchar PokedexDes552[] = _("Krokorok really hates it when its body\ngets cold. On nights when the temperature drops,\n it digs deep into the desert sands.");
	pchar PokedexDes553[] = _("It conceals itself in sandstorms that\nFlygon whip up and waits patiently\nfor prey to appear.");
	pchar PokedexDes554[] = _("Darumaka’s droppings are hot, so people\nused to put them in their clothes to\nkeep themselves warm.");
	pchar PokedexDes555[] = _("When one is injured in a fierce\nbattle, it hardens into a stone-like form.\nThen it meditates and sharpens its mind.");
	pchar PokedexDes556[] = _("It uses an up-tempo song and dance\nto drive away the bird Pokémon that\nprey on its flower seeds.");
	pchar PokedexDes557[] = _("It makes a hole in a suitable rock. If that\nrock breaks, the Pokémon remains\nagitated until it locates a replacement.");
	pchar PokedexDes558[] = _("It possesses legs of enormous strength,\nenabling it to carry heavy slabs for many\ndays, even when crossing arid land.");
	pchar PokedexDes559[] = _("They move in small groups, walking\naround lazily. Anyone who makes eye\ncontact gets smacked with a headbutt.");
	pchar PokedexDes560[] = _("This Pokémon may be rude, but it\ntakes very good care of its family,\nits friends, and its turf.");
	pchar PokedexDes561[] = _("The guardians of an ancient city,\nthey use their psychic power to attack\nenemies that invade their territory.");
	pchar PokedexDes562[] = _("These Pokémon arose from the spirits\nof people interred in graves. Each\nretains memories of its former life.");
	pchar PokedexDes563[] = _("It has been said that they swallow those\nwho get too close and turn them into\nmummies. They like to eat gold nuggets.");
	pchar PokedexDes564[] = _("It was restored from an ancient fossil.\nTirtouga lived in the sea but came up\nonto the land to search for prey.");
	pchar PokedexDes565[] = _("Carracosta eats every last bit of the\nprey it catches, even the shells and bones,\nto further strengthen its sturdy shell.");
	pchar PokedexDes566[] = _("Once thought to be the ancestor of all\nbird Pokémon, some of the latest\nresearch suggests that may not be the case.");
	pchar PokedexDes567[] = _("Although apparently able to fly, they\ntended to run along the ground,\naveraging speeds of roughly 25 mph.");
	pchar PokedexDes568[] = _("Poisonous gas leaks out of it when it\nbreathes. Muk that catch a whiff of that\nstench will come drooling.");
	pchar PokedexDes569[] = _("It locks opponents in place with its left\nhand, immobilizing them by entirely\ndousing their bodies with poisonous liquid.");
	pchar PokedexDes570[] = _("If a normally talkative child\nsuddenly stops talking, it may\nhave been replaced by Zorua.");
	pchar PokedexDes571[] = _("It doesn’t just transform itself it also\nhas the power to make hundreds\nof people see its illusions.");
	pchar PokedexDes572[] = _("Minccino greet each other\nby grooming one another\nthoroughly with their tails.");
	pchar PokedexDes573[] = _("The oil that seeps from its body is really\nsmooth. For people troubled by bad skin,\nthis oil is an effective treatment.");
	pchar PokedexDes574[] = _("Their ribbonlike feelers increase their\npsychic power. They are always\nstaring at something.");
	pchar PokedexDes575[] = _("Starlight is the source of their power.\nAt night, they mark star positions by using\npsychic power to float stones.");
	pchar PokedexDes576[] = _("Starry skies thousands of light-years\naway are visible in the space distorted\nby their intense psychic power.");
	pchar PokedexDes577[] = _("Because their bodies are enveloped in a\nspecial liquid, they are fine in any\nenvironment, no matter how severe.");
	pchar PokedexDes578[] = _("Since they have two divided brains,\nat times they suddenly try to\ntake two different actions at once.");
	pchar PokedexDes579[] = _("They use psychic power to control their\narms, which are made of a special liquid.\nThey can crush boulders psychically.");
	pchar PokedexDes580[] = _("When attacked, it uses its\nfeathers to splash water, escaping\nunder cover of the spray.");
	pchar PokedexDes581[] = _("Despite their elegant appearance, they\ncan flap their wings strongly and fly\nfor thousands of miles.");
	pchar PokedexDes582[] = _("It exhales cold air that is at\n-58 degrees Fahrenheit. When it’s in a\nwarm place, it shrinks little by little.");
	pchar PokedexDes583[] = _("It sprays its enemies with grains of\nice to freeze them. Most Vanillish in\nAlola are smaller than average.");
	pchar PokedexDes584[] = _("Each of its two heads has a brain, and\nwhen they are in agreement, it attacks its\nenemies by exhaling a violent blizzard.");
	pchar PokedexDes585[] = _("Their coloring changes according to the\nseasons and can be slightly affected by\nthe temperature and humidity as well.");
	pchar PokedexDes586[] = _("They migrate according to the seasons.\nPeople can tell the season by\nlooking at Sawsbuck’s horns.");
	pchar PokedexDes587[] = _("It glides using its cape-like membrane.\nElectrical energy scatters from it, shocking\nits friends and foes alike.");
	pchar PokedexDes588[] = _("These mysterious Pokémon evolve when they\nreceive electrical stimulation while they\nare in the same place as Shelmet.");
	pchar PokedexDes589[] = _("Wearing the shell covering they stole\nfrom Shelmet, they defend themselves and\nattack with two lances.");
	pchar PokedexDes590[] = _("It lures people in with its Poké\nBall pattern, then releases poison spores.\nWhy it resembles a Pok?Ball is unknown.");
	pchar PokedexDes591[] = _("They show off their Pok?Ball\ncaps to lure prey, but very\nfew Pokémon are fooled by this.");
	pchar PokedexDes592[] = _("It wraps its veillike arms and legs\naround prey swimming by and drags them\ndown to the depths of the ocean.");
	pchar PokedexDes593[] = _("Jellicent is always hanging around fancy\ncruise ships and tankers, hoping to\ndrag away its prey.");
	pchar PokedexDes594[] = _("The reason it helps Pokémon in a weakened\ncondition is that any Pokémon coming after\nthem may also attack Alomomola.");
	pchar PokedexDes595[] = _("Since it can’t generate its own electricity,\nit sticks onto large-bodied Pokémon\nand absorbs static electricity.");
	pchar PokedexDes596[] = _("They employ an electrically charged web\nto trap their prey. While it is immobilized by\nshock, they leisurely consume it.");
	pchar PokedexDes597[] = _("When threatened, it attacks by shooting\na barrage of spikes, which gives it a\nchance to escape by rolling away.");
	pchar PokedexDes598[] = _("By swinging around its three\nspiky feelers and shooting spikes,\nit can obliterate an opponent.");
	pchar PokedexDes599[] = _("Interlocking two bodies and spinning\naround generates the energy they\nneed to live.");
	pchar PokedexDes600[] = _("By changing the direction in which it\nrotates, it communicates its feelings to\nothers. When angry, it rotates faster.");
	pchar PokedexDes601[] = _("The gear with the red core\nis rotated at high speed for\na rapid energy charge.");
	pchar PokedexDes602[] = _("While one alone doesn’t have much\npower, a chain of many Tynamo\ncan be as powerful as lightning.");
	pchar PokedexDes603[] = _("It wraps itself around its prey and\nparalyzes it with electricity from the\nround spots on its sides. Then it chomps.");
	pchar PokedexDes604[] = _("With their sucker mouths, they suck in\nprey. Then they use their fangs to\nshock the prey with electricity.");
	pchar PokedexDes605[] = _("This Pokémon is shrouded in mystery.\nIt’s said to have appeared from a UFO that\nfell from the sky about 50 years ago.");
	pchar PokedexDes606[] = _("With its psychic powers, it rewrites\nits opponents?memories. You, too, may\nhave already had your memories rewritten.");
	pchar PokedexDes607[] = _("While shining a light and pretending to\nbe a guide, it leeches off the\nlife force of any who follow it.");
	pchar PokedexDes608[] = _("The spirits it absorbs fuel its\nbaleful fire. It hangs around hospitals\nwaiting for people to pass on.");
	pchar PokedexDes609[] = _("Being consumed in Chandelure’s flame\nburns up the spirit, leaving\nthe body behind.");
	pchar PokedexDes610[] = _("They use their tusks to crush\nthe berries they eat. Repeated regrowth\nmakes their tusks strong and sharp.");
	pchar PokedexDes611[] = _("Their tusks can shatter rocks.\nTerritory battles between Fraxure can\nbe intensely violent.");
	pchar PokedexDes612[] = _("They are kind but can be relentless\nwhen defending territory. They challenge\nfoes with tusks that can cut steel.");
	pchar PokedexDes613[] = _("Its nose is always running. It sniffs\nthe snot back up because the mucus\nprovides the raw material for its moves.");
	pchar PokedexDes614[] = _("They love the cold seas of the north.\nThey create pathways across the ocean\nwaters by freezing their own breath.");
	pchar PokedexDes615[] = _("They are born in snow clouds.\nThey use chains made of ice\ncrystals to capture prey.");
	pchar PokedexDes616[] = _("When it and Karrablast are together,\nand both receive electrical\nstimulation, they both evolve.");
	pchar PokedexDes617[] = _("Having removed its heavy shell,\nit becomes very light and\ncan fight with ninja-like movements.");
	pchar PokedexDes618[] = _("Its skin is very hard, so it is unhurt\neven if stepped on by sumo wrestlers.\nIt smiles when transmitting electricity.");
	pchar PokedexDes619[] = _("They can often be seen in packs\nin the morning, slowly moving their bodies\nthrough a series of poses.");
	pchar PokedexDes620[] = _("It overwhelms enemies with continuous\nattacks and then slowly stores up power\nbefore delivering the finishing blow.");
	pchar PokedexDes621[] = _("It infiltrates tunnels that Pokémon like\nDiglett and Dugtrio have dug and quietly\nwaits for prey to pass through.");
	pchar PokedexDes622[] = _("Although ancient people apparently built\nit by working with clay, the source\nof its energy is unclear.");
	pchar PokedexDes623[] = _("Some say that ancient people invented\nGolurk to serve as a laborer.\nIt follows its master’s orders faithfully.");
	pchar PokedexDes624[] = _("Blades comprise this Pokémon’s entire\nbody. If battling dulls the blades, it\nsharpens them on stones by the river.");
	pchar PokedexDes625[] = _("It leads a group of Pawniard. Bisharp\ndoesn’t even change its expression when it\ndeals the finishing blow to an opponent.");
	pchar PokedexDes626[] = _("They charge wildly and headbutt\neverything. Their headbutts have enough\ndestructive force to derail a train.");
	pchar PokedexDes627[] = _("With its powerful legs and sturdy claws,\nit can crack even the hard shells\nof Shellder and pluck out their insides.");
	pchar PokedexDes628[] = _("Known as the hero of the skies, this\nPokémon is so proud and so brave that\nit will never retreat, even when it’s injured.");
	pchar PokedexDes629[] = _("Its healthy appetite leads to visible\ngrowth spurts. It often has to replace the\nbones it wears as its size increases.");
	pchar PokedexDes630[] = _("It skillfully arranges the bones of\nits prey to construct its nest.\nMost of the bones are Cubone.");
	pchar PokedexDes631[] = _("Using their very hot, flame-covered\ntongues, they burn through Durant’s\nsteel bodies and consume their insides.");
	pchar PokedexDes632[] = _("Individuals each play different roles\nin driving Heatmor, their natural\npredator, away from their colony.");
	pchar PokedexDes633[] = _("They cannot see, so they tackle and\nbite to learn about their surroundings.\nTheir bodies are covered in wounds.");
	pchar PokedexDes634[] = _("The two heads do not get along.\nWhichever head eats more than the other\ngets to be the leader.");
	pchar PokedexDes635[] = _("The heads on their arms do not\nhave brains. They use all three heads\nto consume and destroy everything.");
	pchar PokedexDes636[] = _("It protects itself with flame. Long years\nago, people believed Larvesta had a nest\non the sun.");
	pchar PokedexDes637[] = _("As it flies, it scatters its flaming scales.\nIt was feared by ancient people, who\nreferred to it as the rage of the sun.");
	pchar PokedexDes638[] = _("It has a body and heart of steel.\nIts glare is sufficient to make even an\nunruly Pokémon obey it.");
	pchar PokedexDes639[] = _("Its charge is strong enough to break\nthrough a giant castle wall in one blow.\nThis Pokémon is spoken of in legends.");
	pchar PokedexDes640[] = _("Its head sprouts horns as sharp as blades.\nUsing whirlwind-like movements, it\nconfounds and swiftly cuts opponents.");
	pchar PokedexDes641[] = _("The lower half of its body is\nwrapped in a cloud of energy. It\nzooms through the sky at 200 mph.");
	pchar PokedexDes642[] = _("The spikes on its tail discharge immense\nbolts of lightning. It flies around the\nUnova region firing off lightning bolts.");
	pchar PokedexDes643[] = _("This legendary Pokémon can scorch the\nworld with fire. It helps those who\nwant to build a world of truth.");
	pchar PokedexDes644[] = _("This legendary Pokémon can scorch the\nworld with lightning. It assists those\nwho want to build an ideal world.");
	pchar PokedexDes645[] = _("Lands visited by Landorus grant such\nbountiful crops that it has been hailed\nas The Guardian of the Fields.");
	pchar PokedexDes646[] = _("This legendary ice Pokémon waits for a\nhero to fill in the missing parts\nof its body with truth or ideals.");
	pchar PokedexDes647[] = _("It crosses the world, running over the\nsurfaces of oceans and rivers. It appears\nat scenic waterfronts.");
	pchar PokedexDes648[] = _("The melodies sung by Meloetta have the\npower to make Pokémon that hear them\nhappy or sad.");
	pchar PokedexDes649[] = _("This ancient bug Pokémon was altered\nby Team Plasma. They upgraded the\ncannon on its back.");
	pchar PokedexDes650[] = _("Such a thick shell of wood covers its\nhead and back that even a direct hit\nfrom a truck wouldn’t faze it.");
	pchar PokedexDes651[] = _("It relies on its sturdy shell to\ndeflect predators?attacks. It\ncounterattacks with its sharp quills.");
	pchar PokedexDes652[] = _("Its Tackle is forceful enough to flip a\n50-ton tank. It shields its allies\nfrom danger with its own body.");
	pchar PokedexDes653[] = _("Eating a twig fills it with energy, and\nits roomy ears give vent to air hotter\nthan 390 degrees Fahrenheit.");
	pchar PokedexDes654[] = _("It has a twig stuck in its tail.\nWith friction from its tail fur, it sets\nthe twig on fire and launches into battle.");
	pchar PokedexDes655[] = _("It gazes into the flame at the tip\nof its branch to achieve a focused state,\nwhich allows it to see into the future.");
	pchar PokedexDes656[] = _("It secretes flexible bubbles from its chest\nand back. The bubbles can help it\nreduce damage when attacked.");
	pchar PokedexDes657[] = _("It can throw bubble-covered pebbles with\nprecise control, hitting empty cans\nup to a hundred feet away.");
	pchar PokedexDes658[] = _("It creates throwing stars out of\ncompressed water. When spinned at high speed, these\nstars can split metal in two.");
	pchar PokedexDes659[] = _("They use their large ears\nto dig burrows. They will\ndig the whole night through.");
	pchar PokedexDes660[] = _("With their powerful ears, they can heft\nboulders of a ton or more with ease. They\ncan be a big help at construction sites.");
	pchar PokedexDes661[] = _("While it’s an amiable Pokémon, if you\ntouch it unexpectedly, it will heat up\nbody in an instant and you’ll be burned.");
	pchar PokedexDes662[] = _("Its speed right after takeoff already\nputs it in the top speed class of\nall bird Pokémon.");
	pchar PokedexDes663[] = _("Its favorite foods are Wingull and Pikipek. It\nattacks with a powerful kick and grasps\nthem firmly in its talons.");
	pchar PokedexDes664[] = _("When under attack from bird Pokémon, it\nspews a poisonous black powder that\ncauses paralysis on contact.");
	pchar PokedexDes665[] = _("The beaks of bird Pokémon can’t\nbegin to scratch its stalwart body.\nTo defend itself, it spews powder.");
	pchar PokedexDes666[] = _("The patterns on this Pokémon’s wings\ndepend on the climate and topography\nof its habitat. It scatters colorful scales.");
	pchar PokedexDes667[] = _("This hot-blooded Pokémon is filled with\ncuriosity. When it gets angry or starts\nfighting, its short mane gets hot.");
	pchar PokedexDes668[] = _("The male with the largest mane\nof fire is the leader of\nthe pride.");
	pchar PokedexDes669[] = _("Flabéb?wears a crown made from\npollen it’s collected from its flower.\nThe crown has hidden healing properties.");
	pchar PokedexDes670[] = _("It raises flowers and uses them\nas weapons. The more gorgeous the\nblossom, the more power it contains.");
	pchar PokedexDes671[] = _("It controls the flowers it grows. The\npetal blizzards that Florges triggers are\noverwhelming in their beauty and power.");
	pchar PokedexDes672[] = _("Thought to be one of the first\nPokémon to live in harmony with humans,\nit has a placid disposition.");
	pchar PokedexDes673[] = _("They inhabit mountainous regions.\nThe leader of the herd is decided by\na battle of clashing horns.");
	pchar PokedexDes674[] = _("It follows Pangoro around like a\nhenchman. When Pancham makes a big\nmistake, its leaf gets taken away.");
	pchar PokedexDes675[] = _("This rowdy Pokémon boasts great physical\nstrength. Many Trainers are also smitten\nby its lively character.");
	pchar PokedexDes676[] = _("There was an era when aristocrats would\ncompete to see who could trim their\nFurfrou’s fur into the most exquisite style.");
	pchar PokedexDes677[] = _("The organ that emits its intense psychic\npower is sheltered by its ears to\nkeep power from leaking out.");
	pchar PokedexDes678[] = _("When in danger, it raises its ears\nand releases enough psychic power\nto grind a 10-ton truck into dust.");
	pchar PokedexDes679[] = _("If anyone dares to grab its hilt, it wraps\na blue cloth around that person’s arm\nto drain that person’s life energy.");
	pchar PokedexDes680[] = _("The complex attack patterns of its two\nswords are unstoppable, even for\na greatly skilled swordsman.");
	pchar PokedexDes681[] = _("Generations of kings were attended by\nthese Pokémon, it use spectral power to\nmanipulate people and Pokémon.");
	pchar PokedexDes682[] = _("It emits a scent that enraptures those\nwho smell it. This fragrance changes\ndepending on what it has eaten.");
	pchar PokedexDes683[] = _("It devises pleasant and unpleasant scents,\nand emits scents that its enemies dislike in\norder to gain an edge in battle.");
	pchar PokedexDes684[] = _("To entangle its opponents in battle, it\nextrudes white threads as sweet and sticky\nas cotton candy.");
	pchar PokedexDes685[] = _("It can distinguish the faintest of scents\nand put its sensitive sense of smell\nto help pastry chefs in their work.");
	pchar PokedexDes686[] = _("It draws prey near with its blinking\nlights and then wraps them up in its\nlong tentacles and holds them in place.");
	pchar PokedexDes687[] = _("When it comes to strong hypnosis, there’s\nan endless number of people who utilize\nMalamar for their nefarious deeds.");
	pchar PokedexDes688[] = _("Two Binacle live together on one rock.\nWhen they fight, one of them will\nmove to a different rock.");
	pchar PokedexDes689[] = _("When they evolve, two Binacle multiply\ninto seven. They fight with the\npower of seven Binacle.");
	pchar PokedexDes690[] = _("It’s not good at swimming, so it clings\nto the seaweed. In the Alola region, it’s\noften found near Dhelmise.");
	pchar PokedexDes691[] = _("It blends in with seaweed to ambush prey\nand then takes them down with a poisonous\nliquid strong enough to melt metal.");
	pchar PokedexDes692[] = _("Its claws occasionally fall off, and it\nkeeps a low profile until they grow back.\nThe meat of its claws is so delicious!");
	pchar PokedexDes693[] = _("Its right arm is packed with meat.\nWhen its pincer falls off, it’s exported\nto be used as a cooking ingredient.");
	pchar PokedexDes694[] = _("The frills on either side of its head\nhave cells that generate electricity\nwhen exposed to sunlight.");
	pchar PokedexDes695[] = _("They flare their frills to generate energy.\nA single Heliolisk can generate suffi-\ncient electricity to power a skyscraper.");
	pchar PokedexDes696[] = _("This Pokémon was restored from a fossil.\nIf something happens that it doesn’t like,\nit throws a tantrum and runs wild.");
	pchar PokedexDes697[] = _("The king of the ancient world, it can\neasily crunch a car with the devastating\nstrength of its enormous jaws.");
	pchar PokedexDes698[] = _("It lived in cold areas in ancient times.\nIt’s said that when Amaura whinnies,\nauroras appear in the night sky.");
	pchar PokedexDes699[] = _("This usually quiet and kindly\nPokémon has a surface temperature\nof around -240 degrees Fahrenheit.");
	pchar PokedexDes700[] = _("Once a fight breaks out, it will unflinch-\ningly charge at dragon Pokémon that\nare many times larger than itself.");
	pchar PokedexDes701[] = _("Although its body is small, its proficient\nfighting skills enable it to keep up with\nbig bruiser like Machamp and Hariyama.");
	pchar PokedexDes702[] = _("Its upper whiskers are sensors that survey\nits surroundings. Its lower whiskers are\norgans that shoot electricity.");
	pchar PokedexDes703[] = _("Some say that deep beneath the surface\nof the world, a pack of Carbink live\nwith their queen in a kingdom of jewels.");
	pchar PokedexDes704[] = _("Its body is mostly water. If it dries\nout, it will die, so it’s always sitting\nwith perfect stillness in the shade.");
	pchar PokedexDes705[] = _("It crawls along sluggishly. The swirly\nprotrusion on its back is filled\nwith its brain and other organs.");
	pchar PokedexDes706[] = _("Underneath its slimy skin is a thick layer\nof fat, and the combination of the two\nmakes enemies?attacks slide right off.");
	pchar PokedexDes707[] = _("This even-tempered Pokémon has a habit\nof collecting keys. It will sneak into\npeople’s homes to steal their keys.");
	pchar PokedexDes708[] = _("These Pokémon are stumps possessed by the\nspirits of children who died in the forest.\nTheir cries sound like eerie screams.");
	pchar PokedexDes709[] = _("This Pokémon controls trees via roots\nstretching from its feet, and it will attack\nanyone that dares to ravage the forest.");
	pchar PokedexDes710[] = _("The pumpkin body is inhabited by a\nspirit trapped in this world. As the\nsun sets, it becomes restless and active.");
	pchar PokedexDes711[] = _("Singing in eerie voices, they wander town\nstreets on the night of the new moon.\nAnyone who hears their song is cursed.");
	pchar PokedexDes712[] = _("It blocks opponents?attacks with the ice\nthat shields its body. It uses cold air\nto repair any cracks with new ice.");
	pchar PokedexDes713[] = _("Its ice-covered body is as hard\nas steel. Its cumbersome frame crushes\nanything that stands in its way.");
	pchar PokedexDes714[] = _("Fruits are its favorite foods. This\ngourmet carefully picks out just the\nripe ones using its sonar.");
	pchar PokedexDes715[] = _("Although it has a violent disposition,\nif you give it a nice ripe fruit that it\nloves, Noivern will suddenly become tame.");
	pchar PokedexDes716[] = _("Legends say it can share eternal life. It\nslept for a thousand years in the form\nof a tree before its revival.");
	pchar PokedexDes717[] = _("When its life comes to an end, it absorbs\nthe life energy of every living thing and\nturns into a cocoon once more.");
	pchar PokedexDes718[] = _("This is Zygarde’s form when about half of\nits pieces have been assembled. It plays\nthe role of monitoring the ecosystem.");
	pchar PokedexDes719[] = _("A sudden transformation of Carbink, its\npink, glimmering body is said to be the\nloveliest sight in the whole world.");
	pchar PokedexDes720[] = _("This troublemaker sends anything and\neverything to faraway places using\nits loop, which can warp space.");
	pchar PokedexDes721[] = _("It lets out billows of steam and disapp-\nears into the dense fog. It’s said to live in\nmountains where humans do not tread.");
	pchar PokedexDes722[] = _("It feels relaxed in tight, dark places\nand has been known to use its\nTrainer’s pocket or bag as a nest.");
	pchar PokedexDes723[] = _("This narcissistic Pokémon is a clean freak.\nIf you don’t groom it diligently, it\nwill stop listening to you.");
	pchar PokedexDes724[] = _("Decidueye can nock and fire an arrow at\nan enemy in a tenth of a second, so its\nbattles are decided in a blink.");
	pchar PokedexDes725[] = _("Its coat regrows twice a year. When the\ntime comes, Litten sets its body\non fire and burns away the old fur.");
	pchar PokedexDes726[] = _("When its mane is standing on end, you\ncan tell it’s feeling good. When it isn’t\nfeeling well, its fur will lie down flat.");
	pchar PokedexDes727[] = _("When its fighting spirit is\nset alight, the flames around\nits waist become especially intense.");
	pchar PokedexDes728[] = _("The balloons it inflates with its nose\ngrow larger and larger as it practices\nday by day.");
	pchar PokedexDes729[] = _("It gets excited when it sees a dance it\ndoesn’t know. This hard worker practices\ndiligently until it can learn that dance.");
	pchar PokedexDes730[] = _("To Primarina, every battle is a stage.\nIt takes down its prey with beautiful\nsinging and dancing.");
	pchar PokedexDes731[] = _("It pecks at trees with its hard beak.\nYou can get some idea of its mood or\ncondition from the rhythm of its pecking.");
	pchar PokedexDes732[] = _("It can bend the tip of its beak to\nproduce over a hundred different\ncries at will.");
	pchar PokedexDes733[] = _("They smack beaks with others of their kind\nto communicate. The strength and number\nof hits tell each other how they feel.");
	pchar PokedexDes734[] = _("Although it will eat anything, it prefers\nfresh living things, so it marches down\nstreets in search of prey.");
	pchar PokedexDes735[] = _("Patient by nature, this Pokémon loses\ncontrol of itself and pounces when it spots\nits favorite meal Rattata!");
	pchar PokedexDes736[] = _("If you find its nest, you\nshouldn’t stick your hand inside. You’ll\nget bitten by an irritated Grubbin.");
	pchar PokedexDes737[] = _("Its stout shell provides excellent\ndefense from attacks. It uses electricity\non persistent opponents.");
	pchar PokedexDes738[] = _("Vikavolt flusters opponents with acrobatic\nflying skills to create an opening for to\ndeliver an electric beam attack.");
	pchar PokedexDes739[] = _("Its hard pincers are well suited\nto both offense and defense. Fights between\ntwo Crabrawler are like boxing matches.");
	pchar PokedexDes740[] = _("It stores coldness in its pincers and\npummels its foes. It can even smash\nthick walls of ice to bits!");
	pchar PokedexDes741[] = _("This Oricorio has drunk red nectar. If\nits Trainer gives the wrong order, this\npassionate Pokémon becomes fiercely angry.");
	pchar PokedexDes742[] = _("Nectar and pollen are its favorite fare.\nIn fields of flowers, it gets into\nskirmishes with Butterfree over food.");
	pchar PokedexDes743[] = _("It rolls up pollen into puffs. It makes\nmany different varieties, some used as\nfood and others used in battle.");
	pchar PokedexDes744[] = _("Its friendliness considered to be a good\nPokémon for beginners, but its disposition\ngrows rougher as it grows up.");
	pchar PokedexDes745[] = _("The sharp rocks in its mane can\ncut like knives. Lycanroc wears its prey\ndown by degrees before finishing them off.");
	pchar PokedexDes746[] = _("They’re weak, so they move in schools.\nHowever, they can also often be seen all\nalone, having strayed from the school.");
	pchar PokedexDes747[] = _("Mareanie eat Corsola branches so they are\nhated by craftsmen who work with Corsola\nbranches that have naturally fallen off.");
	pchar PokedexDes748[] = _("Toxapex crawls along the ocean floor on\nits 12 legs. It leaves a trail\nof Corsola bits scattered in its wake.");
	pchar PokedexDes749[] = _("Possessing mighty power, Mudbray can be\nloaded with 50 times its own body weight\nand will be totally fine.");
	pchar PokedexDes750[] = _("It can trudge mountain roads without rest\n for three days and three nights, all the\nwhile dragging a 10-ton load.");
	pchar PokedexDes751[] = _("It crawls onto the land in search\nof food. Its water bubble allows it\nto breathe and protects its soft head.");
	pchar PokedexDes752[] = _("It delivers headbutts with the water\nbubble on its head. Small Pokémon get\nsucked into the bubble, where they drown.");
	pchar PokedexDes753[] = _("When the sun rises, Fomantis spreads its\nfour leaves and bathes in the sunlight.\nThe tip of its head has a pleasant aroma.");
	pchar PokedexDes754[] = _("For self-protection, it pretends to be\na bug Pokémon. Both of its\narms bear keen-edged petals.");
	pchar PokedexDes755[] = _("It likes damp dark places. When night\nfalls, the spores filling the caps of\nits mushrooms glow.");
	pchar PokedexDes756[] = _("When it starts fighting for territory\nwith Parasect, the entire area gets\ncompletely coated in spores!");
	pchar PokedexDes757[] = _("It burns its bodily fluids to create\npoisonous gas. It attacks enemies when\nthey get disoriented from inhaling the gas.");
	pchar PokedexDes758[] = _("Salazzle lives deep in caves and\nforces the Salandit it has attracted\nwith its pheromones to serve it.");
	pchar PokedexDes759[] = _("Stufful hates to be hugged or touched\nin any way. It will squirm, thrash,\nand resist with amazing power.");
	pchar PokedexDes760[] = _("It waves its hands wildly in intimidation\nand warning. Life is over for anyone who\ndoesn’t run away as fast as possible.");
	pchar PokedexDes761[] = _("Because of its sweet, delicious aroma,\nbird Pokémon are always after it, but it’s\nnot intelligent enough to care.");
	pchar PokedexDes762[] = _("It bounces around, swinging the sepals\non its head with abandon. They’re\nquite painful when they smack you!");
	pchar PokedexDes763[] = _("A master of grand and beautiful\nkicks, it can knock out even\nkickboxing champions with a single blow.");
	pchar PokedexDes764[] = _("It attaches flowers to its highly nutri-\ntious vine. This revitalizes the flowers,\nand they give off an aromatic scent.");
	pchar PokedexDes765[] = _("It normally spends its time meditating in\nthe treetops. It throws Pok?Balls and\ngives other Pokémon orders as it pleases.");
	pchar PokedexDes766[] = _("They form groups of roughly 20 individuals.\nTheir mutual bond is remarkable they\nwill never let down a comrade.");
	pchar PokedexDes767[] = _("It will pick up anything it finds on the\nground. Sometimes it finds coins, so\nMurkrow and Meowth will go after it.");
	pchar PokedexDes768[] = _("The shell covering its body is as\nhard as diamond. This Pokémon will do\nanything it takes to win.");
	pchar PokedexDes769[] = _("It likes the shovel on its head, so\nSandygast will get serious and fight\nany children who come to take it back.");
	pchar PokedexDes770[] = _("Buried beneath the castle are masses\nof dried-up bones from those whose\nvitality it has drained.");
	pchar PokedexDes771[] = _("Once it has whipped up a sandstorm\nto halt its opponents in their tracks,\nit snatches away their vitality.");
	pchar PokedexDes772[] = _("A Pokémon weapon developed for a\nspecific mission, it went berserk during an\nexperiment, so it was cryogenically frozen.");
	pchar PokedexDes773[] = _("This is its form once it has awakened\nand evolved. Freed from its heavy mask,\nits speed is greatly increased.");
	pchar PokedexDes774[] = _("It lives in the ozone layer, where it\nbecomes food for stronger Pokémon. When it\ntries to run away, it falls to the ground.");
	pchar PokedexDes775[] = _("It stays asleep from the moment it’s\nborn. When it falls into a deep\nsleep, it stops moving altogether.");
	pchar PokedexDes776[] = _("The shell on its back is chemically\nunstable and explodes violently if struck.\nThe hole in its stomach is its weak point.");
	pchar PokedexDes777[] = _("When it’s surprised or agitated, the\n14 fur spikes on its back\nwill stand up involuntarily.");
	pchar PokedexDes778[] = _("A lonely Pokémon, conceals its terrifying\nappearance beneath an old rag so it can\nget closer to people and other Pokémon.");
	pchar PokedexDes779[] = _("Its skin is thick enough to fend off\nMareanie’s spikes. Using robust teeth,\nit crunches up the spikes and eats them.");
	pchar PokedexDes780[] = _("If a child it has made friends with\nis bullied, Drampa will find the bully’s\nhouse and burn it to the ground.");
	pchar PokedexDes781[] = _("It wraps its prey in green seaweed and\nsucks away their vitality. It only likes\nto go after big prey like Wailord.");
	pchar PokedexDes782[] = _("It expresses its feelings by smacking\nits scales. Metallic sounds echo through\nthe tall mountains where Jangmo-o lives.");
	pchar PokedexDes783[] = _("It makes noise by clanging its scales\ntogether. When the rhythm has reached\nits peak, Hakamo-o attacks.");
	pchar PokedexDes784[] = _("When it howls after finishing off its prey,\nthe metallic sounds of its celebrating\ncomrades can be heard from all around.");
	pchar PokedexDes785[] = _("This guardian deity of Melemele is brimming\nwith curiosity. It summons thunderclouds\nand stores lightning inside its body.");
	pchar PokedexDes786[] = _("This guardian deity of Akala is guilelessly\ncruel. The fragrant aroma of flowers is\nthe source of its energy.");
	pchar PokedexDes787[] = _("Although it’s called a guardian deity, it’s\nviolent enough to crush anyone it sees\nas an enemy.");
	pchar PokedexDes788[] = _("Although it’s called a guardian deity,\nterrible calamities sometimes befall those\nwho recklessly approach Tapu Fini.");
	pchar PokedexDes789[] = _("Even though its helpless, gaseous body\ncan be blown away by the slightest\nbreeze, it doesn’t seem to care.");
	pchar PokedexDes790[] = _("The king who ruled Alola in times of\nantiquity called it the cocoon of the\nstars and built an altar to worship it.");
	pchar PokedexDes791[] = _("In writings from the distant past, it’s\ncalled by the name the beast that\ndevours the sun.");
	pchar PokedexDes792[] = _("Records of it exist in writings from long\nago, where it was known by the name\nthe beast that calls the moon.");
	pchar PokedexDes793[] = _("A life-form from another world, it\nwas dubbed a UB and is thought\nto produce a strong neurotoxin.");
	pchar PokedexDes794[] = _("Buzzwole goes around showing off its\nabnormally swollen muscles. It is one\nkind of Ultra Beast.");
	pchar PokedexDes795[] = _("A life-form that lives in another world,\nits body is thin and supple, but\nit also possesses great power.");
	pchar PokedexDes796[] = _("They’ve been dubbed Ultra Beasts. Some of\nthem stand unmoving, like trees, with their\narms and legs stuck into the ground.");
	pchar PokedexDes797[] = _("One of the dangerous UBs, high\nenergy readings can be detected coming\nfrom both of its huge arms.");
	pchar PokedexDes798[] = _("This Ultra Beast’s body, which\nis as thin as paper,\nis like a sharpened sword.");
	pchar PokedexDes799[] = _("An unknown life-form called a UB.\nIt may be constantly hungry it is\ncertainly always devouring something.");
	pchar PokedexDes800[] = _("It looks somehow pained as it rages\naround in search of light, which serves\nas its energy, come from another world.");
	pchar PokedexDes801[] = _("Built roughly 500 years ago by a scientist,\nthe part called the Soul-Heart is\nthe actual life-form.");
	pchar PokedexDes802[] = _("It sinks into the shadows of people and\nPokémon, where it can understand their\nfeelings and copy their capabilities.");
	pchar PokedexDes803[] = _("This Ultra Beast is well enough\nliked to be chosen as a\nfirst partner in its own world.");
	pchar PokedexDes804[] = _("It stores hundreds of liters of poisonous\nliquid inside its body. It is one of the\norganisms known as UBs.");
	pchar PokedexDes805[] = _("It appeared from an Ultra Wormhole. Each\none appears to be made up of many life-\nforms stacked one on top of each other.");
	pchar PokedexDes806[] = _("It slithers toward people and explode\nits head without warning. It is\none kind of Ultra Beast.");
	pchar PokedexDes807[] = _("It approaches its enemies at the speed\nof lightning, then tears them limb from\nlimb with its sharp claws.");
#endif




#if (LANGUAGE == CHINESE)
const struct PokedexData dex_entries_new[] = {
	{.pokemon_type = _("未知"),
	 .height = 0,
	 .weight = 0,
	 .pokedex_description1 = (pchar*)PokedexUnknown,
	},

	{.pokemon_type = _("种子"),
	 .height = 7,
	 .weight = 69,
	 .pokedex_description1 = (pchar*)PokedexDes1,
	},

	{.pokemon_type = _("种子"),
	 .height = 10,
	 .weight = 130,
	 .pokedex_description1 = (pchar*)PokedexDes2,
	},

	{.pokemon_type = _("种子"),
	 .height = 20,
	 .weight = 1000,
	 .pokedex_description1 = (pchar*)PokedexDes3,
	},

	{.pokemon_type = _("蜥蜴"),
	 .height = 6,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes4,
	},

	{.pokemon_type = _("火焰"),
	 .height = 11,
	 .weight = 190,
	 .pokedex_description1 = (pchar*)PokedexDes5,
	},

	{.pokemon_type = _("火焰"),
	 .height = 17,
	 .weight = 905,
	 .pokedex_description1 = (pchar*)PokedexDes6,
	},

	{.pokemon_type = _("小龟"),
	 .height = 5,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes7,
	},

	{.pokemon_type = _("龟"),
	 .height = 10,
	 .weight = 225,
	 .pokedex_description1 = (pchar*)PokedexDes8,
	},

	{.pokemon_type = _("甲壳"),
	 .height = 16,
	 .weight = 855,
	 .pokedex_description1 = (pchar*)PokedexDes9,
	},

	{.pokemon_type = _("虫宝宝"),
	 .height = 3,
	 .weight = 29,
	 .pokedex_description1 = (pchar*)PokedexDes10,
	},

	{.pokemon_type = _("蛹"),
	 .height = 7,
	 .weight = 99,
	 .pokedex_description1 = (pchar*)PokedexDes11,
	},

	{.pokemon_type = _("蝴蝶"),
	 .height = 11,
	 .weight = 320,
	 .pokedex_description1 = (pchar*)PokedexDes12,
	},

	{.pokemon_type = _("毛毛虫"),
	 .height = 3,
	 .weight = 32,
	 .pokedex_description1 = (pchar*)PokedexDes13,
	},

	{.pokemon_type = _("蛹"),
	 .height = 6,
	 .weight = 100,
	 .pokedex_description1 = (pchar*)PokedexDes14,
	},

	{.pokemon_type = _("毒蜂"),
	 .height = 10,
	 .weight = 295,
	 .pokedex_description1 = (pchar*)PokedexDes15,
	},

	{.pokemon_type = _("小鸟"),
	 .height = 3,
	 .weight = 18,
	 .pokedex_description1 = (pchar*)PokedexDes16,
	},

	{.pokemon_type = _("鸟"),
	 .height = 11,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes17,
	},

	{.pokemon_type = _("鸟"),
	 .height = 15,
	 .weight = 395,
	 .pokedex_description1 = (pchar*)PokedexDes18,
	},

	{.pokemon_type = _("鼠"),
	 .height = 3,
	 .weight = 35,
	 .pokedex_description1 = (pchar*)PokedexDes19,
	},

	{.pokemon_type = _("鼠"),
	 .height = 7,
	 .weight = 185,
	 .pokedex_description1 = (pchar*)PokedexDes20,
	},

	{.pokemon_type = _("小鸟"),
	 .height = 3,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes21,
	},

	{.pokemon_type = _("鸟嘴"),
	 .height = 12,
	 .weight = 380,
	 .pokedex_description1 = (pchar*)PokedexDes22,
	},

	{.pokemon_type = _("蛇"),
	 .height = 20,
	 .weight = 69,
	 .pokedex_description1 = (pchar*)PokedexDes23,
	},

	{.pokemon_type = _("眼镜蛇"),
	 .height = 35,
	 .weight = 650,
	 .pokedex_description1 = (pchar*)PokedexDes24,
	},

	{.pokemon_type = _("鼠"),
	 .height = 4,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes25,
	},

	{.pokemon_type = _("鼠"),
	 .height = 8,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes26,
	},

	{.pokemon_type = _("鼠"),
	 .height = 6,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes27,
	},

	{.pokemon_type = _("鼠"),
	 .height = 10,
	 .weight = 295,
	 .pokedex_description1 = (pchar*)PokedexDes28,
	},

	{.pokemon_type = _("毒针"),
	 .height = 4,
	 .weight = 70,
	 .pokedex_description1 = (pchar*)PokedexDes29,
	},

	{.pokemon_type = _("毒针"),
	 .height = 8,
	 .weight = 200,
	 .pokedex_description1 = (pchar*)PokedexDes30,
	},

	{.pokemon_type = _("钻锥"),
	 .height = 13,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes31,
	},

	{.pokemon_type = _("毒针"),
	 .height = 5,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes32,
	},

	{.pokemon_type = _("毒针"),
	 .height = 9,
	 .weight = 195,
	 .pokedex_description1 = (pchar*)PokedexDes33,
	},

	{.pokemon_type = _("钻锥"),
	 .height = 14,
	 .weight = 620,
	 .pokedex_description1 = (pchar*)PokedexDes34,
	},

	{.pokemon_type = _("妖精"),
	 .height = 6,
	 .weight = 75,
	 .pokedex_description1 = (pchar*)PokedexDes35,
	},

	{.pokemon_type = _("妖精"),
	 .height = 13,
	 .weight = 400,
	 .pokedex_description1 = (pchar*)PokedexDes36,
	},

	{.pokemon_type = _("狐狸"),
	 .height = 6,
	 .weight = 99,
	 .pokedex_description1 = (pchar*)PokedexDes37,
	},

	{.pokemon_type = _("狐狸"),
	 .height = 11,
	 .weight = 199,
	 .pokedex_description1 = (pchar*)PokedexDes38,
	},

	{.pokemon_type = _("气球"),
	 .height = 5,
	 .weight = 55,
	 .pokedex_description1 = (pchar*)PokedexDes39,
	},

	{.pokemon_type = _("气球"),
	 .height = 10,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes40,
	},

	{.pokemon_type = _("蝙蝠"),
	 .height = 8,
	 .weight = 75,
	 .pokedex_description1 = (pchar*)PokedexDes41,
	},

	{.pokemon_type = _("蝙蝠"),
	 .height = 16,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes42,
	},

	{.pokemon_type = _("杂草"),
	 .height = 5,
	 .weight = 54,
	 .pokedex_description1 = (pchar*)PokedexDes43,
	},

	{.pokemon_type = _("杂草"),
	 .height = 8,
	 .weight = 86,
	 .pokedex_description1 = (pchar*)PokedexDes44,
	},

	{.pokemon_type = _("花"),
	 .height = 12,
	 .weight = 186,
	 .pokedex_description1 = (pchar*)PokedexDes45,
	},

	{.pokemon_type = _("蘑菇"),
	 .height = 3,
	 .weight = 54,
	 .pokedex_description1 = (pchar*)PokedexDes46,
	},

	{.pokemon_type = _("蘑菇"),
	 .height = 10,
	 .weight = 295,
	 .pokedex_description1 = (pchar*)PokedexDes47,
	},

	{.pokemon_type = _("昆虫"),
	 .height = 10,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes48,
	},

	{.pokemon_type = _("毒蛾"),
	 .height = 15,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes49,
	},

	{.pokemon_type = _("鼹鼠"),
	 .height = 2,
	 .weight = 8,
	 .pokedex_description1 = (pchar*)PokedexDes50,
	},

	{.pokemon_type = _("鼹鼠"),
	 .height = 7,
	 .weight = 333,
	 .pokedex_description1 = (pchar*)PokedexDes51,
	},

	{.pokemon_type = _("妖怪猫"),
	 .height = 4,
	 .weight = 42,
	 .pokedex_description1 = (pchar*)PokedexDes52,
	},

	{.pokemon_type = _("暹罗猫"),
	 .height = 10,
	 .weight = 320,
	 .pokedex_description1 = (pchar*)PokedexDes53,
	},

	{.pokemon_type = _("鸭"),
	 .height = 8,
	 .weight = 196,
	 .pokedex_description1 = (pchar*)PokedexDes54,
	},

	{.pokemon_type = _("鸭"),
	 .height = 17,
	 .weight = 766,
	 .pokedex_description1 = (pchar*)PokedexDes55,
	},

	{.pokemon_type = _("猪猴"),
	 .height = 5,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes56,
	},

	{.pokemon_type = _("猪猴"),
	 .height = 10,
	 .weight = 320,
	 .pokedex_description1 = (pchar*)PokedexDes57,
	},

	{.pokemon_type = _("小狗"),
	 .height = 7,
	 .weight = 190,
	 .pokedex_description1 = (pchar*)PokedexDes58,
	},

	{.pokemon_type = _("传说"),
	 .height = 19,
	 .weight = 1550,
	 .pokedex_description1 = (pchar*)PokedexDes59,
	},

	{.pokemon_type = _("蝌蚪"),
	 .height = 6,
	 .weight = 124,
	 .pokedex_description1 = (pchar*)PokedexDes60,
	},

	{.pokemon_type = _("蝌蚪"),
	 .height = 10,
	 .weight = 200,
	 .pokedex_description1 = (pchar*)PokedexDes61,
	},

	{.pokemon_type = _("蝌蚪"),
	 .height = 13,
	 .weight = 540,
	 .pokedex_description1 = (pchar*)PokedexDes62,
	},

	{.pokemon_type = _("念力"),
	 .height = 9,
	 .weight = 195,
	 .pokedex_description1 = (pchar*)PokedexDes63,
	},

	{.pokemon_type = _("念力"),
	 .height = 13,
	 .weight = 565,
	 .pokedex_description1 = (pchar*)PokedexDes64,
	},

	{.pokemon_type = _("念力"),
	 .height = 15,
	 .weight = 480,
	 .pokedex_description1 = (pchar*)PokedexDes65,
	},

	{.pokemon_type = _("怪力"),
	 .height = 8,
	 .weight = 195,
	 .pokedex_description1 = (pchar*)PokedexDes66,
	},

	{.pokemon_type = _("怪力"),
	 .height = 15,
	 .weight = 705,
	 .pokedex_description1 = (pchar*)PokedexDes67,
	},

	{.pokemon_type = _("怪力"),
	 .height = 16,
	 .weight = 1300,
	 .pokedex_description1 = (pchar*)PokedexDes68,
	},

	{.pokemon_type = _("花"),
	 .height = 7,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes69,
	},

	{.pokemon_type = _("捕蝇"),
	 .height = 10,
	 .weight = 64,
	 .pokedex_description1 = (pchar*)PokedexDes70,
	},

	{.pokemon_type = _("捕蝇"),
	 .height = 17,
	 .weight = 155,
	 .pokedex_description1 = (pchar*)PokedexDes71,
	},

	{.pokemon_type = _("水母"),
	 .height = 9,
	 .weight = 455,
	 .pokedex_description1 = (pchar*)PokedexDes72,
	},

	{.pokemon_type = _("水母"),
	 .height = 16,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes73,
	},

	{.pokemon_type = _("岩石"),
	 .height = 4,
	 .weight = 200,
	 .pokedex_description1 = (pchar*)PokedexDes74,
	},

	{.pokemon_type = _("岩石"),
	 .height = 10,
	 .weight = 1050,
	 .pokedex_description1 = (pchar*)PokedexDes75,
	},

	{.pokemon_type = _("重量级"),
	 .height = 14,
	 .weight = 3000,
	 .pokedex_description1 = (pchar*)PokedexDes76,
	},

	{.pokemon_type = _("火马"),
	 .height = 10,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes77,
	},

	{.pokemon_type = _("火马"),
	 .height = 17,
	 .weight = 950,
	 .pokedex_description1 = (pchar*)PokedexDes78,
	},

	{.pokemon_type = _("憨憨"),
	 .height = 12,
	 .weight = 360,
	 .pokedex_description1 = (pchar*)PokedexDes79,
	},

	{.pokemon_type = _("寄居蟹"),
	 .height = 16,
	 .weight = 785,
	 .pokedex_description1 = (pchar*)PokedexDes80,
	},

	{.pokemon_type = _("磁铁"),
	 .height = 3,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes81,
	},

	{.pokemon_type = _("磁铁"),
	 .height = 10,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes82,
	},

	{.pokemon_type = _("黄嘴鸭"),
	 .height = 8,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes83,
	},

	{.pokemon_type = _("两头鸟"),
	 .height = 14,
	 .weight = 392,
	 .pokedex_description1 = (pchar*)PokedexDes84,
	},

	{.pokemon_type = _("三头鸟"),
	 .height = 18,
	 .weight = 852,
	 .pokedex_description1 = (pchar*)PokedexDes85,
	},

	{.pokemon_type = _("海狮"),
	 .height = 11,
	 .weight = 900,
	 .pokedex_description1 = (pchar*)PokedexDes86,
	},

	{.pokemon_type = _("海狮"),
	 .height = 17,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes87,
	},

	{.pokemon_type = _("污泥"),
	 .height = 9,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes88,
	},

	{.pokemon_type = _("污泥"),
	 .height = 12,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes89,
	},

	{.pokemon_type = _("双壳贝"),
	 .height = 3,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes90,
	},

	{.pokemon_type = _("双壳贝"),
	 .height = 15,
	 .weight = 1325,
	 .pokedex_description1 = (pchar*)PokedexDes91,
	},

	{.pokemon_type = _("气体状"),
	 .height = 13,
	 .weight = 1,
	 .pokedex_description1 = (pchar*)PokedexDes92,
	},

	{.pokemon_type = _("气体状"),
	 .height = 16,
	 .weight = 1,
	 .pokedex_description1 = (pchar*)PokedexDes93,
	},

	{.pokemon_type = _("影子"),
	 .height = 15,
	 .weight = 405,
	 .pokedex_description1 = (pchar*)PokedexDes94,
	},

	{.pokemon_type = _("岩蛇"),
	 .height = 88,
	 .weight = 2100,
	 .pokedex_description1 = (pchar*)PokedexDes95,
	},

	{.pokemon_type = _("催眠"),
	 .height = 10,
	 .weight = 324,
	 .pokedex_description1 = (pchar*)PokedexDes96,
	},

	{.pokemon_type = _("催眠"),
	 .height = 16,
	 .weight = 756,
	 .pokedex_description1 = (pchar*)PokedexDes97,
	},

	{.pokemon_type = _("清水蟹"),
	 .height = 4,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes98,
	},

	{.pokemon_type = _("钳子"),
	 .height = 13,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes99,
	},

	{.pokemon_type = _("球"),
	 .height = 5,
	 .weight = 104,
	 .pokedex_description1 = (pchar*)PokedexDes100,
	},

	{.pokemon_type = _("球"),
	 .height = 12,
	 .weight = 666,
	 .pokedex_description1 = (pchar*)PokedexDes101,
	},

	{.pokemon_type = _("蛋"),
	 .height = 4,
	 .weight = 25,
	 .pokedex_description1 = (pchar*)PokedexDes102,
	},

	{.pokemon_type = _("椰子"),
	 .height = 20,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes103,
	},

	{.pokemon_type = _("孤独"),
	 .height = 4,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes104,
	},

	{.pokemon_type = _("爱骨"),
	 .height = 10,
	 .weight = 450,
	 .pokedex_description1 = (pchar*)PokedexDes105,
	},

	{.pokemon_type = _("踢腿"),
	 .height = 15,
	 .weight = 498,
	 .pokedex_description1 = (pchar*)PokedexDes106,
	},

	{.pokemon_type = _("拳击"),
	 .height = 14,
	 .weight = 502,
	 .pokedex_description1 = (pchar*)PokedexDes107,
	},

	{.pokemon_type = _("舔舔"),
	 .height = 12,
	 .weight = 655,
	 .pokedex_description1 = (pchar*)PokedexDes108,
	},

	{.pokemon_type = _("毒气"),
	 .height = 6,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes109,
	},

	{.pokemon_type = _("毒气"),
	 .height = 12,
	 .weight = 95,
	 .pokedex_description1 = (pchar*)PokedexDes110,
	},

	{.pokemon_type = _("尖尖"),
	 .height = 10,
	 .weight = 1150,
	 .pokedex_description1 = (pchar*)PokedexDes111,
	},

	{.pokemon_type = _("钻锥"),
	 .height = 19,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes112,
	},

	{.pokemon_type = _("蛋"),
	 .height = 11,
	 .weight = 346,
	 .pokedex_description1 = (pchar*)PokedexDes113,
	},

	{.pokemon_type = _("藤蔓状"),
	 .height = 10,
	 .weight = 350,
	 .pokedex_description1 = (pchar*)PokedexDes114,
	},

	{.pokemon_type = _("亲子"),
	 .height = 22,
	 .weight = 800,
	 .pokedex_description1 = (pchar*)PokedexDes115,
	},

	{.pokemon_type = _("龙"),
	 .height = 4,
	 .weight = 80,
	 .pokedex_description1 = (pchar*)PokedexDes116,
	},

	{.pokemon_type = _("龙"),
	 .height = 12,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes117,
	},

	{.pokemon_type = _("金鱼"),
	 .height = 6,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes118,
	},

	{.pokemon_type = _("金鱼"),
	 .height = 13,
	 .weight = 390,
	 .pokedex_description1 = (pchar*)PokedexDes119,
	},

	{.pokemon_type = _("星形"),
	 .height = 8,
	 .weight = 345,
	 .pokedex_description1 = (pchar*)PokedexDes120,
	},

	{.pokemon_type = _("谜"),
	 .height = 11,
	 .weight = 800,
	 .pokedex_description1 = (pchar*)PokedexDes121,
	},

	{.pokemon_type = _("屏障"),
	 .height = 13,
	 .weight = 545,
	 .pokedex_description1 = (pchar*)PokedexDes122,
	},

	{.pokemon_type = _("螳螂"),
	 .height = 15,
	 .weight = 560,
	 .pokedex_description1 = (pchar*)PokedexDes123,
	},

	{.pokemon_type = _("人形"),
	 .height = 14,
	 .weight = 406,
	 .pokedex_description1 = (pchar*)PokedexDes124,
	},

	{.pokemon_type = _("电击"),
	 .height = 11,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes125,
	},

	{.pokemon_type = _("吐火"),
	 .height = 13,
	 .weight = 445,
	 .pokedex_description1 = (pchar*)PokedexDes126,
	},

	{.pokemon_type = _("锹形虫"),
	 .height = 15,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes127,
	},

	{.pokemon_type = _("暴牛"),
	 .height = 14,
	 .weight = 884,
	 .pokedex_description1 = (pchar*)PokedexDes128,
	},

	{.pokemon_type = _("鱼"),
	 .height = 9,
	 .weight = 100,
	 .pokedex_description1 = (pchar*)PokedexDes129,
	},

	{.pokemon_type = _("凶恶"),
	 .height = 65,
	 .weight = 2350,
	 .pokedex_description1 = (pchar*)PokedexDes130,
	},

	{.pokemon_type = _("乘载"),
	 .height = 25,
	 .weight = 2200,
	 .pokedex_description1 = (pchar*)PokedexDes131,
	},

	{.pokemon_type = _("变身"),
	 .height = 3,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes132,
	},

	{.pokemon_type = _("进化"),
	 .height = 3,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes133,
	},

	{.pokemon_type = _("吐泡"),
	 .height = 10,
	 .weight = 290,
	 .pokedex_description1 = (pchar*)PokedexDes134,
	},

	{.pokemon_type = _("雷"),
	 .height = 8,
	 .weight = 245,
	 .pokedex_description1 = (pchar*)PokedexDes135,
	},

	{.pokemon_type = _("火"),
	 .height = 9,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes136,
	},

	{.pokemon_type = _("虚拟"),
	 .height = 8,
	 .weight = 365,
	 .pokedex_description1 = (pchar*)PokedexDes137,
	},

	{.pokemon_type = _("漩涡"),
	 .height = 4,
	 .weight = 75,
	 .pokedex_description1 = (pchar*)PokedexDes138,
	},

	{.pokemon_type = _("漩涡"),
	 .height = 10,
	 .weight = 350,
	 .pokedex_description1 = (pchar*)PokedexDes139,
	},

	{.pokemon_type = _("甲壳"),
	 .height = 5,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes140,
	},

	{.pokemon_type = _("甲壳"),
	 .height = 13,
	 .weight = 405,
	 .pokedex_description1 = (pchar*)PokedexDes141,
	},

	{.pokemon_type = _("化石"),
	 .height = 18,
	 .weight = 590,
	 .pokedex_description1 = (pchar*)PokedexDes142,
	},

	{.pokemon_type = _("瞌睡"),
	 .height = 21,
	 .weight = 4600,
	 .pokedex_description1 = (pchar*)PokedexDes143,
	},

	{.pokemon_type = _("冰冻"),
	 .height = 17,
	 .weight = 554,
	 .pokedex_description1 = (pchar*)PokedexDes144,
	},

	{.pokemon_type = _("电击"),
	 .height = 16,
	 .weight = 526,
	 .pokedex_description1 = (pchar*)PokedexDes145,
	},

	{.pokemon_type = _("火焰"),
	 .height = 20,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes146,
	},

	{.pokemon_type = _("龙"),
	 .height = 18,
	 .weight = 33,
	 .pokedex_description1 = (pchar*)PokedexDes147,
	},

	{.pokemon_type = _("龙"),
	 .height = 40,
	 .weight = 165,
	 .pokedex_description1 = (pchar*)PokedexDes148,
	},

	{.pokemon_type = _("龙"),
	 .height = 22,
	 .weight = 2100,
	 .pokedex_description1 = (pchar*)PokedexDes149,
	},

	{.pokemon_type = _("基因"),
	 .height = 20,
	 .weight = 1220,
	 .pokedex_description1 = (pchar*)PokedexDes150,
	},

	{.pokemon_type = _("新种"),
	 .height = 4,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes151,
	},

	{.pokemon_type = _("叶子"),
	 .height = 9,
	 .weight = 64,
	 .pokedex_description1 = (pchar*)PokedexDes152,
	},

	{.pokemon_type = _("叶子"),
	 .height = 12,
	 .weight = 158,
	 .pokedex_description1 = (pchar*)PokedexDes153,
	},

	{.pokemon_type = _("芳草"),
	 .height = 18,
	 .weight = 1005,
	 .pokedex_description1 = (pchar*)PokedexDes154,
	},

	{.pokemon_type = _("火鼠"),
	 .height = 5,
	 .weight = 79,
	 .pokedex_description1 = (pchar*)PokedexDes155,
	},

	{.pokemon_type = _("火山"),
	 .height = 9,
	 .weight = 190,
	 .pokedex_description1 = (pchar*)PokedexDes156,
	},

	{.pokemon_type = _("火山"),
	 .height = 17,
	 .weight = 795,
	 .pokedex_description1 = (pchar*)PokedexDes157,
	},

	{.pokemon_type = _("大颚"),
	 .height = 6,
	 .weight = 95,
	 .pokedex_description1 = (pchar*)PokedexDes158,
	},

	{.pokemon_type = _("大颚"),
	 .height = 11,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes159,
	},

	{.pokemon_type = _("大颚"),
	 .height = 23,
	 .weight = 888,
	 .pokedex_description1 = (pchar*)PokedexDes160,
	},

	{.pokemon_type = _("放哨"),
	 .height = 8,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes161,
	},

	{.pokemon_type = _("长躯干"),
	 .height = 18,
	 .weight = 325,
	 .pokedex_description1 = (pchar*)PokedexDes162,
	},

	{.pokemon_type = _("猫头鹰"),
	 .height = 7,
	 .weight = 212,
	 .pokedex_description1 = (pchar*)PokedexDes163,
	},

	{.pokemon_type = _("猫头鹰"),
	 .height = 16,
	 .weight = 408,
	 .pokedex_description1 = (pchar*)PokedexDes164,
	},

	{.pokemon_type = _("五星"),
	 .height = 10,
	 .weight = 108,
	 .pokedex_description1 = (pchar*)PokedexDes165,
	},

	{.pokemon_type = _("五星"),
	 .height = 14,
	 .weight = 356,
	 .pokedex_description1 = (pchar*)PokedexDes166,
	},

	{.pokemon_type = _("吐丝"),
	 .height = 5,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes167,
	},

	{.pokemon_type = _("长腿"),
	 .height = 11,
	 .weight = 335,
	 .pokedex_description1 = (pchar*)PokedexDes168,
	},

	{.pokemon_type = _("蝙蝠"),
	 .height = 18,
	 .weight = 750,
	 .pokedex_description1 = (pchar*)PokedexDes169,
	},

	{.pokemon_type = _("琵琶鱼"),
	 .height = 5,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes170,
	},

	{.pokemon_type = _("灯"),
	 .height = 12,
	 .weight = 225,
	 .pokedex_description1 = (pchar*)PokedexDes171,
	},

	{.pokemon_type = _("小鼠"),
	 .height = 3,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes172,
	},

	{.pokemon_type = _("星形"),
	 .height = 3,
	 .weight = 30,
	 .pokedex_description1 = (pchar*)PokedexDes173,
	},

	{.pokemon_type = _("气球"),
	 .height = 3,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes174,
	},

	{.pokemon_type = _("针球"),
	 .height = 3,
	 .weight = 15,
	 .pokedex_description1 = (pchar*)PokedexDes175,
	},

	{.pokemon_type = _("幸福"),
	 .height = 6,
	 .weight = 32,
	 .pokedex_description1 = (pchar*)PokedexDes176,
	},

	{.pokemon_type = _("小鸟"),
	 .height = 2,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes177,
	},

	{.pokemon_type = _("神秘"),
	 .height = 15,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes178,
	},

	{.pokemon_type = _("绵毛"),
	 .height = 6,
	 .weight = 78,
	 .pokedex_description1 = (pchar*)PokedexDes179,
	},

	{.pokemon_type = _("绵毛"),
	 .height = 8,
	 .weight = 133,
	 .pokedex_description1 = (pchar*)PokedexDes180,
	},

	{.pokemon_type = _("灯"),
	 .height = 14,
	 .weight = 615,
	 .pokedex_description1 = (pchar*)PokedexDes181,
	},

	{.pokemon_type = _("花"),
	 .height = 4,
	 .weight = 58,
	 .pokedex_description1 = (pchar*)PokedexDes182,
	},

	{.pokemon_type = _("水鼠"),
	 .height = 4,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes183,
	},

	{.pokemon_type = _("水兔"),
	 .height = 8,
	 .weight = 285,
	 .pokedex_description1 = (pchar*)PokedexDes184,
	},

	{.pokemon_type = _("模仿"),
	 .height = 12,
	 .weight = 380,
	 .pokedex_description1 = (pchar*)PokedexDes185,
	},

	{.pokemon_type = _("蛙"),
	 .height = 11,
	 .weight = 339,
	 .pokedex_description1 = (pchar*)PokedexDes186,
	},

	{.pokemon_type = _("棉草"),
	 .height = 4,
	 .weight = 5,
	 .pokedex_description1 = (pchar*)PokedexDes187,
	},

	{.pokemon_type = _("棉草"),
	 .height = 6,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes188,
	},

	{.pokemon_type = _("棉草"),
	 .height = 8,
	 .weight = 30,
	 .pokedex_description1 = (pchar*)PokedexDes189,
	},

	{.pokemon_type = _("长尾"),
	 .height = 8,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes190,
	},

	{.pokemon_type = _("种子"),
	 .height = 3,
	 .weight = 18,
	 .pokedex_description1 = (pchar*)PokedexDes191,
	},

	{.pokemon_type = _("太阳"),
	 .height = 8,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes192,
	},

	{.pokemon_type = _("薄翼"),
	 .height = 12,
	 .weight = 380,
	 .pokedex_description1 = (pchar*)PokedexDes193,
	},

	{.pokemon_type = _("水鱼"),
	 .height = 4,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes194,
	},

	{.pokemon_type = _("水鱼"),
	 .height = 14,
	 .weight = 750,
	 .pokedex_description1 = (pchar*)PokedexDes195,
	},

	{.pokemon_type = _("太阳"),
	 .height = 9,
	 .weight = 265,
	 .pokedex_description1 = (pchar*)PokedexDes196,
	},

	{.pokemon_type = _("月光"),
	 .height = 10,
	 .weight = 270,
	 .pokedex_description1 = (pchar*)PokedexDes197,
	},

	{.pokemon_type = _("黑暗"),
	 .height = 5,
	 .weight = 21,
	 .pokedex_description1 = (pchar*)PokedexDes198,
	},

	{.pokemon_type = _("王者"),
	 .height = 20,
	 .weight = 795,
	 .pokedex_description1 = (pchar*)PokedexDes199,
	},

	{.pokemon_type = _("夜啼"),
	 .height = 7,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes200,
	},

	{.pokemon_type = _("象征"),
	 .height = 5,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes201,
	},

	{.pokemon_type = _("忍耐"),
	 .height = 13,
	 .weight = 285,
	 .pokedex_description1 = (pchar*)PokedexDes202,
	},

	{.pokemon_type = _("长颈"),
	 .height = 15,
	 .weight = 415,
	 .pokedex_description1 = (pchar*)PokedexDes203,
	},

	{.pokemon_type = _("蓑衣虫"),
	 .height = 6,
	 .weight = 72,
	 .pokedex_description1 = (pchar*)PokedexDes204,
	},

	{.pokemon_type = _("蓑衣虫"),
	 .height = 12,
	 .weight = 1258,
	 .pokedex_description1 = (pchar*)PokedexDes205,
	},

	{.pokemon_type = _("地蛇"),
	 .height = 15,
	 .weight = 140,
	 .pokedex_description1 = (pchar*)PokedexDes206,
	},

	{.pokemon_type = _("飞蝎"),
	 .height = 11,
	 .weight = 648,
	 .pokedex_description1 = (pchar*)PokedexDes207,
	},

	{.pokemon_type = _("铁蛇"),
	 .height = 92,
	 .weight = 4000,
	 .pokedex_description1 = (pchar*)PokedexDes208,
	},

	{.pokemon_type = _("妖精"),
	 .height = 6,
	 .weight = 78,
	 .pokedex_description1 = (pchar*)PokedexDes209,
	},

	{.pokemon_type = _("妖精"),
	 .height = 14,
	 .weight = 487,
	 .pokedex_description1 = (pchar*)PokedexDes210,
	},

	{.pokemon_type = _("气球"),
	 .height = 5,
	 .weight = 39,
	 .pokedex_description1 = (pchar*)PokedexDes211,
	},

	{.pokemon_type = _("钳子"),
	 .height = 18,
	 .weight = 1180,
	 .pokedex_description1 = (pchar*)PokedexDes212,
	},

	{.pokemon_type = _("发酵"),
	 .height = 6,
	 .weight = 205,
	 .pokedex_description1 = (pchar*)PokedexDes213,
	},

	{.pokemon_type = _("独角"),
	 .height = 15,
	 .weight = 540,
	 .pokedex_description1 = (pchar*)PokedexDes214,
	},

	{.pokemon_type = _("钩爪"),
	 .height = 9,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes215,
	},

	{.pokemon_type = _("小熊"),
	 .height = 6,
	 .weight = 88,
	 .pokedex_description1 = (pchar*)PokedexDes216,
	},

	{.pokemon_type = _("冬眠"),
	 .height = 18,
	 .weight = 1258,
	 .pokedex_description1 = (pchar*)PokedexDes217,
	},

	{.pokemon_type = _("熔岩"),
	 .height = 7,
	 .weight = 350,
	 .pokedex_description1 = (pchar*)PokedexDes218,
	},

	{.pokemon_type = _("熔岩"),
	 .height = 8,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes219,
	},

	{.pokemon_type = _("小猪"),
	 .height = 4,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes220,
	},

	{.pokemon_type = _("野猪"),
	 .height = 11,
	 .weight = 558,
	 .pokedex_description1 = (pchar*)PokedexDes221,
	},

	{.pokemon_type = _("珊瑚"),
	 .height = 6,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes222,
	},

	{.pokemon_type = _("喷射"),
	 .height = 6,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes223,
	},

	{.pokemon_type = _("喷射"),
	 .height = 9,
	 .weight = 285,
	 .pokedex_description1 = (pchar*)PokedexDes224,
	},

	{.pokemon_type = _("搬运"),
	 .height = 9,
	 .weight = 160,
	 .pokedex_description1 = (pchar*)PokedexDes225,
	},

	{.pokemon_type = _("风筝"),
	 .height = 21,
	 .weight = 2200,
	 .pokedex_description1 = (pchar*)PokedexDes226,
	},

	{.pokemon_type = _("钢甲鸟"),
	 .height = 17,
	 .weight = 505,
	 .pokedex_description1 = (pchar*)PokedexDes227,
	},

	{.pokemon_type = _("阴暗"),
	 .height = 6,
	 .weight = 108,
	 .pokedex_description1 = (pchar*)PokedexDes228,
	},

	{.pokemon_type = _("阴暗"),
	 .height = 14,
	 .weight = 350,
	 .pokedex_description1 = (pchar*)PokedexDes229,
	},

	{.pokemon_type = _("龙"),
	 .height = 18,
	 .weight = 1520,
	 .pokedex_description1 = (pchar*)PokedexDes230,
	},

	{.pokemon_type = _("长鼻"),
	 .height = 5,
	 .weight = 335,
	 .pokedex_description1 = (pchar*)PokedexDes231,
	},

	{.pokemon_type = _("铠甲"),
	 .height = 11,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes232,
	},

	{.pokemon_type = _("虚拟"),
	 .height = 6,
	 .weight = 325,
	 .pokedex_description1 = (pchar*)PokedexDes233,
	},

	{.pokemon_type = _("大角"),
	 .height = 14,
	 .weight = 712,
	 .pokedex_description1 = (pchar*)PokedexDes234,
	},

	{.pokemon_type = _("画画"),
	 .height = 12,
	 .weight = 580,
	 .pokedex_description1 = (pchar*)PokedexDes235,
	},

	{.pokemon_type = _("打斗"),
	 .height = 7,
	 .weight = 210,
	 .pokedex_description1 = (pchar*)PokedexDes236,
	},

	{.pokemon_type = _("倒立"),
	 .height = 14,
	 .weight = 480,
	 .pokedex_description1 = (pchar*)PokedexDes237,
	},

	{.pokemon_type = _("亲吻"),
	 .height = 4,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes238,
	},

	{.pokemon_type = _("电气"),
	 .height = 6,
	 .weight = 235,
	 .pokedex_description1 = (pchar*)PokedexDes239,
	},

	{.pokemon_type = _("火种"),
	 .height = 7,
	 .weight = 214,
	 .pokedex_description1 = (pchar*)PokedexDes240,
	},

	{.pokemon_type = _("奶牛"),
	 .height = 12,
	 .weight = 755,
	 .pokedex_description1 = (pchar*)PokedexDes241,
	},

	{.pokemon_type = _("幸福"),
	 .height = 15,
	 .weight = 468,
	 .pokedex_description1 = (pchar*)PokedexDes242,
	},

	{.pokemon_type = _("天雷"),
	 .height = 19,
	 .weight = 1780,
	 .pokedex_description1 = (pchar*)PokedexDes243,
	},

	{.pokemon_type = _("火山"),
	 .height = 21,
	 .weight = 1980,
	 .pokedex_description1 = (pchar*)PokedexDes244,
	},

	{.pokemon_type = _("极光"),
	 .height = 20,
	 .weight = 1870,
	 .pokedex_description1 = (pchar*)PokedexDes245,
	},

	{.pokemon_type = _("岩石肤"),
	 .height = 6,
	 .weight = 720,
	 .pokedex_description1 = (pchar*)PokedexDes246,
	},

	{.pokemon_type = _("子弹"),
	 .height = 12,
	 .weight = 1520,
	 .pokedex_description1 = (pchar*)PokedexDes247,
	},

	{.pokemon_type = _("铠甲"),
	 .height = 20,
	 .weight = 2020,
	 .pokedex_description1 = (pchar*)PokedexDes248,
	},

	{.pokemon_type = _("潜水"),
	 .height = 52,
	 .weight = 2160,
	 .pokedex_description1 = (pchar*)PokedexDes249,
	},

	{.pokemon_type = _("虹色"),
	 .height = 38,
	 .weight = 1990,
	 .pokedex_description1 = (pchar*)PokedexDes250,
	},

	{.pokemon_type = _("时空穿越"),
	 .height = 6,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes251,
	},

	{.pokemon_type = _("林蜥"),
	 .height = 5,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes252,
	},

	{.pokemon_type = _("林蜥"),
	 .height = 9,
	 .weight = 216,
	 .pokedex_description1 = (pchar*)PokedexDes253,
	},

	{.pokemon_type = _("密林"),
	 .height = 17,
	 .weight = 522,
	 .pokedex_description1 = (pchar*)PokedexDes254,
	},

	{.pokemon_type = _("雏鸡"),
	 .height = 4,
	 .weight = 25,
	 .pokedex_description1 = (pchar*)PokedexDes255,
	},

	{.pokemon_type = _("幼鸡"),
	 .height = 9,
	 .weight = 195,
	 .pokedex_description1 = (pchar*)PokedexDes256,
	},

	{.pokemon_type = _("猛火"),
	 .height = 19,
	 .weight = 520,
	 .pokedex_description1 = (pchar*)PokedexDes257,
	},

	{.pokemon_type = _("沼鱼"),
	 .height = 4,
	 .weight = 76,
	 .pokedex_description1 = (pchar*)PokedexDes258,
	},

	{.pokemon_type = _("沼鱼"),
	 .height = 7,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes259,
	},

	{.pokemon_type = _("沼鱼"),
	 .height = 15,
	 .weight = 819,
	 .pokedex_description1 = (pchar*)PokedexDes260,
	},

	{.pokemon_type = _("紧咬"),
	 .height = 5,
	 .weight = 136,
	 .pokedex_description1 = (pchar*)PokedexDes261,
	},

	{.pokemon_type = _("紧咬"),
	 .height = 10,
	 .weight = 370,
	 .pokedex_description1 = (pchar*)PokedexDes262,
	},

	{.pokemon_type = _("豆狸"),
	 .height = 4,
	 .weight = 175,
	 .pokedex_description1 = (pchar*)PokedexDes263,
	},

	{.pokemon_type = _("猛冲"),
	 .height = 5,
	 .weight = 325,
	 .pokedex_description1 = (pchar*)PokedexDes264,
	},

	{.pokemon_type = _("虫宝宝"),
	 .height = 3,
	 .weight = 36,
	 .pokedex_description1 = (pchar*)PokedexDes265,
	},

	{.pokemon_type = _("蛹"),
	 .height = 6,
	 .weight = 100,
	 .pokedex_description1 = (pchar*)PokedexDes266,
	},

	{.pokemon_type = _("蝴蝶"),
	 .height = 10,
	 .weight = 284,
	 .pokedex_description1 = (pchar*)PokedexDes267,
	},

	{.pokemon_type = _("蛹"),
	 .height = 7,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes268,
	},

	{.pokemon_type = _("毒蛾"),
	 .height = 12,
	 .weight = 316,
	 .pokedex_description1 = (pchar*)PokedexDes269,
	},

	{.pokemon_type = _("浮萍"),
	 .height = 5,
	 .weight = 26,
	 .pokedex_description1 = (pchar*)PokedexDes270,
	},

	{.pokemon_type = _("爽朗"),
	 .height = 12,
	 .weight = 325,
	 .pokedex_description1 = (pchar*)PokedexDes271,
	},

	{.pokemon_type = _("乐天"),
	 .height = 15,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes272,
	},

	{.pokemon_type = _("橡实"),
	 .height = 5,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes273,
	},

	{.pokemon_type = _("捉弄"),
	 .height = 10,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes274,
	},

	{.pokemon_type = _("邪恶"),
	 .height = 13,
	 .weight = 596,
	 .pokedex_description1 = (pchar*)PokedexDes275,
	},

	{.pokemon_type = _("幼燕"),
	 .height = 3,
	 .weight = 23,
	 .pokedex_description1 = (pchar*)PokedexDes276,
	},

	{.pokemon_type = _("燕子"),
	 .height = 7,
	 .weight = 198,
	 .pokedex_description1 = (pchar*)PokedexDes277,
	},

	{.pokemon_type = _("海鸥"),
	 .height = 6,
	 .weight = 95,
	 .pokedex_description1 = (pchar*)PokedexDes278,
	},

	{.pokemon_type = _("水鸟"),
	 .height = 12,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes279,
	},

	{.pokemon_type = _("心情"),
	 .height = 4,
	 .weight = 66,
	 .pokedex_description1 = (pchar*)PokedexDes280,
	},

	{.pokemon_type = _("感情"),
	 .height = 8,
	 .weight = 202,
	 .pokedex_description1 = (pchar*)PokedexDes281,
	},

	{.pokemon_type = _("包容"),
	 .height = 16,
	 .weight = 484,
	 .pokedex_description1 = (pchar*)PokedexDes282,
	},

	{.pokemon_type = _("水黾"),
	 .height = 5,
	 .weight = 17,
	 .pokedex_description1 = (pchar*)PokedexDes283,
	},

	{.pokemon_type = _("眼珠"),
	 .height = 8,
	 .weight = 36,
	 .pokedex_description1 = (pchar*)PokedexDes284,
	},

	{.pokemon_type = _("蘑菇"),
	 .height = 4,
	 .weight = 45,
	 .pokedex_description1 = (pchar*)PokedexDes285,
	},

	{.pokemon_type = _("蘑菇"),
	 .height = 12,
	 .weight = 392,
	 .pokedex_description1 = (pchar*)PokedexDes286,
	},

	{.pokemon_type = _("懒人"),
	 .height = 8,
	 .weight = 240,
	 .pokedex_description1 = (pchar*)PokedexDes287,
	},

	{.pokemon_type = _("暴猿"),
	 .height = 14,
	 .weight = 465,
	 .pokedex_description1 = (pchar*)PokedexDes288,
	},

	{.pokemon_type = _("怕麻烦"),
	 .height = 20,
	 .weight = 1305,
	 .pokedex_description1 = (pchar*)PokedexDes289,
	},

	{.pokemon_type = _("入门"),
	 .height = 5,
	 .weight = 55,
	 .pokedex_description1 = (pchar*)PokedexDes290,
	},

	{.pokemon_type = _("忍者"),
	 .height = 8,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes291,
	},

	{.pokemon_type = _("空壳"),
	 .height = 8,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes292,
	},

	{.pokemon_type = _("细语"),
	 .height = 6,
	 .weight = 163,
	 .pokedex_description1 = (pchar*)PokedexDes293,
	},

	{.pokemon_type = _("大声"),
	 .height = 10,
	 .weight = 405,
	 .pokedex_description1 = (pchar*)PokedexDes294,
	},

	{.pokemon_type = _("噪音"),
	 .height = 15,
	 .weight = 840,
	 .pokedex_description1 = (pchar*)PokedexDes295,
	},

	{.pokemon_type = _("毅力"),
	 .height = 10,
	 .weight = 864,
	 .pokedex_description1 = (pchar*)PokedexDes296,
	},

	{.pokemon_type = _("猛推"),
	 .height = 23,
	 .weight = 2538,
	 .pokedex_description1 = (pchar*)PokedexDes297,
	},

	{.pokemon_type = _("水珠"),
	 .height = 2,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes298,
	},

	{.pokemon_type = _("罗盘"),
	 .height = 10,
	 .weight = 970,
	 .pokedex_description1 = (pchar*)PokedexDes299,
	},

	{.pokemon_type = _("小猫"),
	 .height = 6,
	 .weight = 110,
	 .pokedex_description1 = (pchar*)PokedexDes300,
	},

	{.pokemon_type = _("清高"),
	 .height = 11,
	 .weight = 326,
	 .pokedex_description1 = (pchar*)PokedexDes301,
	},

	{.pokemon_type = _("黑暗"),
	 .height = 5,
	 .weight = 110,
	 .pokedex_description1 = (pchar*)PokedexDes302,
	},

	{.pokemon_type = _("欺骗"),
	 .height = 6,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes303,
	},

	{.pokemon_type = _("铁铠"),
	 .height = 4,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes304,
	},

	{.pokemon_type = _("铁铠"),
	 .height = 9,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes305,
	},

	{.pokemon_type = _("铁铠"),
	 .height = 21,
	 .weight = 3600,
	 .pokedex_description1 = (pchar*)PokedexDes306,
	},

	{.pokemon_type = _("冥想"),
	 .height = 6,
	 .weight = 112,
	 .pokedex_description1 = (pchar*)PokedexDes307,
	},

	{.pokemon_type = _("冥想"),
	 .height = 13,
	 .weight = 315,
	 .pokedex_description1 = (pchar*)PokedexDes308,
	},

	{.pokemon_type = _("闪电"),
	 .height = 6,
	 .weight = 152,
	 .pokedex_description1 = (pchar*)PokedexDes309,
	},

	{.pokemon_type = _("放电"),
	 .height = 15,
	 .weight = 402,
	 .pokedex_description1 = (pchar*)PokedexDes310,
	},

	{.pokemon_type = _("加油"),
	 .height = 4,
	 .weight = 42,
	 .pokedex_description1 = (pchar*)PokedexDes311,
	},

	{.pokemon_type = _("加油"),
	 .height = 4,
	 .weight = 42,
	 .pokedex_description1 = (pchar*)PokedexDes312,
	},

	{.pokemon_type = _("萤火虫"),
	 .height = 7,
	 .weight = 177,
	 .pokedex_description1 = (pchar*)PokedexDes313,
	},

	{.pokemon_type = _("萤火虫"),
	 .height = 6,
	 .weight = 177,
	 .pokedex_description1 = (pchar*)PokedexDes314,
	},

	{.pokemon_type = _("荆棘"),
	 .height = 3,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes315,
	},

	{.pokemon_type = _("胃袋"),
	 .height = 4,
	 .weight = 103,
	 .pokedex_description1 = (pchar*)PokedexDes316,
	},

	{.pokemon_type = _("毒袋"),
	 .height = 17,
	 .weight = 800,
	 .pokedex_description1 = (pchar*)PokedexDes317,
	},

	{.pokemon_type = _("凶猛"),
	 .height = 8,
	 .weight = 208,
	 .pokedex_description1 = (pchar*)PokedexDes318,
	},

	{.pokemon_type = _("凶暴"),
	 .height = 18,
	 .weight = 888,
	 .pokedex_description1 = (pchar*)PokedexDes319,
	},

	{.pokemon_type = _("球鲸"),
	 .height = 20,
	 .weight = 1300,
	 .pokedex_description1 = (pchar*)PokedexDes320,
	},

	{.pokemon_type = _("浮鲸"),
	 .height = 145,
	 .weight = 3980,
	 .pokedex_description1 = (pchar*)PokedexDes321,
	},

	{.pokemon_type = _("迟钝"),
	 .height = 7,
	 .weight = 240,
	 .pokedex_description1 = (pchar*)PokedexDes322,
	},

	{.pokemon_type = _("喷火"),
	 .height = 19,
	 .weight = 2200,
	 .pokedex_description1 = (pchar*)PokedexDes323,
	},

	{.pokemon_type = _("煤炭"),
	 .height = 5,
	 .weight = 804,
	 .pokedex_description1 = (pchar*)PokedexDes324,
	},

	{.pokemon_type = _("弹跳"),
	 .height = 7,
	 .weight = 306,
	 .pokedex_description1 = (pchar*)PokedexDes325,
	},

	{.pokemon_type = _("操纵"),
	 .height = 9,
	 .weight = 715,
	 .pokedex_description1 = (pchar*)PokedexDes326,
	},

	{.pokemon_type = _("斑点熊猫"),
	 .height = 11,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes327,
	},

	{.pokemon_type = _("蚁狮"),
	 .height = 7,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes328,
	},

	{.pokemon_type = _("震动"),
	 .height = 11,
	 .weight = 153,
	 .pokedex_description1 = (pchar*)PokedexDes329,
	},

	{.pokemon_type = _("神秘"),
	 .height = 20,
	 .weight = 820,
	 .pokedex_description1 = (pchar*)PokedexDes330,
	},

	{.pokemon_type = _("仙人掌"),
	 .height = 4,
	 .weight = 513,
	 .pokedex_description1 = (pchar*)PokedexDes331,
	},

	{.pokemon_type = _("稻草人"),
	 .height = 13,
	 .weight = 774,
	 .pokedex_description1 = (pchar*)PokedexDes332,
	},

	{.pokemon_type = _("绵鸟"),
	 .height = 4,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes333,
	},

	{.pokemon_type = _("哼唱"),
	 .height = 11,
	 .weight = 206,
	 .pokedex_description1 = (pchar*)PokedexDes334,
	},

	{.pokemon_type = _("猫鼬"),
	 .height = 13,
	 .weight = 403,
	 .pokedex_description1 = (pchar*)PokedexDes335,
	},

	{.pokemon_type = _("牙蛇"),
	 .height = 27,
	 .weight = 525,
	 .pokedex_description1 = (pchar*)PokedexDes336,
	},

	{.pokemon_type = _("陨石"),
	 .height = 10,
	 .weight = 1680,
	 .pokedex_description1 = (pchar*)PokedexDes337,
	},

	{.pokemon_type = _("陨石"),
	 .height = 12,
	 .weight = 1540,
	 .pokedex_description1 = (pchar*)PokedexDes338,
	},

	{.pokemon_type = _("须鱼"),
	 .height = 4,
	 .weight = 19,
	 .pokedex_description1 = (pchar*)PokedexDes339,
	},

	{.pokemon_type = _("须鱼"),
	 .height = 9,
	 .weight = 236,
	 .pokedex_description1 = (pchar*)PokedexDes340,
	},

	{.pokemon_type = _("无赖"),
	 .height = 6,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes341,
	},

	{.pokemon_type = _("流氓"),
	 .height = 11,
	 .weight = 328,
	 .pokedex_description1 = (pchar*)PokedexDes342,
	},

	{.pokemon_type = _("泥偶"),
	 .height = 5,
	 .weight = 215,
	 .pokedex_description1 = (pchar*)PokedexDes343,
	},

	{.pokemon_type = _("泥偶"),
	 .height = 15,
	 .weight = 1080,
	 .pokedex_description1 = (pchar*)PokedexDes344,
	},

	{.pokemon_type = _("海百合"),
	 .height = 10,
	 .weight = 238,
	 .pokedex_description1 = (pchar*)PokedexDes345,
	},

	{.pokemon_type = _("藤壶"),
	 .height = 15,
	 .weight = 604,
	 .pokedex_description1 = (pchar*)PokedexDes346,
	},

	{.pokemon_type = _("古虾"),
	 .height = 7,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes347,
	},

	{.pokemon_type = _("甲胄"),
	 .height = 15,
	 .weight = 682,
	 .pokedex_description1 = (pchar*)PokedexDes348,
	},

	{.pokemon_type = _("鱼"),
	 .height = 6,
	 .weight = 74,
	 .pokedex_description1 = (pchar*)PokedexDes349,
	},

	{.pokemon_type = _("慈爱"),
	 .height = 62,
	 .weight = 1620,
	 .pokedex_description1 = (pchar*)PokedexDes350,
	},

	{.pokemon_type = _("天气"),
	 .height = 3,
	 .weight = 8,
	 .pokedex_description1 = (pchar*)PokedexDes351,
	},

	{.pokemon_type = _("变色"),
	 .height = 10,
	 .weight = 220,
	 .pokedex_description1 = (pchar*)PokedexDes352,
	},

	{.pokemon_type = _("人偶"),
	 .height = 6,
	 .weight = 23,
	 .pokedex_description1 = (pchar*)PokedexDes353,
	},

	{.pokemon_type = _("布偶"),
	 .height = 11,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes354,
	},

	{.pokemon_type = _("渡魂"),
	 .height = 8,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes355,
	},

	{.pokemon_type = _("招手"),
	 .height = 16,
	 .weight = 306,
	 .pokedex_description1 = (pchar*)PokedexDes356,
	},

	{.pokemon_type = _("水果"),
	 .height = 20,
	 .weight = 1000,
	 .pokedex_description1 = (pchar*)PokedexDes357,
	},

	{.pokemon_type = _("风铃"),
	 .height = 6,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes358,
	},

	{.pokemon_type = _("灾祸"),
	 .height = 12,
	 .weight = 470,
	 .pokedex_description1 = (pchar*)PokedexDes359,
	},

	{.pokemon_type = _("开朗"),
	 .height = 6,
	 .weight = 140,
	 .pokedex_description1 = (pchar*)PokedexDes360,
	},

	{.pokemon_type = _("雪笠"),
	 .height = 7,
	 .weight = 168,
	 .pokedex_description1 = (pchar*)PokedexDes361,
	},

	{.pokemon_type = _("脸面"),
	 .height = 15,
	 .weight = 2565,
	 .pokedex_description1 = (pchar*)PokedexDes362,
	},

	{.pokemon_type = _("拍手"),
	 .height = 8,
	 .weight = 395,
	 .pokedex_description1 = (pchar*)PokedexDes363,
	},

	{.pokemon_type = _("滚球"),
	 .height = 11,
	 .weight = 876,
	 .pokedex_description1 = (pchar*)PokedexDes364,
	},

	{.pokemon_type = _("破冰"),
	 .height = 14,
	 .weight = 1506,
	 .pokedex_description1 = (pchar*)PokedexDes365,
	},

	{.pokemon_type = _("双壳贝"),
	 .height = 4,
	 .weight = 525,
	 .pokedex_description1 = (pchar*)PokedexDes366,
	},

	{.pokemon_type = _("深海"),
	 .height = 17,
	 .weight = 270,
	 .pokedex_description1 = (pchar*)PokedexDes367,
	},

	{.pokemon_type = _("南海"),
	 .height = 18,
	 .weight = 226,
	 .pokedex_description1 = (pchar*)PokedexDes368,
	},

	{.pokemon_type = _("长寿"),
	 .height = 10,
	 .weight = 234,
	 .pokedex_description1 = (pchar*)PokedexDes369,
	},

	{.pokemon_type = _("相随"),
	 .height = 6,
	 .weight = 87,
	 .pokedex_description1 = (pchar*)PokedexDes370,
	},

	{.pokemon_type = _("坚硬脑袋"),
	 .height = 6,
	 .weight = 421,
	 .pokedex_description1 = (pchar*)PokedexDes371,
	},

	{.pokemon_type = _("耐力"),
	 .height = 11,
	 .weight = 1105,
	 .pokedex_description1 = (pchar*)PokedexDes372,
	},

	{.pokemon_type = _("龙"),
	 .height = 15,
	 .weight = 1026,
	 .pokedex_description1 = (pchar*)PokedexDes373,
	},

	{.pokemon_type = _("铁球"),
	 .height = 6,
	 .weight = 952,
	 .pokedex_description1 = (pchar*)PokedexDes374,
	},

	{.pokemon_type = _("铁爪"),
	 .height = 12,
	 .weight = 2025,
	 .pokedex_description1 = (pchar*)PokedexDes375,
	},

	{.pokemon_type = _("铁足"),
	 .height = 16,
	 .weight = 5500,
	 .pokedex_description1 = (pchar*)PokedexDes376,
	},

	{.pokemon_type = _("岩山"),
	 .height = 17,
	 .weight = 2300,
	 .pokedex_description1 = (pchar*)PokedexDes377,
	},

	{.pokemon_type = _("冰山"),
	 .height = 18,
	 .weight = 1750,
	 .pokedex_description1 = (pchar*)PokedexDes378,
	},

	{.pokemon_type = _("黑金"),
	 .height = 19,
	 .weight = 2050,
	 .pokedex_description1 = (pchar*)PokedexDes379,
	},

	{.pokemon_type = _("无限"),
	 .height = 14,
	 .weight = 400,
	 .pokedex_description1 = (pchar*)PokedexDes380,
	},

	{.pokemon_type = _("无限"),
	 .height = 20,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes381,
	},

	{.pokemon_type = _("海底"),
	 .height = 45,
	 .weight = 3520,
	 .pokedex_description1 = (pchar*)PokedexDes382,
	},

	{.pokemon_type = _("大陆"),
	 .height = 35,
	 .weight = 9500,
	 .pokedex_description1 = (pchar*)PokedexDes383,
	},

	{.pokemon_type = _("天空"),
	 .height = 70,
	 .weight = 2065,
	 .pokedex_description1 = (pchar*)PokedexDes384,
	},

	{.pokemon_type = _("祈愿"),
	 .height = 3,
	 .weight = 11,
	 .pokedex_description1 = (pchar*)PokedexDes385,
	},

	{.pokemon_type = _("DNA"),
	 .height = 17,
	 .weight = 608,
	 .pokedex_description1 = (pchar*)PokedexDes386,
	},

	{.pokemon_type = _("嫩叶"),
	 .height = 4,
	 .weight = 102,
	 .pokedex_description1 = (pchar*)PokedexDes387,
	},

	{.pokemon_type = _("树丛"),
	 .height = 11,
	 .weight = 970,
	 .pokedex_description1 = (pchar*)PokedexDes388,
	},

	{.pokemon_type = _("大陆"),
	 .height = 22,
	 .weight = 3100,
	 .pokedex_description1 = (pchar*)PokedexDes389,
	},

	{.pokemon_type = _("小猴"),
	 .height = 5,
	 .weight = 62,
	 .pokedex_description1 = (pchar*)PokedexDes390,
	},

	{.pokemon_type = _("顽皮"),
	 .height = 9,
	 .weight = 220,
	 .pokedex_description1 = (pchar*)PokedexDes391,
	},

	{.pokemon_type = _("火焰"),
	 .height = 12,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes392,
	},

	{.pokemon_type = _("企鹅"),
	 .height = 4,
	 .weight = 52,
	 .pokedex_description1 = (pchar*)PokedexDes393,
	},

	{.pokemon_type = _("企鹅"),
	 .height = 8,
	 .weight = 230,
	 .pokedex_description1 = (pchar*)PokedexDes394,
	},

	{.pokemon_type = _("皇帝"),
	 .height = 17,
	 .weight = 845,
	 .pokedex_description1 = (pchar*)PokedexDes395,
	},

	{.pokemon_type = _("椋鸟"),
	 .height = 3,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes396,
	},

	{.pokemon_type = _("椋鸟"),
	 .height = 6,
	 .weight = 155,
	 .pokedex_description1 = (pchar*)PokedexDes397,
	},

	{.pokemon_type = _("猛禽"),
	 .height = 12,
	 .weight = 249,
	 .pokedex_description1 = (pchar*)PokedexDes398,
	},

	{.pokemon_type = _("圆鼠"),
	 .height = 5,
	 .weight = 200,
	 .pokedex_description1 = (pchar*)PokedexDes399,
	},

	{.pokemon_type = _("河狸"),
	 .height = 10,
	 .weight = 315,
	 .pokedex_description1 = (pchar*)PokedexDes400,
	},

	{.pokemon_type = _("蟋蟀"),
	 .height = 3,
	 .weight = 22,
	 .pokedex_description1 = (pchar*)PokedexDes401,
	},

	{.pokemon_type = _("蟋蟀"),
	 .height = 10,
	 .weight = 255,
	 .pokedex_description1 = (pchar*)PokedexDes402,
	},

	{.pokemon_type = _("闪光"),
	 .height = 5,
	 .weight = 95,
	 .pokedex_description1 = (pchar*)PokedexDes403,
	},

	{.pokemon_type = _("电光"),
	 .height = 9,
	 .weight = 305,
	 .pokedex_description1 = (pchar*)PokedexDes404,
	},

	{.pokemon_type = _("目光"),
	 .height = 14,
	 .weight = 420,
	 .pokedex_description1 = (pchar*)PokedexDes405,
	},

	{.pokemon_type = _("花苞"),
	 .height = 2,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes406,
	},

	{.pokemon_type = _("花束"),
	 .height = 9,
	 .weight = 145,
	 .pokedex_description1 = (pchar*)PokedexDes407,
	},

	{.pokemon_type = _("头锤"),
	 .height = 9,
	 .weight = 315,
	 .pokedex_description1 = (pchar*)PokedexDes408,
	},

	{.pokemon_type = _("头锤"),
	 .height = 16,
	 .weight = 1025,
	 .pokedex_description1 = (pchar*)PokedexDes409,
	},

	{.pokemon_type = _("护盾"),
	 .height = 5,
	 .weight = 570,
	 .pokedex_description1 = (pchar*)PokedexDes410,
	},

	{.pokemon_type = _("护盾"),
	 .height = 13,
	 .weight = 1495,
	 .pokedex_description1 = (pchar*)PokedexDes411,
	},

	{.pokemon_type = _("蓑衣虫"),
	 .height = 2,
	 .weight = 34,
	 .pokedex_description1 = (pchar*)PokedexDes412,
	},

	{.pokemon_type = _("蓑衣虫"),
	 .height = 5,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes413,
	},

	{.pokemon_type = _("蓑衣蛾"),
	 .height = 9,
	 .weight = 233,
	 .pokedex_description1 = (pchar*)PokedexDes414,
	},

	{.pokemon_type = _("幼蜂"),
	 .height = 3,
	 .weight = 55,
	 .pokedex_description1 = (pchar*)PokedexDes415,
	},

	{.pokemon_type = _("蜂巢"),
	 .height = 12,
	 .weight = 385,
	 .pokedex_description1 = (pchar*)PokedexDes416,
	},

	{.pokemon_type = _("电松鼠"),
	 .height = 4,
	 .weight = 39,
	 .pokedex_description1 = (pchar*)PokedexDes417,
	},

	{.pokemon_type = _("海鼬"),
	 .height = 7,
	 .weight = 295,
	 .pokedex_description1 = (pchar*)PokedexDes418,
	},

	{.pokemon_type = _("海鼬"),
	 .height = 11,
	 .weight = 335,
	 .pokedex_description1 = (pchar*)PokedexDes419,
	},

	{.pokemon_type = _("樱桃"),
	 .height = 4,
	 .weight = 33,
	 .pokedex_description1 = (pchar*)PokedexDes420,
	},

	{.pokemon_type = _("樱花"),
	 .height = 5,
	 .weight = 93,
	 .pokedex_description1 = (pchar*)PokedexDes421,
	},

	{.pokemon_type = _("海兔"),
	 .height = 3,
	 .weight = 63,
	 .pokedex_description1 = (pchar*)PokedexDes422,
	},

	{.pokemon_type = _("海兔"),
	 .height = 9,
	 .weight = 299,
	 .pokedex_description1 = (pchar*)PokedexDes423,
	},

	{.pokemon_type = _("长尾"),
	 .height = 12,
	 .weight = 203,
	 .pokedex_description1 = (pchar*)PokedexDes424,
	},

	{.pokemon_type = _("气球"),
	 .height = 4,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes425,
	},

	{.pokemon_type = _("热气球"),
	 .height = 12,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes426,
	},

	{.pokemon_type = _("兔子"),
	 .height = 4,
	 .weight = 55,
	 .pokedex_description1 = (pchar*)PokedexDes427,
	},

	{.pokemon_type = _("兔子"),
	 .height = 12,
	 .weight = 333,
	 .pokedex_description1 = (pchar*)PokedexDes428,
	},

	{.pokemon_type = _("魔法"),
	 .height = 9,
	 .weight = 44,
	 .pokedex_description1 = (pchar*)PokedexDes429,
	},

	{.pokemon_type = _("大头目"),
	 .height = 9,
	 .weight = 273,
	 .pokedex_description1 = (pchar*)PokedexDes430,
	},

	{.pokemon_type = _("装乖"),
	 .height = 5,
	 .weight = 39,
	 .pokedex_description1 = (pchar*)PokedexDes431,
	},

	{.pokemon_type = _("虎斑猫"),
	 .height = 10,
	 .weight = 438,
	 .pokedex_description1 = (pchar*)PokedexDes432,
	},

	{.pokemon_type = _("铃铛"),
	 .height = 2,
	 .weight = 6,
	 .pokedex_description1 = (pchar*)PokedexDes433,
	},

	{.pokemon_type = _("臭鼬"),
	 .height = 4,
	 .weight = 192,
	 .pokedex_description1 = (pchar*)PokedexDes434,
	},

	{.pokemon_type = _("臭鼬"),
	 .height = 10,
	 .weight = 380,
	 .pokedex_description1 = (pchar*)PokedexDes435,
	},

	{.pokemon_type = _("青铜"),
	 .height = 5,
	 .weight = 605,
	 .pokedex_description1 = (pchar*)PokedexDes436,
	},

	{.pokemon_type = _("铜钟"),
	 .height = 13,
	 .weight = 1870,
	 .pokedex_description1 = (pchar*)PokedexDes437,
	},

	{.pokemon_type = _("盆栽"),
	 .height = 5,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes438,
	},

	{.pokemon_type = _("默剧"),
	 .height = 6,
	 .weight = 130,
	 .pokedex_description1 = (pchar*)PokedexDes439,
	},

	{.pokemon_type = _("家家酒"),
	 .height = 6,
	 .weight = 244,
	 .pokedex_description1 = (pchar*)PokedexDes440,
	},

	{.pokemon_type = _("音符"),
	 .height = 5,
	 .weight = 19,
	 .pokedex_description1 = (pchar*)PokedexDes441,
	},

	{.pokemon_type = _("封印"),
	 .height = 10,
	 .weight = 1080,
	 .pokedex_description1 = (pchar*)PokedexDes442,
	},

	{.pokemon_type = _("陆鲨"),
	 .height = 7,
	 .weight = 205,
	 .pokedex_description1 = (pchar*)PokedexDes443,
	},

	{.pokemon_type = _("洞穴"),
	 .height = 14,
	 .weight = 560,
	 .pokedex_description1 = (pchar*)PokedexDes444,
	},

	{.pokemon_type = _("音速"),
	 .height = 19,
	 .weight = 950,
	 .pokedex_description1 = (pchar*)PokedexDes445,
	},

	{.pokemon_type = _("大胃王"),
	 .height = 6,
	 .weight = 1050,
	 .pokedex_description1 = (pchar*)PokedexDes446,
	},

	{.pokemon_type = _("波纹"),
	 .height = 7,
	 .weight = 202,
	 .pokedex_description1 = (pchar*)PokedexDes447,
	},

	{.pokemon_type = _("波导"),
	 .height = 12,
	 .weight = 540,
	 .pokedex_description1 = (pchar*)PokedexDes448,
	},

	{.pokemon_type = _("河马"),
	 .height = 8,
	 .weight = 495,
	 .pokedex_description1 = (pchar*)PokedexDes449,
	},

	{.pokemon_type = _("重量"),
	 .height = 20,
	 .weight = 3000,
	 .pokedex_description1 = (pchar*)PokedexDes450,
	},

	{.pokemon_type = _("蝎子"),
	 .height = 8,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes451,
	},

	{.pokemon_type = _("蝎怪"),
	 .height = 13,
	 .weight = 615,
	 .pokedex_description1 = (pchar*)PokedexDes452,
	},

	{.pokemon_type = _("毒击"),
	 .height = 7,
	 .weight = 230,
	 .pokedex_description1 = (pchar*)PokedexDes453,
	},

	{.pokemon_type = _("毒击"),
	 .height = 13,
	 .weight = 444,
	 .pokedex_description1 = (pchar*)PokedexDes454,
	},

	{.pokemon_type = _("捕虫"),
	 .height = 14,
	 .weight = 270,
	 .pokedex_description1 = (pchar*)PokedexDes455,
	},

	{.pokemon_type = _("飞翅鱼"),
	 .height = 4,
	 .weight = 70,
	 .pokedex_description1 = (pchar*)PokedexDes456,
	},

	{.pokemon_type = _("霓虹"),
	 .height = 12,
	 .weight = 240,
	 .pokedex_description1 = (pchar*)PokedexDes457,
	},

	{.pokemon_type = _("风筝"),
	 .height = 10,
	 .weight = 650,
	 .pokedex_description1 = (pchar*)PokedexDes458,
	},

	{.pokemon_type = _("树冰"),
	 .height = 10,
	 .weight = 505,
	 .pokedex_description1 = (pchar*)PokedexDes459,
	},

	{.pokemon_type = _("树冰"),
	 .height = 22,
	 .weight = 1355,
	 .pokedex_description1 = (pchar*)PokedexDes460,
	},

	{.pokemon_type = _("钩爪"),
	 .height = 11,
	 .weight = 340,
	 .pokedex_description1 = (pchar*)PokedexDes461,
	},

	{.pokemon_type = _("磁场"),
	 .height = 12,
	 .weight = 1800,
	 .pokedex_description1 = (pchar*)PokedexDes462,
	},

	{.pokemon_type = _("舔舔"),
	 .height = 17,
	 .weight = 1400,
	 .pokedex_description1 = (pchar*)PokedexDes463,
	},

	{.pokemon_type = _("钻锥"),
	 .height = 24,
	 .weight = 2828,
	 .pokedex_description1 = (pchar*)PokedexDes464,
	},

	{.pokemon_type = _("藤蔓状"),
	 .height = 20,
	 .weight = 1286,
	 .pokedex_description1 = (pchar*)PokedexDes465,
	},

	{.pokemon_type = _("雷电"),
	 .height = 18,
	 .weight = 1386,
	 .pokedex_description1 = (pchar*)PokedexDes466,
	},

	{.pokemon_type = _("爆炎"),
	 .height = 16,
	 .weight = 680,
	 .pokedex_description1 = (pchar*)PokedexDes467,
	},

	{.pokemon_type = _("祝福"),
	 .height = 15,
	 .weight = 380,
	 .pokedex_description1 = (pchar*)PokedexDes468,
	},

	{.pokemon_type = _("勾蜓"),
	 .height = 19,
	 .weight = 515,
	 .pokedex_description1 = (pchar*)PokedexDes469,
	},

	{.pokemon_type = _("新绿"),
	 .height = 10,
	 .weight = 255,
	 .pokedex_description1 = (pchar*)PokedexDes470,
	},

	{.pokemon_type = _("新雪"),
	 .height = 8,
	 .weight = 259,
	 .pokedex_description1 = (pchar*)PokedexDes471,
	},

	{.pokemon_type = _("牙蝎"),
	 .height = 20,
	 .weight = 425,
	 .pokedex_description1 = (pchar*)PokedexDes472,
	},

	{.pokemon_type = _("双牙"),
	 .height = 25,
	 .weight = 2910,
	 .pokedex_description1 = (pchar*)PokedexDes473,
	},

	{.pokemon_type = _("虚拟"),
	 .height = 9,
	 .weight = 340,
	 .pokedex_description1 = (pchar*)PokedexDes474,
	},

	{.pokemon_type = _("利刃"),
	 .height = 16,
	 .weight = 520,
	 .pokedex_description1 = (pchar*)PokedexDes475,
	},

	{.pokemon_type = _("罗盘"),
	 .height = 14,
	 .weight = 3400,
	 .pokedex_description1 = (pchar*)PokedexDes476,
	},

	{.pokemon_type = _("抓握"),
	 .height = 22,
	 .weight = 1066,
	 .pokedex_description1 = (pchar*)PokedexDes477,
	},

	{.pokemon_type = _("雪国"),
	 .height = 13,
	 .weight = 266,
	 .pokedex_description1 = (pchar*)PokedexDes478,
	},

	{.pokemon_type = _("等离子"),
	 .height = 3,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes479,
	},

	{.pokemon_type = _("知识"),
	 .height = 3,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes480,
	},

	{.pokemon_type = _("感情"),
	 .height = 3,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes481,
	},

	{.pokemon_type = _("意志"),
	 .height = 3,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes482,
	},

	{.pokemon_type = _("时间"),
	 .height = 54,
	 .weight = 6830,
	 .pokedex_description1 = (pchar*)PokedexDes483,
	},

	{.pokemon_type = _("空间"),
	 .height = 42,
	 .weight = 3360,
	 .pokedex_description1 = (pchar*)PokedexDes484,
	},

	{.pokemon_type = _("火山口"),
	 .height = 17,
	 .weight = 4300,
	 .pokedex_description1 = (pchar*)PokedexDes485,
	},

	{.pokemon_type = _("巨大"),
	 .height = 37,
	 .weight = 4200,
	 .pokedex_description1 = (pchar*)PokedexDes486,
	},

	{.pokemon_type = _("反抗"),
	 .height = 45,
	 .weight = 7500,
	 .pokedex_description1 = (pchar*)PokedexDes487,
	},

	{.pokemon_type = _("新月"),
	 .height = 15,
	 .weight = 856,
	 .pokedex_description1 = (pchar*)PokedexDes488,
	},

	{.pokemon_type = _("海洋"),
	 .height = 4,
	 .weight = 31,
	 .pokedex_description1 = (pchar*)PokedexDes489,
	},

	{.pokemon_type = _("回游"),
	 .height = 3,
	 .weight = 14,
	 .pokedex_description1 = (pchar*)PokedexDes490,
	},

	{.pokemon_type = _("暗黑"),
	 .height = 15,
	 .weight = 505,
	 .pokedex_description1 = (pchar*)PokedexDes491,
	},

	{.pokemon_type = _("感谢"),
	 .height = 2,
	 .weight = 21,
	 .pokedex_description1 = (pchar*)PokedexDes492,
	},

	{.pokemon_type = _("创造"),
	 .height = 32,
	 .weight = 3200,
	 .pokedex_description1 = (pchar*)PokedexDes493,
	},

	{.pokemon_type = _("胜利"),
	 .height = 4,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes494,
	},

	{.pokemon_type = _("草蛇"),
	 .height = 6,
	 .weight = 81,
	 .pokedex_description1 = (pchar*)PokedexDes495,
	},

	{.pokemon_type = _("草蛇"),
	 .height = 8,
	 .weight = 160,
	 .pokedex_description1 = (pchar*)PokedexDes496,
	},

	{.pokemon_type = _("皇家"),
	 .height = 33,
	 .weight = 630,
	 .pokedex_description1 = (pchar*)PokedexDes497,
	},

	{.pokemon_type = _("火猪"),
	 .height = 5,
	 .weight = 99,
	 .pokedex_description1 = (pchar*)PokedexDes498,
	},

	{.pokemon_type = _("火猪"),
	 .height = 10,
	 .weight = 555,
	 .pokedex_description1 = (pchar*)PokedexDes499,
	},

	{.pokemon_type = _("大火猪"),
	 .height = 16,
	 .weight = 1500,
	 .pokedex_description1 = (pchar*)PokedexDes500,
	},

	{.pokemon_type = _("海獭"),
	 .height = 5,
	 .weight = 59,
	 .pokedex_description1 = (pchar*)PokedexDes501,
	},

	{.pokemon_type = _("修行"),
	 .height = 8,
	 .weight = 245,
	 .pokedex_description1 = (pchar*)PokedexDes502,
	},

	{.pokemon_type = _("威严"),
	 .height = 15,
	 .weight = 946,
	 .pokedex_description1 = (pchar*)PokedexDes503,
	},

	{.pokemon_type = _("放哨"),
	 .height = 5,
	 .weight = 116,
	 .pokedex_description1 = (pchar*)PokedexDes504,
	},

	{.pokemon_type = _("警戒"),
	 .height = 11,
	 .weight = 270,
	 .pokedex_description1 = (pchar*)PokedexDes505,
	},

	{.pokemon_type = _("小狗"),
	 .height = 4,
	 .weight = 41,
	 .pokedex_description1 = (pchar*)PokedexDes506,
	},

	{.pokemon_type = _("忠犬"),
	 .height = 9,
	 .weight = 147,
	 .pokedex_description1 = (pchar*)PokedexDes507,
	},

	{.pokemon_type = _("宽大"),
	 .height = 12,
	 .weight = 610,
	 .pokedex_description1 = (pchar*)PokedexDes508,
	},

	{.pokemon_type = _("坏心眼"),
	 .height = 4,
	 .weight = 101,
	 .pokedex_description1 = (pchar*)PokedexDes509,
	},

	{.pokemon_type = _("冷酷"),
	 .height = 11,
	 .weight = 375,
	 .pokedex_description1 = (pchar*)PokedexDes510,
	},

	{.pokemon_type = _("草猴"),
	 .height = 6,
	 .weight = 105,
	 .pokedex_description1 = (pchar*)PokedexDes511,
	},

	{.pokemon_type = _("刺猴"),
	 .height = 11,
	 .weight = 305,
	 .pokedex_description1 = (pchar*)PokedexDes512,
	},

	{.pokemon_type = _("高温"),
	 .height = 6,
	 .weight = 110,
	 .pokedex_description1 = (pchar*)PokedexDes513,
	},

	{.pokemon_type = _("火花"),
	 .height = 10,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes514,
	},

	{.pokemon_type = _("泼水"),
	 .height = 6,
	 .weight = 135,
	 .pokedex_description1 = (pchar*)PokedexDes515,
	},

	{.pokemon_type = _("放水"),
	 .height = 10,
	 .weight = 290,
	 .pokedex_description1 = (pchar*)PokedexDes516,
	},

	{.pokemon_type = _("食梦"),
	 .height = 6,
	 .weight = 233,
	 .pokedex_description1 = (pchar*)PokedexDes517,
	},

	{.pokemon_type = _("半梦半醒"),
	 .height = 11,
	 .weight = 605,
	 .pokedex_description1 = (pchar*)PokedexDes518,
	},

	{.pokemon_type = _("小鸽"),
	 .height = 3,
	 .weight = 21,
	 .pokedex_description1 = (pchar*)PokedexDes519,
	},

	{.pokemon_type = _("野鸽"),
	 .height = 6,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes520,
	},

	{.pokemon_type = _("自尊心"),
	 .height = 12,
	 .weight = 290,
	 .pokedex_description1 = (pchar*)PokedexDes521,
	},

	{.pokemon_type = _("带电"),
	 .height = 8,
	 .weight = 298,
	 .pokedex_description1 = (pchar*)PokedexDes522,
	},

	{.pokemon_type = _("雷电"),
	 .height = 16,
	 .weight = 795,
	 .pokedex_description1 = (pchar*)PokedexDes523,
	},

	{.pokemon_type = _("地幔"),
	 .height = 4,
	 .weight = 180,
	 .pokedex_description1 = (pchar*)PokedexDes524,
	},

	{.pokemon_type = _("矿石"),
	 .height = 9,
	 .weight = 1020,
	 .pokedex_description1 = (pchar*)PokedexDes525,
	},

	{.pokemon_type = _("高压"),
	 .height = 17,
	 .weight = 2600,
	 .pokedex_description1 = (pchar*)PokedexDes526,
	},

	{.pokemon_type = _("蝙蝠"),
	 .height = 4,
	 .weight = 21,
	 .pokedex_description1 = (pchar*)PokedexDes527,
	},

	{.pokemon_type = _("求爱"),
	 .height = 9,
	 .weight = 105,
	 .pokedex_description1 = (pchar*)PokedexDes528,
	},

	{.pokemon_type = _("鼹鼠"),
	 .height = 3,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes529,
	},

	{.pokemon_type = _("地底"),
	 .height = 7,
	 .weight = 404,
	 .pokedex_description1 = (pchar*)PokedexDes530,
	},

	{.pokemon_type = _("听力"),
	 .height = 11,
	 .weight = 310,
	 .pokedex_description1 = (pchar*)PokedexDes531,
	},

	{.pokemon_type = _("筋骨"),
	 .height = 6,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes532,
	},

	{.pokemon_type = _("筋骨"),
	 .height = 12,
	 .weight = 400,
	 .pokedex_description1 = (pchar*)PokedexDes533,
	},

	{.pokemon_type = _("筋骨"),
	 .height = 14,
	 .weight = 870,
	 .pokedex_description1 = (pchar*)PokedexDes534,
	},

	{.pokemon_type = _("蝌蚪"),
	 .height = 5,
	 .weight = 45,
	 .pokedex_description1 = (pchar*)PokedexDes535,
	},

	{.pokemon_type = _("震动"),
	 .height = 8,
	 .weight = 170,
	 .pokedex_description1 = (pchar*)PokedexDes536,
	},

	{.pokemon_type = _("震动"),
	 .height = 15,
	 .weight = 620,
	 .pokedex_description1 = (pchar*)PokedexDes537,
	},

	{.pokemon_type = _("柔道"),
	 .height = 13,
	 .weight = 555,
	 .pokedex_description1 = (pchar*)PokedexDes538,
	},

	{.pokemon_type = _("空手道"),
	 .height = 14,
	 .weight = 510,
	 .pokedex_description1 = (pchar*)PokedexDes539,
	},

	{.pokemon_type = _("裁缝"),
	 .height = 3,
	 .weight = 25,
	 .pokedex_description1 = (pchar*)PokedexDes540,
	},

	{.pokemon_type = _("足不出叶"),
	 .height = 5,
	 .weight = 73,
	 .pokedex_description1 = (pchar*)PokedexDes541,
	},

	{.pokemon_type = _("育儿"),
	 .height = 12,
	 .weight = 205,
	 .pokedex_description1 = (pchar*)PokedexDes542,
	},

	{.pokemon_type = _("蜈蚣"),
	 .height = 4,
	 .weight = 53,
	 .pokedex_description1 = (pchar*)PokedexDes543,
	},

	{.pokemon_type = _("茧蜈蚣"),
	 .height = 12,
	 .weight = 585,
	 .pokedex_description1 = (pchar*)PokedexDes544,
	},

	{.pokemon_type = _("巨蜈蚣"),
	 .height = 25,
	 .weight = 2005,
	 .pokedex_description1 = (pchar*)PokedexDes545,
	},

	{.pokemon_type = _("棉球"),
	 .height = 3,
	 .weight = 6,
	 .pokedex_description1 = (pchar*)PokedexDes546,
	},

	{.pokemon_type = _("风隐"),
	 .height = 7,
	 .weight = 66,
	 .pokedex_description1 = (pchar*)PokedexDes547,
	},

	{.pokemon_type = _("根茎"),
	 .height = 5,
	 .weight = 66,
	 .pokedex_description1 = (pchar*)PokedexDes548,
	},

	{.pokemon_type = _("花饰"),
	 .height = 11,
	 .weight = 163,
	 .pokedex_description1 = (pchar*)PokedexDes549,
	},

	{.pokemon_type = _("粗暴"),
	 .height = 10,
	 .weight = 180,
	 .pokedex_description1 = (pchar*)PokedexDes550,
	},

	{.pokemon_type = _("沙漠鳄鱼"),
	 .height = 7,
	 .weight = 152,
	 .pokedex_description1 = (pchar*)PokedexDes551,
	},

	{.pokemon_type = _("沙漠鳄鱼"),
	 .height = 10,
	 .weight = 334,
	 .pokedex_description1 = (pchar*)PokedexDes552,
	},

	{.pokemon_type = _("威吓"),
	 .height = 15,
	 .weight = 963,
	 .pokedex_description1 = (pchar*)PokedexDes553,
	},

	{.pokemon_type = _("不倒翁"),
	 .height = 6,
	 .weight = 375,
	 .pokedex_description1 = (pchar*)PokedexDes554,
	},

	{.pokemon_type = _("爆燃"),
	 .height = 13,
	 .weight = 929,
	 .pokedex_description1 = (pchar*)PokedexDes555,
	},

	{.pokemon_type = _("仙人掌"),
	 .height = 10,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes556,
	},

	{.pokemon_type = _("石居"),
	 .height = 3,
	 .weight = 145,
	 .pokedex_description1 = (pchar*)PokedexDes557,
	},

	{.pokemon_type = _("岩居"),
	 .height = 14,
	 .weight = 2000,
	 .pokedex_description1 = (pchar*)PokedexDes558,
	},

	{.pokemon_type = _("蜕皮"),
	 .height = 6,
	 .weight = 118,
	 .pokedex_description1 = (pchar*)PokedexDes559,
	},

	{.pokemon_type = _("恶党"),
	 .height = 11,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes560,
	},

	{.pokemon_type = _("似鸟"),
	 .height = 14,
	 .weight = 140,
	 .pokedex_description1 = (pchar*)PokedexDes561,
	},

	{.pokemon_type = _("魂"),
	 .height = 5,
	 .weight = 15,
	 .pokedex_description1 = (pchar*)PokedexDes562,
	},

	{.pokemon_type = _("棺木"),
	 .height = 17,
	 .weight = 765,
	 .pokedex_description1 = (pchar*)PokedexDes563,
	},

	{.pokemon_type = _("古代龟"),
	 .height = 7,
	 .weight = 165,
	 .pokedex_description1 = (pchar*)PokedexDes564,
	},

	{.pokemon_type = _("古代龟"),
	 .height = 12,
	 .weight = 810,
	 .pokedex_description1 = (pchar*)PokedexDes565,
	},

	{.pokemon_type = _("远古鸟"),
	 .height = 5,
	 .weight = 95,
	 .pokedex_description1 = (pchar*)PokedexDes566,
	},

	{.pokemon_type = _("远古鸟"),
	 .height = 14,
	 .weight = 320,
	 .pokedex_description1 = (pchar*)PokedexDes567,
	},

	{.pokemon_type = _("垃圾袋"),
	 .height = 6,
	 .weight = 310,
	 .pokedex_description1 = (pchar*)PokedexDes568,
	},

	{.pokemon_type = _("垃圾场"),
	 .height = 19,
	 .weight = 1073,
	 .pokedex_description1 = (pchar*)PokedexDes569,
	},

	{.pokemon_type = _("恶狐"),
	 .height = 7,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes570,
	},

	{.pokemon_type = _("妖狐"),
	 .height = 16,
	 .weight = 811,
	 .pokedex_description1 = (pchar*)PokedexDes571,
	},

	{.pokemon_type = _("栗鼠"),
	 .height = 4,
	 .weight = 58,
	 .pokedex_description1 = (pchar*)PokedexDes572,
	},

	{.pokemon_type = _("围巾"),
	 .height = 5,
	 .weight = 75,
	 .pokedex_description1 = (pchar*)PokedexDes573,
	},

	{.pokemon_type = _("凝视"),
	 .height = 4,
	 .weight = 58,
	 .pokedex_description1 = (pchar*)PokedexDes574,
	},

	{.pokemon_type = _("操纵"),
	 .height = 7,
	 .weight = 180,
	 .pokedex_description1 = (pchar*)PokedexDes575,
	},

	{.pokemon_type = _("天体"),
	 .height = 15,
	 .weight = 440,
	 .pokedex_description1 = (pchar*)PokedexDes576,
	},

	{.pokemon_type = _("细胞"),
	 .height = 3,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes577,
	},

	{.pokemon_type = _("分割"),
	 .height = 6,
	 .weight = 80,
	 .pokedex_description1 = (pchar*)PokedexDes578,
	},

	{.pokemon_type = _("增幅"),
	 .height = 10,
	 .weight = 201,
	 .pokedex_description1 = (pchar*)PokedexDes579,
	},

	{.pokemon_type = _("水鸟"),
	 .height = 5,
	 .weight = 55,
	 .pokedex_description1 = (pchar*)PokedexDes580,
	},

	{.pokemon_type = _("白鸟"),
	 .height = 13,
	 .weight = 242,
	 .pokedex_description1 = (pchar*)PokedexDes581,
	},

	{.pokemon_type = _("新雪"),
	 .height = 4,
	 .weight = 57,
	 .pokedex_description1 = (pchar*)PokedexDes582,
	},

	{.pokemon_type = _("冰雪"),
	 .height = 11,
	 .weight = 410,
	 .pokedex_description1 = (pchar*)PokedexDes583,
	},

	{.pokemon_type = _("暴风雪"),
	 .height = 13,
	 .weight = 575,
	 .pokedex_description1 = (pchar*)PokedexDes584,
	},

	{.pokemon_type = _("季节"),
	 .height = 6,
	 .weight = 195,
	 .pokedex_description1 = (pchar*)PokedexDes585,
	},

	{.pokemon_type = _("季节"),
	 .height = 19,
	 .weight = 925,
	 .pokedex_description1 = (pchar*)PokedexDes586,
	},

	{.pokemon_type = _("飞鼠"),
	 .height = 4,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes587,
	},

	{.pokemon_type = _("啃咬"),
	 .height = 5,
	 .weight = 59,
	 .pokedex_description1 = (pchar*)PokedexDes588,
	},

	{.pokemon_type = _("骑兵"),
	 .height = 10,
	 .weight = 330,
	 .pokedex_description1 = (pchar*)PokedexDes589,
	},

	{.pokemon_type = _("蘑菇"),
	 .height = 2,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes590,
	},

	{.pokemon_type = _("蘑菇"),
	 .height = 6,
	 .weight = 105,
	 .pokedex_description1 = (pchar*)PokedexDes591,
	},

	{.pokemon_type = _("漂浮"),
	 .height = 12,
	 .weight = 330,
	 .pokedex_description1 = (pchar*)PokedexDes592,
	},

	{.pokemon_type = _("漂浮"),
	 .height = 22,
	 .weight = 1350,
	 .pokedex_description1 = (pchar*)PokedexDes593,
	},

	{.pokemon_type = _("看护"),
	 .height = 12,
	 .weight = 316,
	 .pokedex_description1 = (pchar*)PokedexDes594,
	},

	{.pokemon_type = _("吸附"),
	 .height = 1,
	 .weight = 6,
	 .pokedex_description1 = (pchar*)PokedexDes595,
	},

	{.pokemon_type = _("电蜘蛛"),
	 .height = 8,
	 .weight = 143,
	 .pokedex_description1 = (pchar*)PokedexDes596,
	},

	{.pokemon_type = _("刺果"),
	 .height = 6,
	 .weight = 188,
	 .pokedex_description1 = (pchar*)PokedexDes597,
	},

	{.pokemon_type = _("刺球"),
	 .height = 10,
	 .weight = 1100,
	 .pokedex_description1 = (pchar*)PokedexDes598,
	},

	{.pokemon_type = _("齿轮"),
	 .height = 3,
	 .weight = 210,
	 .pokedex_description1 = (pchar*)PokedexDes599,
	},

	{.pokemon_type = _("齿轮"),
	 .height = 6,
	 .weight = 510,
	 .pokedex_description1 = (pchar*)PokedexDes600,
	},

	{.pokemon_type = _("齿轮"),
	 .height = 6,
	 .weight = 810,
	 .pokedex_description1 = (pchar*)PokedexDes601,
	},

	{.pokemon_type = _("电鱼"),
	 .height = 2,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes602,
	},

	{.pokemon_type = _("电鱼"),
	 .height = 12,
	 .weight = 220,
	 .pokedex_description1 = (pchar*)PokedexDes603,
	},

	{.pokemon_type = _("电鱼"),
	 .height = 21,
	 .weight = 805,
	 .pokedex_description1 = (pchar*)PokedexDes604,
	},

	{.pokemon_type = _("脑"),
	 .height = 5,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes605,
	},

	{.pokemon_type = _("脑"),
	 .height = 10,
	 .weight = 345,
	 .pokedex_description1 = (pchar*)PokedexDes606,
	},

	{.pokemon_type = _("蜡烛"),
	 .height = 3,
	 .weight = 31,
	 .pokedex_description1 = (pchar*)PokedexDes607,
	},

	{.pokemon_type = _("油灯"),
	 .height = 6,
	 .weight = 130,
	 .pokedex_description1 = (pchar*)PokedexDes608,
	},

	{.pokemon_type = _("引诱"),
	 .height = 10,
	 .weight = 343,
	 .pokedex_description1 = (pchar*)PokedexDes609,
	},

	{.pokemon_type = _("牙"),
	 .height = 6,
	 .weight = 180,
	 .pokedex_description1 = (pchar*)PokedexDes610,
	},

	{.pokemon_type = _("颚斧"),
	 .height = 10,
	 .weight = 360,
	 .pokedex_description1 = (pchar*)PokedexDes611,
	},

	{.pokemon_type = _("颚斧"),
	 .height = 18,
	 .weight = 1055,
	 .pokedex_description1 = (pchar*)PokedexDes612,
	},

	{.pokemon_type = _("结冰"),
	 .height = 5,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes613,
	},

	{.pokemon_type = _("冻结"),
	 .height = 26,
	 .weight = 2600,
	 .pokedex_description1 = (pchar*)PokedexDes614,
	},

	{.pokemon_type = _("结晶"),
	 .height = 11,
	 .weight = 1480,
	 .pokedex_description1 = (pchar*)PokedexDes615,
	},

	{.pokemon_type = _("蜗牛"),
	 .height = 4,
	 .weight = 77,
	 .pokedex_description1 = (pchar*)PokedexDes616,
	},

	{.pokemon_type = _("脱壳"),
	 .height = 8,
	 .weight = 253,
	 .pokedex_description1 = (pchar*)PokedexDes617,
	},

	{.pokemon_type = _("陷阱"),
	 .height = 7,
	 .weight = 110,
	 .pokedex_description1 = (pchar*)PokedexDes618,
	},

	{.pokemon_type = _("武术"),
	 .height = 9,
	 .weight = 200,
	 .pokedex_description1 = (pchar*)PokedexDes619,
	},

	{.pokemon_type = _("武术"),
	 .height = 14,
	 .weight = 355,
	 .pokedex_description1 = (pchar*)PokedexDes620,
	},

	{.pokemon_type = _("洞穴"),
	 .height = 16,
	 .weight = 1390,
	 .pokedex_description1 = (pchar*)PokedexDes621,
	},

	{.pokemon_type = _("魔像"),
	 .height = 10,
	 .weight = 920,
	 .pokedex_description1 = (pchar*)PokedexDes622,
	},

	{.pokemon_type = _("魔像"),
	 .height = 28,
	 .weight = 3300,
	 .pokedex_description1 = (pchar*)PokedexDes623,
	},

	{.pokemon_type = _("利器"),
	 .height = 5,
	 .weight = 102,
	 .pokedex_description1 = (pchar*)PokedexDes624,
	},

	{.pokemon_type = _("刀刃"),
	 .height = 16,
	 .weight = 700,
	 .pokedex_description1 = (pchar*)PokedexDes625,
	},

	{.pokemon_type = _("头锤牛"),
	 .height = 16,
	 .weight = 946,
	 .pokedex_description1 = (pchar*)PokedexDes626,
	},

	{.pokemon_type = _("雏鹰"),
	 .height = 5,
	 .weight = 105,
	 .pokedex_description1 = (pchar*)PokedexDes627,
	},

	{.pokemon_type = _("勇猛"),
	 .height = 15,
	 .weight = 410,
	 .pokedex_description1 = (pchar*)PokedexDes628,
	},

	{.pokemon_type = _("尿布"),
	 .height = 5,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes629,
	},

	{.pokemon_type = _("骨鹰"),
	 .height = 12,
	 .weight = 395,
	 .pokedex_description1 = (pchar*)PokedexDes630,
	},

	{.pokemon_type = _("食蚁兽"),
	 .height = 14,
	 .weight = 580,
	 .pokedex_description1 = (pchar*)PokedexDes631,
	},

	{.pokemon_type = _("铁蚁"),
	 .height = 3,
	 .weight = 330,
	 .pokedex_description1 = (pchar*)PokedexDes632,
	},

	{.pokemon_type = _("粗鲁"),
	 .height = 8,
	 .weight = 173,
	 .pokedex_description1 = (pchar*)PokedexDes633,
	},

	{.pokemon_type = _("粗暴"),
	 .height = 14,
	 .weight = 500,
	 .pokedex_description1 = (pchar*)PokedexDes634,
	},

	{.pokemon_type = _("凶暴"),
	 .height = 18,
	 .weight = 1600,
	 .pokedex_description1 = (pchar*)PokedexDes635,
	},

	{.pokemon_type = _("火炬"),
	 .height = 11,
	 .weight = 288,
	 .pokedex_description1 = (pchar*)PokedexDes636,
	},

	{.pokemon_type = _("太阳"),
	 .height = 16,
	 .weight = 460,
	 .pokedex_description1 = (pchar*)PokedexDes637,
	},

	{.pokemon_type = _("铁心"),
	 .height = 21,
	 .weight = 2500,
	 .pokedex_description1 = (pchar*)PokedexDes638,
	},

	{.pokemon_type = _("岩窟"),
	 .height = 19,
	 .weight = 2600,
	 .pokedex_description1 = (pchar*)PokedexDes639,
	},

	{.pokemon_type = _("草原"),
	 .height = 20,
	 .weight = 2000,
	 .pokedex_description1 = (pchar*)PokedexDes640,
	},

	{.pokemon_type = _("旋风"),
	 .height = 15,
	 .weight = 630,
	 .pokedex_description1 = (pchar*)PokedexDes641,
	},

	{.pokemon_type = _("雷击"),
	 .height = 15,
	 .weight = 610,
	 .pokedex_description1 = (pchar*)PokedexDes642,
	},

	{.pokemon_type = _("白阳"),
	 .height = 32,
	 .weight = 3300,
	 .pokedex_description1 = (pchar*)PokedexDes643,
	},

	{.pokemon_type = _("黑阴"),
	 .height = 29,
	 .weight = 3450,
	 .pokedex_description1 = (pchar*)PokedexDes644,
	},

	{.pokemon_type = _("丰饶"),
	 .height = 15,
	 .weight = 680,
	 .pokedex_description1 = (pchar*)PokedexDes645,
	},

	{.pokemon_type = _("境界"),
	 .height = 30,
	 .weight = 3250,
	 .pokedex_description1 = (pchar*)PokedexDes646,
	},

	{.pokemon_type = _("幼马"),
	 .height = 14,
	 .weight = 485,
	 .pokedex_description1 = (pchar*)PokedexDes647,
	},

	{.pokemon_type = _("旋律"),
	 .height = 6,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes648,
	},

	{.pokemon_type = _("古生代"),
	 .height = 15,
	 .weight = 825,
	 .pokedex_description1 = (pchar*)PokedexDes649,
	},

	{.pokemon_type = _("刺栗"),
	 .height = 4,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes650,
	},

	{.pokemon_type = _("刺铠"),
	 .height = 7,
	 .weight = 290,
	 .pokedex_description1 = (pchar*)PokedexDes651,
	},

	{.pokemon_type = _("刺铠"),
	 .height = 16,
	 .weight = 900,
	 .pokedex_description1 = (pchar*)PokedexDes652,
	},

	{.pokemon_type = _("狐狸"),
	 .height = 4,
	 .weight = 94,
	 .pokedex_description1 = (pchar*)PokedexDes653,
	},

	{.pokemon_type = _("狐狸"),
	 .height = 10,
	 .weight = 145,
	 .pokedex_description1 = (pchar*)PokedexDes654,
	},

	{.pokemon_type = _("狐狸"),
	 .height = 15,
	 .weight = 390,
	 .pokedex_description1 = (pchar*)PokedexDes655,
	},

	{.pokemon_type = _("泡蛙"),
	 .height = 3,
	 .weight = 70,
	 .pokedex_description1 = (pchar*)PokedexDes656,
	},

	{.pokemon_type = _("泡蛙"),
	 .height = 6,
	 .weight = 109,
	 .pokedex_description1 = (pchar*)PokedexDes657,
	},

	{.pokemon_type = _("忍者"),
	 .height = 15,
	 .weight = 400,
	 .pokedex_description1 = (pchar*)PokedexDes658,
	},

	{.pokemon_type = _("挖洞"),
	 .height = 4,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes659,
	},

	{.pokemon_type = _("挖洞"),
	 .height = 10,
	 .weight = 424,
	 .pokedex_description1 = (pchar*)PokedexDes660,
	},

	{.pokemon_type = _("知更鸟"),
	 .height = 3,
	 .weight = 17,
	 .pokedex_description1 = (pchar*)PokedexDes661,
	},

	{.pokemon_type = _("火花"),
	 .height = 7,
	 .weight = 160,
	 .pokedex_description1 = (pchar*)PokedexDes662,
	},

	{.pokemon_type = _("烈火"),
	 .height = 12,
	 .weight = 245,
	 .pokedex_description1 = (pchar*)PokedexDes663,
	},

	{.pokemon_type = _("喷粉"),
	 .height = 3,
	 .weight = 25,
	 .pokedex_description1 = (pchar*)PokedexDes664,
	},

	{.pokemon_type = _("喷粉"),
	 .height = 3,
	 .weight = 84,
	 .pokedex_description1 = (pchar*)PokedexDes665,
	},

	{.pokemon_type = _("鳞粉"),
	 .height = 12,
	 .weight = 170,
	 .pokedex_description1 = (pchar*)PokedexDes666,
	},

	{.pokemon_type = _("幼狮"),
	 .height = 6,
	 .weight = 135,
	 .pokedex_description1 = (pchar*)PokedexDes667,
	},

	{.pokemon_type = _("王者"),
	 .height = 15,
	 .weight = 815,
	 .pokedex_description1 = (pchar*)PokedexDes668,
	},

	{.pokemon_type = _("单朵"),
	 .height = 1,
	 .weight = 1,
	 .pokedex_description1 = (pchar*)PokedexDes669,
	},

	{.pokemon_type = _("单朵"),
	 .height = 2,
	 .weight = 9,
	 .pokedex_description1 = (pchar*)PokedexDes670,
	},

	{.pokemon_type = _("花园"),
	 .height = 11,
	 .weight = 100,
	 .pokedex_description1 = (pchar*)PokedexDes671,
	},

	{.pokemon_type = _("坐骑"),
	 .height = 9,
	 .weight = 310,
	 .pokedex_description1 = (pchar*)PokedexDes672,
	},

	{.pokemon_type = _("坐骑"),
	 .height = 17,
	 .weight = 910,
	 .pokedex_description1 = (pchar*)PokedexDes673,
	},

	{.pokemon_type = _("顽皮"),
	 .height = 6,
	 .weight = 80,
	 .pokedex_description1 = (pchar*)PokedexDes674,
	},

	{.pokemon_type = _("恶颜"),
	 .height = 21,
	 .weight = 1360,
	 .pokedex_description1 = (pchar*)PokedexDes675,
	},

	{.pokemon_type = _("贵宾犬"),
	 .height = 12,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes676,
	},

	{.pokemon_type = _("自制"),
	 .height = 3,
	 .weight = 35,
	 .pokedex_description1 = (pchar*)PokedexDes677,
	},

	{.pokemon_type = _("抑制"),
	 .height = 6,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes678,
	},

	{.pokemon_type = _("刀剑"),
	 .height = 8,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes679,
	},

	{.pokemon_type = _("刀剑"),
	 .height = 8,
	 .weight = 45,
	 .pokedex_description1 = (pchar*)PokedexDes680,
	},

	{.pokemon_type = _("王剑"),
	 .height = 17,
	 .weight = 530,
	 .pokedex_description1 = (pchar*)PokedexDes681,
	},

	{.pokemon_type = _("香水"),
	 .height = 2,
	 .weight = 5,
	 .pokedex_description1 = (pchar*)PokedexDes682,
	},

	{.pokemon_type = _("芳香"),
	 .height = 8,
	 .weight = 155,
	 .pokedex_description1 = (pchar*)PokedexDes683,
	},

	{.pokemon_type = _("棉花糖"),
	 .height = 4,
	 .weight = 35,
	 .pokedex_description1 = (pchar*)PokedexDes684,
	},

	{.pokemon_type = _("泡沫奶油"),
	 .height = 8,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes685,
	},

	{.pokemon_type = _("回转"),
	 .height = 4,
	 .weight = 35,
	 .pokedex_description1 = (pchar*)PokedexDes686,
	},

	{.pokemon_type = _("倒转"),
	 .height = 15,
	 .weight = 470,
	 .pokedex_description1 = (pchar*)PokedexDes687,
	},

	{.pokemon_type = _("双手"),
	 .height = 5,
	 .weight = 310,
	 .pokedex_description1 = (pchar*)PokedexDes688,
	},

	{.pokemon_type = _("集合"),
	 .height = 13,
	 .weight = 960,
	 .pokedex_description1 = (pchar*)PokedexDes689,
	},

	{.pokemon_type = _("似草"),
	 .height = 5,
	 .weight = 73,
	 .pokedex_description1 = (pchar*)PokedexDes690,
	},

	{.pokemon_type = _("似草"),
	 .height = 18,
	 .weight = 815,
	 .pokedex_description1 = (pchar*)PokedexDes691,
	},

	{.pokemon_type = _("水枪"),
	 .height = 5,
	 .weight = 83,
	 .pokedex_description1 = (pchar*)PokedexDes692,
	},

	{.pokemon_type = _("发射器"),
	 .height = 13,
	 .weight = 353,
	 .pokedex_description1 = (pchar*)PokedexDes693,
	},

	{.pokemon_type = _("发电"),
	 .height = 5,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes694,
	},

	{.pokemon_type = _("发电"),
	 .height = 10,
	 .weight = 210,
	 .pokedex_description1 = (pchar*)PokedexDes695,
	},

	{.pokemon_type = _("幼君"),
	 .height = 8,
	 .weight = 260,
	 .pokedex_description1 = (pchar*)PokedexDes696,
	},

	{.pokemon_type = _("暴君"),
	 .height = 25,
	 .weight = 2700,
	 .pokedex_description1 = (pchar*)PokedexDes697,
	},

	{.pokemon_type = _("冻原"),
	 .height = 13,
	 .weight = 252,
	 .pokedex_description1 = (pchar*)PokedexDes698,
	},

	{.pokemon_type = _("冻原"),
	 .height = 27,
	 .weight = 2250,
	 .pokedex_description1 = (pchar*)PokedexDes699,
	},

	{.pokemon_type = _("连结"),
	 .height = 10,
	 .weight = 235,
	 .pokedex_description1 = (pchar*)PokedexDes700,
	},

	{.pokemon_type = _("摔角"),
	 .height = 8,
	 .weight = 215,
	 .pokedex_description1 = (pchar*)PokedexDes701,
	},

	{.pokemon_type = _("天线"),
	 .height = 2,
	 .weight = 22,
	 .pokedex_description1 = (pchar*)PokedexDes702,
	},

	{.pokemon_type = _("宝石"),
	 .height = 3,
	 .weight = 57,
	 .pokedex_description1 = (pchar*)PokedexDes703,
	},

	{.pokemon_type = _("软体生物"),
	 .height = 3,
	 .weight = 28,
	 .pokedex_description1 = (pchar*)PokedexDes704,
	},

	{.pokemon_type = _("软体生物"),
	 .height = 8,
	 .weight = 175,
	 .pokedex_description1 = (pchar*)PokedexDes705,
	},

	{.pokemon_type = _("龙"),
	 .height = 20,
	 .weight = 1505,
	 .pokedex_description1 = (pchar*)PokedexDes706,
	},

	{.pokemon_type = _("钥匙串"),
	 .height = 2,
	 .weight = 30,
	 .pokedex_description1 = (pchar*)PokedexDes707,
	},

	{.pokemon_type = _("树桩"),
	 .height = 4,
	 .weight = 70,
	 .pokedex_description1 = (pchar*)PokedexDes708,
	},

	{.pokemon_type = _("老树"),
	 .height = 15,
	 .weight = 710,
	 .pokedex_description1 = (pchar*)PokedexDes709,
	},

	{.pokemon_type = _("南瓜"),
	 .height = 4,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes710,
	},

	{.pokemon_type = _("南瓜"),
	 .height = 9,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes711,
	},

	{.pokemon_type = _("冰块"),
	 .height = 10,
	 .weight = 995,
	 .pokedex_description1 = (pchar*)PokedexDes712,
	},

	{.pokemon_type = _("冰山"),
	 .height = 20,
	 .weight = 5050,
	 .pokedex_description1 = (pchar*)PokedexDes713,
	},

	{.pokemon_type = _("音波"),
	 .height = 5,
	 .weight = 80,
	 .pokedex_description1 = (pchar*)PokedexDes714,
	},

	{.pokemon_type = _("音波"),
	 .height = 15,
	 .weight = 850,
	 .pokedex_description1 = (pchar*)PokedexDes715,
	},

	{.pokemon_type = _("生命"),
	 .height = 30,
	 .weight = 2150,
	 .pokedex_description1 = (pchar*)PokedexDes716,
	},

	{.pokemon_type = _("破坏"),
	 .height = 58,
	 .weight = 2030,
	 .pokedex_description1 = (pchar*)PokedexDes717,
	},

	{.pokemon_type = _("秩序"),
	 .height = 50,
	 .weight = 3050,
	 .pokedex_description1 = (pchar*)PokedexDes718,
	},

	{.pokemon_type = _("宝石"),
	 .height = 7,
	 .weight = 88,
	 .pokedex_description1 = (pchar*)PokedexDes719,
	},

	{.pokemon_type = _("顽童"),
	 .height = 5,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes720,
	},

	{.pokemon_type = _("蒸汽"),
	 .height = 17,
	 .weight = 1950,
	 .pokedex_description1 = (pchar*)PokedexDes721,
	},

	{.pokemon_type = _("草羽"),
	 .height = 3,
	 .weight = 15,
	 .pokedex_description1 = (pchar*)PokedexDes722,
	},

	{.pokemon_type = _("刃羽"),
	 .height = 7,
	 .weight = 160,
	 .pokedex_description1 = (pchar*)PokedexDes723,
	},

	{.pokemon_type = _("箭羽"),
	 .height = 16,
	 .weight = 366,
	 .pokedex_description1 = (pchar*)PokedexDes724,
	},

	{.pokemon_type = _("火猫"),
	 .height = 4,
	 .weight = 43,
	 .pokedex_description1 = (pchar*)PokedexDes725,
	},

	{.pokemon_type = _("火猫"),
	 .height = 7,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes726,
	},

	{.pokemon_type = _("反派"),
	 .height = 18,
	 .weight = 830,
	 .pokedex_description1 = (pchar*)PokedexDes727,
	},

	{.pokemon_type = _("海狮"),
	 .height = 4,
	 .weight = 75,
	 .pokedex_description1 = (pchar*)PokedexDes728,
	},

	{.pokemon_type = _("偶像"),
	 .height = 6,
	 .weight = 175,
	 .pokedex_description1 = (pchar*)PokedexDes729,
	},

	{.pokemon_type = _("独唱者"),
	 .height = 18,
	 .weight = 440,
	 .pokedex_description1 = (pchar*)PokedexDes730,
	},

	{.pokemon_type = _("啄木鸟"),
	 .height = 3,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes731,
	},

	{.pokemon_type = _("喇叭喙"),
	 .height = 6,
	 .weight = 148,
	 .pokedex_description1 = (pchar*)PokedexDes732,
	},

	{.pokemon_type = _("铳炮"),
	 .height = 11,
	 .weight = 260,
	 .pokedex_description1 = (pchar*)PokedexDes733,
	},

	{.pokemon_type = _("巡回"),
	 .height = 4,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes734,
	},

	{.pokemon_type = _("蹲守"),
	 .height = 7,
	 .weight = 142,
	 .pokedex_description1 = (pchar*)PokedexDes735,
	},

	{.pokemon_type = _("幼虫"),
	 .height = 4,
	 .weight = 44,
	 .pokedex_description1 = (pchar*)PokedexDes736,
	},

	{.pokemon_type = _("蓄电池"),
	 .height = 5,
	 .weight = 105,
	 .pokedex_description1 = (pchar*)PokedexDes737,
	},

	{.pokemon_type = _("锹形虫"),
	 .height = 15,
	 .weight = 450,
	 .pokedex_description1 = (pchar*)PokedexDes738,
	},

	{.pokemon_type = _("拳斗"),
	 .height = 6,
	 .weight = 70,
	 .pokedex_description1 = (pchar*)PokedexDes739,
	},

	{.pokemon_type = _("毛蟹"),
	 .height = 17,
	 .weight = 1800,
	 .pokedex_description1 = (pchar*)PokedexDes740,
	},

	{.pokemon_type = _("舞蹈"),
	 .height = 6,
	 .weight = 34,
	 .pokedex_description1 = (pchar*)PokedexDes741,
	},

	{.pokemon_type = _("蜂虻"),
	 .height = 1,
	 .weight = 2,
	 .pokedex_description1 = (pchar*)PokedexDes742,
	},

	{.pokemon_type = _("蜂虻"),
	 .height = 2,
	 .weight = 5,
	 .pokedex_description1 = (pchar*)PokedexDes743,
	},

	{.pokemon_type = _("小狗"),
	 .height = 5,
	 .weight = 92,
	 .pokedex_description1 = (pchar*)PokedexDes744,
	},

	{.pokemon_type = _("狼"),
	 .height = 8,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes745,
	},

	{.pokemon_type = _("小鱼"),
	 .height = 2,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes746,
	},

	{.pokemon_type = _("非星"),
	 .height = 4,
	 .weight = 80,
	 .pokedex_description1 = (pchar*)PokedexDes747,
	},

	{.pokemon_type = _("非星"),
	 .height = 7,
	 .weight = 145,
	 .pokedex_description1 = (pchar*)PokedexDes748,
	},

	{.pokemon_type = _("驴"),
	 .height = 10,
	 .weight = 1100,
	 .pokedex_description1 = (pchar*)PokedexDes749,
	},

	{.pokemon_type = _("挽马"),
	 .height = 25,
	 .weight = 9200,
	 .pokedex_description1 = (pchar*)PokedexDes750,
	},

	{.pokemon_type = _("水泡"),
	 .height = 3,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes751,
	},

	{.pokemon_type = _("水泡"),
	 .height = 18,
	 .weight = 820,
	 .pokedex_description1 = (pchar*)PokedexDes752,
	},

	{.pokemon_type = _("镰草"),
	 .height = 3,
	 .weight = 15,
	 .pokedex_description1 = (pchar*)PokedexDes753,
	},

	{.pokemon_type = _("花镰"),
	 .height = 9,
	 .weight = 185,
	 .pokedex_description1 = (pchar*)PokedexDes754,
	},

	{.pokemon_type = _("发光"),
	 .height = 2,
	 .weight = 15,
	 .pokedex_description1 = (pchar*)PokedexDes755,
	},

	{.pokemon_type = _("发光"),
	 .height = 10,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes756,
	},

	{.pokemon_type = _("毒蜥"),
	 .height = 6,
	 .weight = 48,
	 .pokedex_description1 = (pchar*)PokedexDes757,
	},

	{.pokemon_type = _("毒蜥"),
	 .height = 12,
	 .weight = 222,
	 .pokedex_description1 = (pchar*)PokedexDes758,
	},

	{.pokemon_type = _("抓狂"),
	 .height = 5,
	 .weight = 68,
	 .pokedex_description1 = (pchar*)PokedexDes759,
	},

	{.pokemon_type = _("强臂"),
	 .height = 21,
	 .weight = 1350,
	 .pokedex_description1 = (pchar*)PokedexDes760,
	},

	{.pokemon_type = _("水果"),
	 .height = 3,
	 .weight = 32,
	 .pokedex_description1 = (pchar*)PokedexDes761,
	},

	{.pokemon_type = _("水果"),
	 .height = 7,
	 .weight = 82,
	 .pokedex_description1 = (pchar*)PokedexDes762,
	},

	{.pokemon_type = _("水果"),
	 .height = 12,
	 .weight = 214,
	 .pokedex_description1 = (pchar*)PokedexDes763,
	},

	{.pokemon_type = _("摘花"),
	 .height = 1,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes764,
	},

	{.pokemon_type = _("贤者"),
	 .height = 15,
	 .weight = 760,
	 .pokedex_description1 = (pchar*)PokedexDes765,
	},

	{.pokemon_type = _("配合"),
	 .height = 20,
	 .weight = 828,
	 .pokedex_description1 = (pchar*)PokedexDes766,
	},

	{.pokemon_type = _("疾行"),
	 .height = 5,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes767,
	},

	{.pokemon_type = _("装甲"),
	 .height = 20,
	 .weight = 1080,
	 .pokedex_description1 = (pchar*)PokedexDes768,
	},

	{.pokemon_type = _("沙丘"),
	 .height = 5,
	 .weight = 700,
	 .pokedex_description1 = (pchar*)PokedexDes769,
	},

	{.pokemon_type = _("沙堡"),
	 .height = 13,
	 .weight = 2500,
	 .pokedex_description1 = (pchar*)PokedexDes770,
	},

	{.pokemon_type = _("海参"),
	 .height = 3,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes771,
	},

	{.pokemon_type = _("人工"),
	 .height = 19,
	 .weight = 1205,
	 .pokedex_description1 = (pchar*)PokedexDes772,
	},

	{.pokemon_type = _("人工"),
	 .height = 23,
	 .weight = 1005,
	 .pokedex_description1 = (pchar*)PokedexDes773,
	},

	{.pokemon_type = _("流星"),
	 .height = 3,
	 .weight = 400,
	 .pokedex_description1 = (pchar*)PokedexDes774,
	},

	{.pokemon_type = _("半梦半醒"),
	 .height = 4,
	 .weight = 199,
	 .pokedex_description1 = (pchar*)PokedexDes775,
	},

	{.pokemon_type = _("爆炸龟"),
	 .height = 20,
	 .weight = 2120,
	 .pokedex_description1 = (pchar*)PokedexDes776,
	},

	{.pokemon_type = _("蜷缩"),
	 .height = 3,
	 .weight = 33,
	 .pokedex_description1 = (pchar*)PokedexDes777,
	},

	{.pokemon_type = _("画皮"),
	 .height = 2,
	 .weight = 7,
	 .pokedex_description1 = (pchar*)PokedexDes778,
	},

	{.pokemon_type = _("磨牙"),
	 .height = 9,
	 .weight = 190,
	 .pokedex_description1 = (pchar*)PokedexDes779,
	},

	{.pokemon_type = _("悠游"),
	 .height = 30,
	 .weight = 1850,
	 .pokedex_description1 = (pchar*)PokedexDes780,
	},

	{.pokemon_type = _("碎藻"),
	 .height = 39,
	 .weight = 2100,
	 .pokedex_description1 = (pchar*)PokedexDes781,
	},

	{.pokemon_type = _("鳞片"),
	 .height = 6,
	 .weight = 297,
	 .pokedex_description1 = (pchar*)PokedexDes782,
	},

	{.pokemon_type = _("鳞片"),
	 .height = 12,
	 .weight = 470,
	 .pokedex_description1 = (pchar*)PokedexDes783,
	},

	{.pokemon_type = _("鳞片"),
	 .height = 16,
	 .weight = 782,
	 .pokedex_description1 = (pchar*)PokedexDes784,
	},

	{.pokemon_type = _("土地神"),
	 .height = 18,
	 .weight = 205,
	 .pokedex_description1 = (pchar*)PokedexDes785,
	},

	{.pokemon_type = _("土地神"),
	 .height = 12,
	 .weight = 186,
	 .pokedex_description1 = (pchar*)PokedexDes786,
	},

	{.pokemon_type = _("土地神"),
	 .height = 19,
	 .weight = 455,
	 .pokedex_description1 = (pchar*)PokedexDes787,
	},

	{.pokemon_type = _("土地神"),
	 .height = 13,
	 .weight = 212,
	 .pokedex_description1 = (pchar*)PokedexDes788,
	},

	{.pokemon_type = _("星云"),
	 .height = 2,
	 .weight = 1,
	 .pokedex_description1 = (pchar*)PokedexDes789,
	},

	{.pokemon_type = _("原始星"),
	 .height = 1,
	 .weight = 9999,
	 .pokedex_description1 = (pchar*)PokedexDes790,
	},

	{.pokemon_type = _("日轮"),
	 .height = 34,
	 .weight = 2300,
	 .pokedex_description1 = (pchar*)PokedexDes791,
	},

	{.pokemon_type = _("月轮"),
	 .height = 40,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes792,
	},

	{.pokemon_type = _("寄生"),
	 .height = 12,
	 .weight = 555,
	 .pokedex_description1 = (pchar*)PokedexDes793,
	},

	{.pokemon_type = _("膨胀"),
	 .height = 24,
	 .weight = 3336,
	 .pokedex_description1 = (pchar*)PokedexDes794,
	},

	{.pokemon_type = _("美艳"),
	 .height = 18,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes795,
	},

	{.pokemon_type = _("灯饰"),
	 .height = 38,
	 .weight = 1000,
	 .pokedex_description1 = (pchar*)PokedexDes796,
	},

	{.pokemon_type = _("发射"),
	 .height = 92,
	 .weight = 9999,
	 .pokedex_description1 = (pchar*)PokedexDes797,
	},

	{.pokemon_type = _("拔刀"),
	 .height = 3,
	 .weight = 1,
	 .pokedex_description1 = (pchar*)PokedexDes798,
	},

	{.pokemon_type = _("异食"),
	 .height = 55,
	 .weight = 8880,
	 .pokedex_description1 = (pchar*)PokedexDes799,
	},

	{.pokemon_type = _("棱镜"),
	 .height = 24,
	 .weight = 2300,
	 .pokedex_description1 = (pchar*)PokedexDes800,
	},

	{.pokemon_type = _("人造"),
	 .height = 10,
	 .weight = 805,
	 .pokedex_description1 = (pchar*)PokedexDes801,
	},

	{.pokemon_type = _("栖影"),
	 .height = 7,
	 .weight = 222,
	 .pokedex_description1 = (pchar*)PokedexDes802,
	},

	{.pokemon_type = _("毒针"),
	 .height = 6,
	 .weight = 18,
	 .pokedex_description1 = (pchar*)PokedexDes803,
	},

	{.pokemon_type = _("毒针"),
	 .height = 36,
	 .weight = 1500,
	 .pokedex_description1 = (pchar*)PokedexDes804,
	},

	{.pokemon_type = _("石墙"),
	 .height = 55,
	 .weight = 8200,
	 .pokedex_description1 = (pchar*)PokedexDes805,
	},

	{.pokemon_type = _("烟火"),
	 .height = 18,
	 .weight = 130,
	 .pokedex_description1 = (pchar*)PokedexDes806,
	},

	{.pokemon_type = _("奔雷"),
	 .height = 15,
	 .weight = 445,
	 .pokedex_description1 = (pchar*)PokedexDes807,
	}
};

#elif (LANGUAGE == ENGLISH)
const struct PokedexData dex_entries_new[] = {
	{.pokemon_type = _("Unknown"),
	 .height = 0,
	 .weight = 0,
	 .pokedex_description1 = (pchar*)PokedexUnknown,
	},

	{.pokemon_type = _("Seed"),
	 .height = 7,
	 .weight = 69,
	 .pokedex_description1 = (pchar*)PokedexDes1,
	},

	{.pokemon_type = _("Seed"),
	 .height = 10,
	 .weight = 130,
	 .pokedex_description1 = (pchar*)PokedexDes2,
	},

	{.pokemon_type = _("Seed"),
	 .height = 20,
	 .weight = 1000,
	 .pokedex_description1 = (pchar*)PokedexDes3,
	},

	{.pokemon_type = _("Lizard"),
	 .height = 6,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes4,
	},

	{.pokemon_type = _("Flame"),
	 .height = 11,
	 .weight = 190,
	 .pokedex_description1 = (pchar*)PokedexDes5,
	},

	{.pokemon_type = _("Flame"),
	 .height = 17,
	 .weight = 905,
	 .pokedex_description1 = (pchar*)PokedexDes6,
	},

	{.pokemon_type = _("TinyTurtle"),
	 .height = 5,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes7,
	},

	{.pokemon_type = _("Turtle"),
	 .height = 10,
	 .weight = 225,
	 .pokedex_description1 = (pchar*)PokedexDes8,
	},

	{.pokemon_type = _("Shellfish"),
	 .height = 16,
	 .weight = 855,
	 .pokedex_description1 = (pchar*)PokedexDes9,
	},

	{.pokemon_type = _("Worm"),
	 .height = 3,
	 .weight = 29,
	 .pokedex_description1 = (pchar*)PokedexDes10,
	},

	{.pokemon_type = _("Cocoon"),
	 .height = 7,
	 .weight = 99,
	 .pokedex_description1 = (pchar*)PokedexDes11,
	},

	{.pokemon_type = _("Butterfly"),
	 .height = 11,
	 .weight = 320,
	 .pokedex_description1 = (pchar*)PokedexDes12,
	},

	{.pokemon_type = _("HairyBug"),
	 .height = 3,
	 .weight = 32,
	 .pokedex_description1 = (pchar*)PokedexDes13,
	},

	{.pokemon_type = _("Cocoon"),
	 .height = 6,
	 .weight = 100,
	 .pokedex_description1 = (pchar*)PokedexDes14,
	},

	{.pokemon_type = _("PoisonBee"),
	 .height = 10,
	 .weight = 295,
	 .pokedex_description1 = (pchar*)PokedexDes15,
	},

	{.pokemon_type = _("TinyBird"),
	 .height = 3,
	 .weight = 18,
	 .pokedex_description1 = (pchar*)PokedexDes16,
	},

	{.pokemon_type = _("Bird"),
	 .height = 11,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes17,
	},

	{.pokemon_type = _("Bird"),
	 .height = 15,
	 .weight = 395,
	 .pokedex_description1 = (pchar*)PokedexDes18,
	},

	{.pokemon_type = _("Mouse"),
	 .height = 3,
	 .weight = 35,
	 .pokedex_description1 = (pchar*)PokedexDes19,
	},

	{.pokemon_type = _("Mouse"),
	 .height = 7,
	 .weight = 185,
	 .pokedex_description1 = (pchar*)PokedexDes20,
	},

	{.pokemon_type = _("TinyBird"),
	 .height = 3,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes21,
	},

	{.pokemon_type = _("Beak"),
	 .height = 12,
	 .weight = 380,
	 .pokedex_description1 = (pchar*)PokedexDes22,
	},

	{.pokemon_type = _("Snake"),
	 .height = 20,
	 .weight = 69,
	 .pokedex_description1 = (pchar*)PokedexDes23,
	},

	{.pokemon_type = _("Cobra"),
	 .height = 35,
	 .weight = 650,
	 .pokedex_description1 = (pchar*)PokedexDes24,
	},

	{.pokemon_type = _("Mouse"),
	 .height = 4,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes25,
	},

	{.pokemon_type = _("Mouse"),
	 .height = 8,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes26,
	},

	{.pokemon_type = _("Mouse"),
	 .height = 6,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes27,
	},

	{.pokemon_type = _("Mouse"),
	 .height = 10,
	 .weight = 295,
	 .pokedex_description1 = (pchar*)PokedexDes28,
	},

	{.pokemon_type = _("PoisonPin"),
	 .height = 4,
	 .weight = 70,
	 .pokedex_description1 = (pchar*)PokedexDes29,
	},

	{.pokemon_type = _("PoisonPin"),
	 .height = 8,
	 .weight = 200,
	 .pokedex_description1 = (pchar*)PokedexDes30,
	},

	{.pokemon_type = _("Drill"),
	 .height = 13,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes31,
	},

	{.pokemon_type = _("PoisonPin"),
	 .height = 5,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes32,
	},

	{.pokemon_type = _("PoisonPin"),
	 .height = 9,
	 .weight = 195,
	 .pokedex_description1 = (pchar*)PokedexDes33,
	},

	{.pokemon_type = _("Drill"),
	 .height = 14,
	 .weight = 620,
	 .pokedex_description1 = (pchar*)PokedexDes34,
	},

	{.pokemon_type = _("Fairy"),
	 .height = 6,
	 .weight = 75,
	 .pokedex_description1 = (pchar*)PokedexDes35,
	},

	{.pokemon_type = _("Fairy"),
	 .height = 13,
	 .weight = 400,
	 .pokedex_description1 = (pchar*)PokedexDes36,
	},

	{.pokemon_type = _("Fox"),
	 .height = 6,
	 .weight = 99,
	 .pokedex_description1 = (pchar*)PokedexDes37,
	},

	{.pokemon_type = _("Fox"),
	 .height = 11,
	 .weight = 199,
	 .pokedex_description1 = (pchar*)PokedexDes38,
	},

	{.pokemon_type = _("Balloon"),
	 .height = 5,
	 .weight = 55,
	 .pokedex_description1 = (pchar*)PokedexDes39,
	},

	{.pokemon_type = _("Balloon"),
	 .height = 10,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes40,
	},

	{.pokemon_type = _("Bat"),
	 .height = 8,
	 .weight = 75,
	 .pokedex_description1 = (pchar*)PokedexDes41,
	},

	{.pokemon_type = _("Bat"),
	 .height = 16,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes42,
	},

	{.pokemon_type = _("Weed"),
	 .height = 5,
	 .weight = 54,
	 .pokedex_description1 = (pchar*)PokedexDes43,
	},

	{.pokemon_type = _("Weed"),
	 .height = 8,
	 .weight = 86,
	 .pokedex_description1 = (pchar*)PokedexDes44,
	},

	{.pokemon_type = _("Flower"),
	 .height = 12,
	 .weight = 186,
	 .pokedex_description1 = (pchar*)PokedexDes45,
	},

	{.pokemon_type = _("Mushroom"),
	 .height = 3,
	 .weight = 54,
	 .pokedex_description1 = (pchar*)PokedexDes46,
	},

	{.pokemon_type = _("Mushroom"),
	 .height = 10,
	 .weight = 295,
	 .pokedex_description1 = (pchar*)PokedexDes47,
	},

	{.pokemon_type = _("Insect"),
	 .height = 10,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes48,
	},

	{.pokemon_type = _("PoisonMoth"),
	 .height = 15,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes49,
	},

	{.pokemon_type = _("Mole"),
	 .height = 2,
	 .weight = 8,
	 .pokedex_description1 = (pchar*)PokedexDes50,
	},

	{.pokemon_type = _("Mole"),
	 .height = 7,
	 .weight = 333,
	 .pokedex_description1 = (pchar*)PokedexDes51,
	},

	{.pokemon_type = _("ScratchCat"),
	 .height = 4,
	 .weight = 42,
	 .pokedex_description1 = (pchar*)PokedexDes52,
	},

	{.pokemon_type = _("ClassyCat"),
	 .height = 10,
	 .weight = 320,
	 .pokedex_description1 = (pchar*)PokedexDes53,
	},

	{.pokemon_type = _("Duck"),
	 .height = 8,
	 .weight = 196,
	 .pokedex_description1 = (pchar*)PokedexDes54,
	},

	{.pokemon_type = _("Duck"),
	 .height = 17,
	 .weight = 766,
	 .pokedex_description1 = (pchar*)PokedexDes55,
	},

	{.pokemon_type = _("PigMonkey"),
	 .height = 5,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes56,
	},

	{.pokemon_type = _("PigMonkey"),
	 .height = 10,
	 .weight = 320,
	 .pokedex_description1 = (pchar*)PokedexDes57,
	},

	{.pokemon_type = _("Puppy"),
	 .height = 7,
	 .weight = 190,
	 .pokedex_description1 = (pchar*)PokedexDes58,
	},

	{.pokemon_type = _("Legendary"),
	 .height = 19,
	 .weight = 1550,
	 .pokedex_description1 = (pchar*)PokedexDes59,
	},

	{.pokemon_type = _("Tadpole"),
	 .height = 6,
	 .weight = 124,
	 .pokedex_description1 = (pchar*)PokedexDes60,
	},

	{.pokemon_type = _("Tadpole"),
	 .height = 10,
	 .weight = 200,
	 .pokedex_description1 = (pchar*)PokedexDes61,
	},

	{.pokemon_type = _("Tadpole"),
	 .height = 13,
	 .weight = 540,
	 .pokedex_description1 = (pchar*)PokedexDes62,
	},

	{.pokemon_type = _("Psi"),
	 .height = 9,
	 .weight = 195,
	 .pokedex_description1 = (pchar*)PokedexDes63,
	},

	{.pokemon_type = _("Psi"),
	 .height = 13,
	 .weight = 565,
	 .pokedex_description1 = (pchar*)PokedexDes64,
	},

	{.pokemon_type = _("Psi"),
	 .height = 15,
	 .weight = 480,
	 .pokedex_description1 = (pchar*)PokedexDes65,
	},

	{.pokemon_type = _("Superpower"),
	 .height = 8,
	 .weight = 195,
	 .pokedex_description1 = (pchar*)PokedexDes66,
	},

	{.pokemon_type = _("Superpower"),
	 .height = 15,
	 .weight = 705,
	 .pokedex_description1 = (pchar*)PokedexDes67,
	},

	{.pokemon_type = _("Superpower"),
	 .height = 16,
	 .weight = 1300,
	 .pokedex_description1 = (pchar*)PokedexDes68,
	},

	{.pokemon_type = _("Flower"),
	 .height = 7,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes69,
	},

	{.pokemon_type = _("Flycatcher"),
	 .height = 10,
	 .weight = 64,
	 .pokedex_description1 = (pchar*)PokedexDes70,
	},

	{.pokemon_type = _("Flycatcher"),
	 .height = 17,
	 .weight = 155,
	 .pokedex_description1 = (pchar*)PokedexDes71,
	},

	{.pokemon_type = _("Jellyfish"),
	 .height = 9,
	 .weight = 455,
	 .pokedex_description1 = (pchar*)PokedexDes72,
	},

	{.pokemon_type = _("Jellyfish"),
	 .height = 16,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes73,
	},

	{.pokemon_type = _("Rock"),
	 .height = 4,
	 .weight = 200,
	 .pokedex_description1 = (pchar*)PokedexDes74,
	},

	{.pokemon_type = _("Rock"),
	 .height = 10,
	 .weight = 1050,
	 .pokedex_description1 = (pchar*)PokedexDes75,
	},

	{.pokemon_type = _("Megaton"),
	 .height = 14,
	 .weight = 3000,
	 .pokedex_description1 = (pchar*)PokedexDes76,
	},

	{.pokemon_type = _("FireHorse"),
	 .height = 10,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes77,
	},

	{.pokemon_type = _("FireHorse"),
	 .height = 17,
	 .weight = 950,
	 .pokedex_description1 = (pchar*)PokedexDes78,
	},

	{.pokemon_type = _("Dopey"),
	 .height = 12,
	 .weight = 360,
	 .pokedex_description1 = (pchar*)PokedexDes79,
	},

	{.pokemon_type = _("HermitCrab"),
	 .height = 16,
	 .weight = 785,
	 .pokedex_description1 = (pchar*)PokedexDes80,
	},

	{.pokemon_type = _("Magnet"),
	 .height = 3,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes81,
	},

	{.pokemon_type = _("Magnet"),
	 .height = 10,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes82,
	},

	{.pokemon_type = _("WildDuck"),
	 .height = 8,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes83,
	},

	{.pokemon_type = _("TwinBird"),
	 .height = 14,
	 .weight = 392,
	 .pokedex_description1 = (pchar*)PokedexDes84,
	},

	{.pokemon_type = _("TripleBird"),
	 .height = 18,
	 .weight = 852,
	 .pokedex_description1 = (pchar*)PokedexDes85,
	},

	{.pokemon_type = _("SeaLion"),
	 .height = 11,
	 .weight = 900,
	 .pokedex_description1 = (pchar*)PokedexDes86,
	},

	{.pokemon_type = _("SeaLion"),
	 .height = 17,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes87,
	},

	{.pokemon_type = _("Sludge"),
	 .height = 9,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes88,
	},

	{.pokemon_type = _("Sludge"),
	 .height = 12,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes89,
	},

	{.pokemon_type = _("Bivalve"),
	 .height = 3,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes90,
	},

	{.pokemon_type = _("Bivalve"),
	 .height = 15,
	 .weight = 1325,
	 .pokedex_description1 = (pchar*)PokedexDes91,
	},

	{.pokemon_type = _("Gas"),
	 .height = 13,
	 .weight = 1,
	 .pokedex_description1 = (pchar*)PokedexDes92,
	},

	{.pokemon_type = _("Gas"),
	 .height = 16,
	 .weight = 1,
	 .pokedex_description1 = (pchar*)PokedexDes93,
	},

	{.pokemon_type = _("Shadow"),
	 .height = 15,
	 .weight = 405,
	 .pokedex_description1 = (pchar*)PokedexDes94,
	},

	{.pokemon_type = _("RockSnake"),
	 .height = 88,
	 .weight = 2100,
	 .pokedex_description1 = (pchar*)PokedexDes95,
	},

	{.pokemon_type = _("Hypnosis"),
	 .height = 10,
	 .weight = 324,
	 .pokedex_description1 = (pchar*)PokedexDes96,
	},

	{.pokemon_type = _("Hypnosis"),
	 .height = 16,
	 .weight = 756,
	 .pokedex_description1 = (pchar*)PokedexDes97,
	},

	{.pokemon_type = _("RiverCrab"),
	 .height = 4,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes98,
	},

	{.pokemon_type = _("Pincer"),
	 .height = 13,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes99,
	},

	{.pokemon_type = _("Ball"),
	 .height = 5,
	 .weight = 104,
	 .pokedex_description1 = (pchar*)PokedexDes100,
	},

	{.pokemon_type = _("Ball"),
	 .height = 12,
	 .weight = 666,
	 .pokedex_description1 = (pchar*)PokedexDes101,
	},

	{.pokemon_type = _("Egg"),
	 .height = 4,
	 .weight = 25,
	 .pokedex_description1 = (pchar*)PokedexDes102,
	},

	{.pokemon_type = _("Coconut"),
	 .height = 20,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes103,
	},

	{.pokemon_type = _("Lonely"),
	 .height = 4,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes104,
	},

	{.pokemon_type = _("BoneKeeper"),
	 .height = 10,
	 .weight = 450,
	 .pokedex_description1 = (pchar*)PokedexDes105,
	},

	{.pokemon_type = _("Kicking"),
	 .height = 15,
	 .weight = 498,
	 .pokedex_description1 = (pchar*)PokedexDes106,
	},

	{.pokemon_type = _("Punching"),
	 .height = 14,
	 .weight = 502,
	 .pokedex_description1 = (pchar*)PokedexDes107,
	},

	{.pokemon_type = _("Licking"),
	 .height = 12,
	 .weight = 655,
	 .pokedex_description1 = (pchar*)PokedexDes108,
	},

	{.pokemon_type = _("PoisonGas"),
	 .height = 6,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes109,
	},

	{.pokemon_type = _("PoisonGas"),
	 .height = 12,
	 .weight = 95,
	 .pokedex_description1 = (pchar*)PokedexDes110,
	},

	{.pokemon_type = _("Spikes"),
	 .height = 10,
	 .weight = 1150,
	 .pokedex_description1 = (pchar*)PokedexDes111,
	},

	{.pokemon_type = _("Drill"),
	 .height = 19,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes112,
	},

	{.pokemon_type = _("Egg"),
	 .height = 11,
	 .weight = 346,
	 .pokedex_description1 = (pchar*)PokedexDes113,
	},

	{.pokemon_type = _("Vine"),
	 .height = 10,
	 .weight = 350,
	 .pokedex_description1 = (pchar*)PokedexDes114,
	},

	{.pokemon_type = _("Parent"),
	 .height = 22,
	 .weight = 800,
	 .pokedex_description1 = (pchar*)PokedexDes115,
	},

	{.pokemon_type = _("Dragon"),
	 .height = 4,
	 .weight = 80,
	 .pokedex_description1 = (pchar*)PokedexDes116,
	},

	{.pokemon_type = _("Dragon"),
	 .height = 12,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes117,
	},

	{.pokemon_type = _("Goldfish"),
	 .height = 6,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes118,
	},

	{.pokemon_type = _("Goldfish"),
	 .height = 13,
	 .weight = 390,
	 .pokedex_description1 = (pchar*)PokedexDes119,
	},

	{.pokemon_type = _("StarShape"),
	 .height = 8,
	 .weight = 345,
	 .pokedex_description1 = (pchar*)PokedexDes120,
	},

	{.pokemon_type = _("Mysterious"),
	 .height = 11,
	 .weight = 800,
	 .pokedex_description1 = (pchar*)PokedexDes121,
	},

	{.pokemon_type = _("Barrier"),
	 .height = 13,
	 .weight = 545,
	 .pokedex_description1 = (pchar*)PokedexDes122,
	},

	{.pokemon_type = _("Mantis"),
	 .height = 15,
	 .weight = 560,
	 .pokedex_description1 = (pchar*)PokedexDes123,
	},

	{.pokemon_type = _("HumanShape"),
	 .height = 14,
	 .weight = 406,
	 .pokedex_description1 = (pchar*)PokedexDes124,
	},

	{.pokemon_type = _("Electric"),
	 .height = 11,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes125,
	},

	{.pokemon_type = _("Spitfire"),
	 .height = 13,
	 .weight = 445,
	 .pokedex_description1 = (pchar*)PokedexDes126,
	},

	{.pokemon_type = _("StagBeetle"),
	 .height = 15,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes127,
	},

	{.pokemon_type = _("WildBull"),
	 .height = 14,
	 .weight = 884,
	 .pokedex_description1 = (pchar*)PokedexDes128,
	},

	{.pokemon_type = _("Fish"),
	 .height = 9,
	 .weight = 100,
	 .pokedex_description1 = (pchar*)PokedexDes129,
	},

	{.pokemon_type = _("Atrocious"),
	 .height = 65,
	 .weight = 2350,
	 .pokedex_description1 = (pchar*)PokedexDes130,
	},

	{.pokemon_type = _("Transport"),
	 .height = 25,
	 .weight = 2200,
	 .pokedex_description1 = (pchar*)PokedexDes131,
	},

	{.pokemon_type = _("Transform"),
	 .height = 3,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes132,
	},

	{.pokemon_type = _("Evolution"),
	 .height = 3,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes133,
	},

	{.pokemon_type = _("BubbleJet"),
	 .height = 10,
	 .weight = 290,
	 .pokedex_description1 = (pchar*)PokedexDes134,
	},

	{.pokemon_type = _("Lightning"),
	 .height = 8,
	 .weight = 245,
	 .pokedex_description1 = (pchar*)PokedexDes135,
	},

	{.pokemon_type = _("Flame"),
	 .height = 9,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes136,
	},

	{.pokemon_type = _("Virtual"),
	 .height = 8,
	 .weight = 365,
	 .pokedex_description1 = (pchar*)PokedexDes137,
	},

	{.pokemon_type = _("Spiral"),
	 .height = 4,
	 .weight = 75,
	 .pokedex_description1 = (pchar*)PokedexDes138,
	},

	{.pokemon_type = _("Spiral"),
	 .height = 10,
	 .weight = 350,
	 .pokedex_description1 = (pchar*)PokedexDes139,
	},

	{.pokemon_type = _("Shellfish"),
	 .height = 5,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes140,
	},

	{.pokemon_type = _("Shellfish"),
	 .height = 13,
	 .weight = 405,
	 .pokedex_description1 = (pchar*)PokedexDes141,
	},

	{.pokemon_type = _("Fossil"),
	 .height = 18,
	 .weight = 590,
	 .pokedex_description1 = (pchar*)PokedexDes142,
	},

	{.pokemon_type = _("Sleeping"),
	 .height = 21,
	 .weight = 4600,
	 .pokedex_description1 = (pchar*)PokedexDes143,
	},

	{.pokemon_type = _("Freeze"),
	 .height = 17,
	 .weight = 554,
	 .pokedex_description1 = (pchar*)PokedexDes144,
	},

	{.pokemon_type = _("Electric"),
	 .height = 16,
	 .weight = 526,
	 .pokedex_description1 = (pchar*)PokedexDes145,
	},

	{.pokemon_type = _("Flame"),
	 .height = 20,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes146,
	},

	{.pokemon_type = _("Dragon"),
	 .height = 18,
	 .weight = 33,
	 .pokedex_description1 = (pchar*)PokedexDes147,
	},

	{.pokemon_type = _("Dragon"),
	 .height = 40,
	 .weight = 165,
	 .pokedex_description1 = (pchar*)PokedexDes148,
	},

	{.pokemon_type = _("Dragon"),
	 .height = 22,
	 .weight = 2100,
	 .pokedex_description1 = (pchar*)PokedexDes149,
	},

	{.pokemon_type = _("Genetic"),
	 .height = 20,
	 .weight = 1220,
	 .pokedex_description1 = (pchar*)PokedexDes150,
	},

	{.pokemon_type = _("NewSpecies"),
	 .height = 4,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes151,
	},

	{.pokemon_type = _("Leaf"),
	 .height = 9,
	 .weight = 64,
	 .pokedex_description1 = (pchar*)PokedexDes152,
	},

	{.pokemon_type = _("Leaf"),
	 .height = 12,
	 .weight = 158,
	 .pokedex_description1 = (pchar*)PokedexDes153,
	},

	{.pokemon_type = _("Herb"),
	 .height = 18,
	 .weight = 1005,
	 .pokedex_description1 = (pchar*)PokedexDes154,
	},

	{.pokemon_type = _("FireMouse"),
	 .height = 5,
	 .weight = 79,
	 .pokedex_description1 = (pchar*)PokedexDes155,
	},

	{.pokemon_type = _("Volcano"),
	 .height = 9,
	 .weight = 190,
	 .pokedex_description1 = (pchar*)PokedexDes156,
	},

	{.pokemon_type = _("Volcano"),
	 .height = 17,
	 .weight = 795,
	 .pokedex_description1 = (pchar*)PokedexDes157,
	},

	{.pokemon_type = _("BigJaw"),
	 .height = 6,
	 .weight = 95,
	 .pokedex_description1 = (pchar*)PokedexDes158,
	},

	{.pokemon_type = _("BigJaw"),
	 .height = 11,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes159,
	},

	{.pokemon_type = _("BigJaw"),
	 .height = 23,
	 .weight = 888,
	 .pokedex_description1 = (pchar*)PokedexDes160,
	},

	{.pokemon_type = _("Scout"),
	 .height = 8,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes161,
	},

	{.pokemon_type = _("LongBody"),
	 .height = 18,
	 .weight = 325,
	 .pokedex_description1 = (pchar*)PokedexDes162,
	},

	{.pokemon_type = _("Owl"),
	 .height = 7,
	 .weight = 212,
	 .pokedex_description1 = (pchar*)PokedexDes163,
	},

	{.pokemon_type = _("Owl"),
	 .height = 16,
	 .weight = 408,
	 .pokedex_description1 = (pchar*)PokedexDes164,
	},

	{.pokemon_type = _("FiveStar"),
	 .height = 10,
	 .weight = 108,
	 .pokedex_description1 = (pchar*)PokedexDes165,
	},

	{.pokemon_type = _("FiveStar"),
	 .height = 14,
	 .weight = 356,
	 .pokedex_description1 = (pchar*)PokedexDes166,
	},

	{.pokemon_type = _("StringSpit"),
	 .height = 5,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes167,
	},

	{.pokemon_type = _("LongLeg"),
	 .height = 11,
	 .weight = 335,
	 .pokedex_description1 = (pchar*)PokedexDes168,
	},

	{.pokemon_type = _("Bat"),
	 .height = 18,
	 .weight = 750,
	 .pokedex_description1 = (pchar*)PokedexDes169,
	},

	{.pokemon_type = _("Angler"),
	 .height = 5,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes170,
	},

	{.pokemon_type = _("Light"),
	 .height = 12,
	 .weight = 225,
	 .pokedex_description1 = (pchar*)PokedexDes171,
	},

	{.pokemon_type = _("TinyMouse"),
	 .height = 3,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes172,
	},

	{.pokemon_type = _("StarShape"),
	 .height = 3,
	 .weight = 30,
	 .pokedex_description1 = (pchar*)PokedexDes173,
	},

	{.pokemon_type = _("Balloon"),
	 .height = 3,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes174,
	},

	{.pokemon_type = _("SpikeBall"),
	 .height = 3,
	 .weight = 15,
	 .pokedex_description1 = (pchar*)PokedexDes175,
	},

	{.pokemon_type = _("Happiness"),
	 .height = 6,
	 .weight = 32,
	 .pokedex_description1 = (pchar*)PokedexDes176,
	},

	{.pokemon_type = _("TinyBird"),
	 .height = 2,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes177,
	},

	{.pokemon_type = _("Mystic"),
	 .height = 15,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes178,
	},

	{.pokemon_type = _("Wool"),
	 .height = 6,
	 .weight = 78,
	 .pokedex_description1 = (pchar*)PokedexDes179,
	},

	{.pokemon_type = _("Wool"),
	 .height = 8,
	 .weight = 133,
	 .pokedex_description1 = (pchar*)PokedexDes180,
	},

	{.pokemon_type = _("Light"),
	 .height = 14,
	 .weight = 615,
	 .pokedex_description1 = (pchar*)PokedexDes181,
	},

	{.pokemon_type = _("Flower"),
	 .height = 4,
	 .weight = 58,
	 .pokedex_description1 = (pchar*)PokedexDes182,
	},

	{.pokemon_type = _("AquaMouse"),
	 .height = 4,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes183,
	},

	{.pokemon_type = _("AquaRabbit"),
	 .height = 8,
	 .weight = 285,
	 .pokedex_description1 = (pchar*)PokedexDes184,
	},

	{.pokemon_type = _("Imitation"),
	 .height = 12,
	 .weight = 380,
	 .pokedex_description1 = (pchar*)PokedexDes185,
	},

	{.pokemon_type = _("Frog"),
	 .height = 11,
	 .weight = 339,
	 .pokedex_description1 = (pchar*)PokedexDes186,
	},

	{.pokemon_type = _("Cottonweed"),
	 .height = 4,
	 .weight = 5,
	 .pokedex_description1 = (pchar*)PokedexDes187,
	},

	{.pokemon_type = _("Cottonweed"),
	 .height = 6,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes188,
	},

	{.pokemon_type = _("Cottonweed"),
	 .height = 8,
	 .weight = 30,
	 .pokedex_description1 = (pchar*)PokedexDes189,
	},

	{.pokemon_type = _("LongTail"),
	 .height = 8,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes190,
	},

	{.pokemon_type = _("Seed"),
	 .height = 3,
	 .weight = 18,
	 .pokedex_description1 = (pchar*)PokedexDes191,
	},

	{.pokemon_type = _("Sun"),
	 .height = 8,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes192,
	},

	{.pokemon_type = _("ClearWing"),
	 .height = 12,
	 .weight = 380,
	 .pokedex_description1 = (pchar*)PokedexDes193,
	},

	{.pokemon_type = _("WaterFish"),
	 .height = 4,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes194,
	},

	{.pokemon_type = _("WaterFish"),
	 .height = 14,
	 .weight = 750,
	 .pokedex_description1 = (pchar*)PokedexDes195,
	},

	{.pokemon_type = _("Sun"),
	 .height = 9,
	 .weight = 265,
	 .pokedex_description1 = (pchar*)PokedexDes196,
	},

	{.pokemon_type = _("Moonlight"),
	 .height = 10,
	 .weight = 270,
	 .pokedex_description1 = (pchar*)PokedexDes197,
	},

	{.pokemon_type = _("Darkness"),
	 .height = 5,
	 .weight = 21,
	 .pokedex_description1 = (pchar*)PokedexDes198,
	},

	{.pokemon_type = _("Royal"),
	 .height = 20,
	 .weight = 795,
	 .pokedex_description1 = (pchar*)PokedexDes199,
	},

	{.pokemon_type = _("Screech"),
	 .height = 7,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes200,
	},

	{.pokemon_type = _("Symbol"),
	 .height = 5,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes201,
	},

	{.pokemon_type = _("Patient"),
	 .height = 13,
	 .weight = 285,
	 .pokedex_description1 = (pchar*)PokedexDes202,
	},

	{.pokemon_type = _("LongNeck"),
	 .height = 15,
	 .weight = 415,
	 .pokedex_description1 = (pchar*)PokedexDes203,
	},

	{.pokemon_type = _("Bagworm"),
	 .height = 6,
	 .weight = 72,
	 .pokedex_description1 = (pchar*)PokedexDes204,
	},

	{.pokemon_type = _("Bagworm"),
	 .height = 12,
	 .weight = 1258,
	 .pokedex_description1 = (pchar*)PokedexDes205,
	},

	{.pokemon_type = _("LandSnake"),
	 .height = 15,
	 .weight = 140,
	 .pokedex_description1 = (pchar*)PokedexDes206,
	},

	{.pokemon_type = _("FlyScorpion"),
	 .height = 11,
	 .weight = 648,
	 .pokedex_description1 = (pchar*)PokedexDes207,
	},

	{.pokemon_type = _("IronSnake"),
	 .height = 92,
	 .weight = 4000,
	 .pokedex_description1 = (pchar*)PokedexDes208,
	},

	{.pokemon_type = _("Fairy"),
	 .height = 6,
	 .weight = 78,
	 .pokedex_description1 = (pchar*)PokedexDes209,
	},

	{.pokemon_type = _("Fairy"),
	 .height = 14,
	 .weight = 487,
	 .pokedex_description1 = (pchar*)PokedexDes210,
	},

	{.pokemon_type = _("Balloon"),
	 .height = 5,
	 .weight = 39,
	 .pokedex_description1 = (pchar*)PokedexDes211,
	},

	{.pokemon_type = _("Pincer"),
	 .height = 18,
	 .weight = 1180,
	 .pokedex_description1 = (pchar*)PokedexDes212,
	},

	{.pokemon_type = _("Mold"),
	 .height = 6,
	 .weight = 205,
	 .pokedex_description1 = (pchar*)PokedexDes213,
	},

	{.pokemon_type = _("SingleHorn"),
	 .height = 15,
	 .weight = 540,
	 .pokedex_description1 = (pchar*)PokedexDes214,
	},

	{.pokemon_type = _("SharpClaw"),
	 .height = 9,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes215,
	},

	{.pokemon_type = _("LittleBear"),
	 .height = 6,
	 .weight = 88,
	 .pokedex_description1 = (pchar*)PokedexDes216,
	},

	{.pokemon_type = _("Hibernator"),
	 .height = 18,
	 .weight = 1258,
	 .pokedex_description1 = (pchar*)PokedexDes217,
	},

	{.pokemon_type = _("Lava"),
	 .height = 7,
	 .weight = 350,
	 .pokedex_description1 = (pchar*)PokedexDes218,
	},

	{.pokemon_type = _("Lava"),
	 .height = 8,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes219,
	},

	{.pokemon_type = _("Pig"),
	 .height = 4,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes220,
	},

	{.pokemon_type = _("Swine"),
	 .height = 11,
	 .weight = 558,
	 .pokedex_description1 = (pchar*)PokedexDes221,
	},

	{.pokemon_type = _("Coral"),
	 .height = 6,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes222,
	},

	{.pokemon_type = _("Jet"),
	 .height = 6,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes223,
	},

	{.pokemon_type = _("Jet"),
	 .height = 9,
	 .weight = 285,
	 .pokedex_description1 = (pchar*)PokedexDes224,
	},

	{.pokemon_type = _("Delivery"),
	 .height = 9,
	 .weight = 160,
	 .pokedex_description1 = (pchar*)PokedexDes225,
	},

	{.pokemon_type = _("Kite"),
	 .height = 21,
	 .weight = 2200,
	 .pokedex_description1 = (pchar*)PokedexDes226,
	},

	{.pokemon_type = _("ArmorBird"),
	 .height = 17,
	 .weight = 505,
	 .pokedex_description1 = (pchar*)PokedexDes227,
	},

	{.pokemon_type = _("Dark"),
	 .height = 6,
	 .weight = 108,
	 .pokedex_description1 = (pchar*)PokedexDes228,
	},

	{.pokemon_type = _("Dark"),
	 .height = 14,
	 .weight = 350,
	 .pokedex_description1 = (pchar*)PokedexDes229,
	},

	{.pokemon_type = _("Dragon"),
	 .height = 18,
	 .weight = 1520,
	 .pokedex_description1 = (pchar*)PokedexDes230,
	},

	{.pokemon_type = _("LongNose"),
	 .height = 5,
	 .weight = 335,
	 .pokedex_description1 = (pchar*)PokedexDes231,
	},

	{.pokemon_type = _("Armor"),
	 .height = 11,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes232,
	},

	{.pokemon_type = _("Virtual"),
	 .height = 6,
	 .weight = 325,
	 .pokedex_description1 = (pchar*)PokedexDes233,
	},

	{.pokemon_type = _("BigHorn"),
	 .height = 14,
	 .weight = 712,
	 .pokedex_description1 = (pchar*)PokedexDes234,
	},

	{.pokemon_type = _("Painter"),
	 .height = 12,
	 .weight = 580,
	 .pokedex_description1 = (pchar*)PokedexDes235,
	},

	{.pokemon_type = _("Scuffle"),
	 .height = 7,
	 .weight = 210,
	 .pokedex_description1 = (pchar*)PokedexDes236,
	},

	{.pokemon_type = _("Handstand"),
	 .height = 14,
	 .weight = 480,
	 .pokedex_description1 = (pchar*)PokedexDes237,
	},

	{.pokemon_type = _("Kiss"),
	 .height = 4,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes238,
	},

	{.pokemon_type = _("Electric"),
	 .height = 6,
	 .weight = 235,
	 .pokedex_description1 = (pchar*)PokedexDes239,
	},

	{.pokemon_type = _("LiveCoal"),
	 .height = 7,
	 .weight = 214,
	 .pokedex_description1 = (pchar*)PokedexDes240,
	},

	{.pokemon_type = _("MilkCow"),
	 .height = 12,
	 .weight = 755,
	 .pokedex_description1 = (pchar*)PokedexDes241,
	},

	{.pokemon_type = _("Happiness"),
	 .height = 15,
	 .weight = 468,
	 .pokedex_description1 = (pchar*)PokedexDes242,
	},

	{.pokemon_type = _("Thunder"),
	 .height = 19,
	 .weight = 1780,
	 .pokedex_description1 = (pchar*)PokedexDes243,
	},

	{.pokemon_type = _("Volcano"),
	 .height = 21,
	 .weight = 1980,
	 .pokedex_description1 = (pchar*)PokedexDes244,
	},

	{.pokemon_type = _("Aurora"),
	 .height = 20,
	 .weight = 1870,
	 .pokedex_description1 = (pchar*)PokedexDes245,
	},

	{.pokemon_type = _("RockSkin"),
	 .height = 6,
	 .weight = 720,
	 .pokedex_description1 = (pchar*)PokedexDes246,
	},

	{.pokemon_type = _("HardShell"),
	 .height = 12,
	 .weight = 1520,
	 .pokedex_description1 = (pchar*)PokedexDes247,
	},

	{.pokemon_type = _("Armor"),
	 .height = 20,
	 .weight = 2020,
	 .pokedex_description1 = (pchar*)PokedexDes248,
	},

	{.pokemon_type = _("Diving"),
	 .height = 52,
	 .weight = 2160,
	 .pokedex_description1 = (pchar*)PokedexDes249,
	},

	{.pokemon_type = _("Rainbow"),
	 .height = 38,
	 .weight = 1990,
	 .pokedex_description1 = (pchar*)PokedexDes250,
	},

	{.pokemon_type = _("TimeTravel"),
	 .height = 6,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes251,
	},

	{.pokemon_type = _("WoodGecko"),
	 .height = 5,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes252,
	},

	{.pokemon_type = _("WoodGecko"),
	 .height = 9,
	 .weight = 216,
	 .pokedex_description1 = (pchar*)PokedexDes253,
	},

	{.pokemon_type = _("Forest"),
	 .height = 17,
	 .weight = 522,
	 .pokedex_description1 = (pchar*)PokedexDes254,
	},

	{.pokemon_type = _("Chick"),
	 .height = 4,
	 .weight = 25,
	 .pokedex_description1 = (pchar*)PokedexDes255,
	},

	{.pokemon_type = _("YoungFowl"),
	 .height = 9,
	 .weight = 195,
	 .pokedex_description1 = (pchar*)PokedexDes256,
	},

	{.pokemon_type = _("Blaze"),
	 .height = 19,
	 .weight = 520,
	 .pokedex_description1 = (pchar*)PokedexDes257,
	},

	{.pokemon_type = _("MudFish"),
	 .height = 4,
	 .weight = 76,
	 .pokedex_description1 = (pchar*)PokedexDes258,
	},

	{.pokemon_type = _("MudFish"),
	 .height = 7,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes259,
	},

	{.pokemon_type = _("MudFish"),
	 .height = 15,
	 .weight = 819,
	 .pokedex_description1 = (pchar*)PokedexDes260,
	},

	{.pokemon_type = _("Bite"),
	 .height = 5,
	 .weight = 136,
	 .pokedex_description1 = (pchar*)PokedexDes261,
	},

	{.pokemon_type = _("Bite"),
	 .height = 10,
	 .weight = 370,
	 .pokedex_description1 = (pchar*)PokedexDes262,
	},

	{.pokemon_type = _("TinyRaccoon"),
	 .height = 4,
	 .weight = 175,
	 .pokedex_description1 = (pchar*)PokedexDes263,
	},

	{.pokemon_type = _("Rushing"),
	 .height = 5,
	 .weight = 325,
	 .pokedex_description1 = (pchar*)PokedexDes264,
	},

	{.pokemon_type = _("Worm"),
	 .height = 3,
	 .weight = 36,
	 .pokedex_description1 = (pchar*)PokedexDes265,
	},

	{.pokemon_type = _("Cocoon"),
	 .height = 6,
	 .weight = 100,
	 .pokedex_description1 = (pchar*)PokedexDes266,
	},

	{.pokemon_type = _("Butterfly"),
	 .height = 10,
	 .weight = 284,
	 .pokedex_description1 = (pchar*)PokedexDes267,
	},

	{.pokemon_type = _("Cocoon"),
	 .height = 7,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes268,
	},

	{.pokemon_type = _("PoisonMoth"),
	 .height = 12,
	 .weight = 316,
	 .pokedex_description1 = (pchar*)PokedexDes269,
	},

	{.pokemon_type = _("WaterWeed"),
	 .height = 5,
	 .weight = 26,
	 .pokedex_description1 = (pchar*)PokedexDes270,
	},

	{.pokemon_type = _("Jolly"),
	 .height = 12,
	 .weight = 325,
	 .pokedex_description1 = (pchar*)PokedexDes271,
	},

	{.pokemon_type = _("Carefree"),
	 .height = 15,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes272,
	},

	{.pokemon_type = _("Acorn"),
	 .height = 5,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes273,
	},

	{.pokemon_type = _("Wily"),
	 .height = 10,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes274,
	},

	{.pokemon_type = _("Wicked"),
	 .height = 13,
	 .weight = 596,
	 .pokedex_description1 = (pchar*)PokedexDes275,
	},

	{.pokemon_type = _("TinySwallow"),
	 .height = 3,
	 .weight = 23,
	 .pokedex_description1 = (pchar*)PokedexDes276,
	},

	{.pokemon_type = _("Swallow"),
	 .height = 7,
	 .weight = 198,
	 .pokedex_description1 = (pchar*)PokedexDes277,
	},

	{.pokemon_type = _("Seagull"),
	 .height = 6,
	 .weight = 95,
	 .pokedex_description1 = (pchar*)PokedexDes278,
	},

	{.pokemon_type = _("WaterBird"),
	 .height = 12,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes279,
	},

	{.pokemon_type = _("Feeling"),
	 .height = 4,
	 .weight = 66,
	 .pokedex_description1 = (pchar*)PokedexDes280,
	},

	{.pokemon_type = _("Emotion"),
	 .height = 8,
	 .weight = 202,
	 .pokedex_description1 = (pchar*)PokedexDes281,
	},

	{.pokemon_type = _("Embrace"),
	 .height = 16,
	 .weight = 484,
	 .pokedex_description1 = (pchar*)PokedexDes282,
	},

	{.pokemon_type = _("PondSkater"),
	 .height = 5,
	 .weight = 17,
	 .pokedex_description1 = (pchar*)PokedexDes283,
	},

	{.pokemon_type = _("Eyeball"),
	 .height = 8,
	 .weight = 36,
	 .pokedex_description1 = (pchar*)PokedexDes284,
	},

	{.pokemon_type = _("Mushroom"),
	 .height = 4,
	 .weight = 45,
	 .pokedex_description1 = (pchar*)PokedexDes285,
	},

	{.pokemon_type = _("Mushroom"),
	 .height = 12,
	 .weight = 392,
	 .pokedex_description1 = (pchar*)PokedexDes286,
	},

	{.pokemon_type = _("Slacker"),
	 .height = 8,
	 .weight = 240,
	 .pokedex_description1 = (pchar*)PokedexDes287,
	},

	{.pokemon_type = _("WildMonkey"),
	 .height = 14,
	 .weight = 465,
	 .pokedex_description1 = (pchar*)PokedexDes288,
	},

	{.pokemon_type = _("Lazy"),
	 .height = 20,
	 .weight = 1305,
	 .pokedex_description1 = (pchar*)PokedexDes289,
	},

	{.pokemon_type = _("Trainee"),
	 .height = 5,
	 .weight = 55,
	 .pokedex_description1 = (pchar*)PokedexDes290,
	},

	{.pokemon_type = _("Ninja"),
	 .height = 8,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes291,
	},

	{.pokemon_type = _("Shed"),
	 .height = 8,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes292,
	},

	{.pokemon_type = _("Whisper"),
	 .height = 6,
	 .weight = 163,
	 .pokedex_description1 = (pchar*)PokedexDes293,
	},

	{.pokemon_type = _("BigVoice"),
	 .height = 10,
	 .weight = 405,
	 .pokedex_description1 = (pchar*)PokedexDes294,
	},

	{.pokemon_type = _("LoudNoise"),
	 .height = 15,
	 .weight = 840,
	 .pokedex_description1 = (pchar*)PokedexDes295,
	},

	{.pokemon_type = _("Guts"),
	 .height = 10,
	 .weight = 864,
	 .pokedex_description1 = (pchar*)PokedexDes296,
	},

	{.pokemon_type = _("ArmThrust"),
	 .height = 23,
	 .weight = 2538,
	 .pokedex_description1 = (pchar*)PokedexDes297,
	},

	{.pokemon_type = _("PolkaDot"),
	 .height = 2,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes298,
	},

	{.pokemon_type = _("Compass"),
	 .height = 10,
	 .weight = 970,
	 .pokedex_description1 = (pchar*)PokedexDes299,
	},

	{.pokemon_type = _("Kitten"),
	 .height = 6,
	 .weight = 110,
	 .pokedex_description1 = (pchar*)PokedexDes300,
	},

	{.pokemon_type = _("Prim"),
	 .height = 11,
	 .weight = 326,
	 .pokedex_description1 = (pchar*)PokedexDes301,
	},

	{.pokemon_type = _("Darkness"),
	 .height = 5,
	 .weight = 110,
	 .pokedex_description1 = (pchar*)PokedexDes302,
	},

	{.pokemon_type = _("Deceiver"),
	 .height = 6,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes303,
	},

	{.pokemon_type = _("IronArmor"),
	 .height = 4,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes304,
	},

	{.pokemon_type = _("IronArmor"),
	 .height = 9,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes305,
	},

	{.pokemon_type = _("IronArmor"),
	 .height = 21,
	 .weight = 3600,
	 .pokedex_description1 = (pchar*)PokedexDes306,
	},

	{.pokemon_type = _("Meditate"),
	 .height = 6,
	 .weight = 112,
	 .pokedex_description1 = (pchar*)PokedexDes307,
	},

	{.pokemon_type = _("Meditate"),
	 .height = 13,
	 .weight = 315,
	 .pokedex_description1 = (pchar*)PokedexDes308,
	},

	{.pokemon_type = _("Lightning"),
	 .height = 6,
	 .weight = 152,
	 .pokedex_description1 = (pchar*)PokedexDes309,
	},

	{.pokemon_type = _("Discharge"),
	 .height = 15,
	 .weight = 402,
	 .pokedex_description1 = (pchar*)PokedexDes310,
	},

	{.pokemon_type = _("Cheering"),
	 .height = 4,
	 .weight = 42,
	 .pokedex_description1 = (pchar*)PokedexDes311,
	},

	{.pokemon_type = _("Cheering"),
	 .height = 4,
	 .weight = 42,
	 .pokedex_description1 = (pchar*)PokedexDes312,
	},

	{.pokemon_type = _("Firefly"),
	 .height = 7,
	 .weight = 177,
	 .pokedex_description1 = (pchar*)PokedexDes313,
	},

	{.pokemon_type = _("Firefly"),
	 .height = 6,
	 .weight = 177,
	 .pokedex_description1 = (pchar*)PokedexDes314,
	},

	{.pokemon_type = _("Thorn"),
	 .height = 3,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes315,
	},

	{.pokemon_type = _("Stomach"),
	 .height = 4,
	 .weight = 103,
	 .pokedex_description1 = (pchar*)PokedexDes316,
	},

	{.pokemon_type = _("PoisonBag"),
	 .height = 17,
	 .weight = 800,
	 .pokedex_description1 = (pchar*)PokedexDes317,
	},

	{.pokemon_type = _("Savage"),
	 .height = 8,
	 .weight = 208,
	 .pokedex_description1 = (pchar*)PokedexDes318,
	},

	{.pokemon_type = _("Brutal"),
	 .height = 18,
	 .weight = 888,
	 .pokedex_description1 = (pchar*)PokedexDes319,
	},

	{.pokemon_type = _("BallWhale"),
	 .height = 20,
	 .weight = 1300,
	 .pokedex_description1 = (pchar*)PokedexDes320,
	},

	{.pokemon_type = _("FloatWhale"),
	 .height = 145,
	 .weight = 3980,
	 .pokedex_description1 = (pchar*)PokedexDes321,
	},

	{.pokemon_type = _("Numb"),
	 .height = 7,
	 .weight = 240,
	 .pokedex_description1 = (pchar*)PokedexDes322,
	},

	{.pokemon_type = _("Eruption"),
	 .height = 19,
	 .weight = 2200,
	 .pokedex_description1 = (pchar*)PokedexDes323,
	},

	{.pokemon_type = _("Coal"),
	 .height = 5,
	 .weight = 804,
	 .pokedex_description1 = (pchar*)PokedexDes324,
	},

	{.pokemon_type = _("Bounce"),
	 .height = 7,
	 .weight = 306,
	 .pokedex_description1 = (pchar*)PokedexDes325,
	},

	{.pokemon_type = _("Manipulate"),
	 .height = 9,
	 .weight = 715,
	 .pokedex_description1 = (pchar*)PokedexDes326,
	},

	{.pokemon_type = _("SpotPanda"),
	 .height = 11,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes327,
	},

	{.pokemon_type = _("AntPit"),
	 .height = 7,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes328,
	},

	{.pokemon_type = _("Vibration"),
	 .height = 11,
	 .weight = 153,
	 .pokedex_description1 = (pchar*)PokedexDes329,
	},

	{.pokemon_type = _("Mystic"),
	 .height = 20,
	 .weight = 820,
	 .pokedex_description1 = (pchar*)PokedexDes330,
	},

	{.pokemon_type = _("Cactus"),
	 .height = 4,
	 .weight = 513,
	 .pokedex_description1 = (pchar*)PokedexDes331,
	},

	{.pokemon_type = _("Scarecrow"),
	 .height = 13,
	 .weight = 774,
	 .pokedex_description1 = (pchar*)PokedexDes332,
	},

	{.pokemon_type = _("CottonBird"),
	 .height = 4,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes333,
	},

	{.pokemon_type = _("Humming"),
	 .height = 11,
	 .weight = 206,
	 .pokedex_description1 = (pchar*)PokedexDes334,
	},

	{.pokemon_type = _("CatFerret"),
	 .height = 13,
	 .weight = 403,
	 .pokedex_description1 = (pchar*)PokedexDes335,
	},

	{.pokemon_type = _("FangSnake"),
	 .height = 27,
	 .weight = 525,
	 .pokedex_description1 = (pchar*)PokedexDes336,
	},

	{.pokemon_type = _("Meteorite"),
	 .height = 10,
	 .weight = 1680,
	 .pokedex_description1 = (pchar*)PokedexDes337,
	},

	{.pokemon_type = _("Meteorite"),
	 .height = 12,
	 .weight = 1540,
	 .pokedex_description1 = (pchar*)PokedexDes338,
	},

	{.pokemon_type = _("Whiskers"),
	 .height = 4,
	 .weight = 19,
	 .pokedex_description1 = (pchar*)PokedexDes339,
	},

	{.pokemon_type = _("Whiskers"),
	 .height = 9,
	 .weight = 236,
	 .pokedex_description1 = (pchar*)PokedexDes340,
	},

	{.pokemon_type = _("Ruffian"),
	 .height = 6,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes341,
	},

	{.pokemon_type = _("Rogue"),
	 .height = 11,
	 .weight = 328,
	 .pokedex_description1 = (pchar*)PokedexDes342,
	},

	{.pokemon_type = _("ClayDoll"),
	 .height = 5,
	 .weight = 215,
	 .pokedex_description1 = (pchar*)PokedexDes343,
	},

	{.pokemon_type = _("ClayDoll"),
	 .height = 15,
	 .weight = 1080,
	 .pokedex_description1 = (pchar*)PokedexDes344,
	},

	{.pokemon_type = _("SeaLily"),
	 .height = 10,
	 .weight = 238,
	 .pokedex_description1 = (pchar*)PokedexDes345,
	},

	{.pokemon_type = _("Barnacle"),
	 .height = 15,
	 .weight = 604,
	 .pokedex_description1 = (pchar*)PokedexDes346,
	},

	{.pokemon_type = _("OldShrimp"),
	 .height = 7,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes347,
	},

	{.pokemon_type = _("Plate"),
	 .height = 15,
	 .weight = 682,
	 .pokedex_description1 = (pchar*)PokedexDes348,
	},

	{.pokemon_type = _("Fish"),
	 .height = 6,
	 .weight = 74,
	 .pokedex_description1 = (pchar*)PokedexDes349,
	},

	{.pokemon_type = _("Tender"),
	 .height = 62,
	 .weight = 1620,
	 .pokedex_description1 = (pchar*)PokedexDes350,
	},

	{.pokemon_type = _("Weather"),
	 .height = 3,
	 .weight = 8,
	 .pokedex_description1 = (pchar*)PokedexDes351,
	},

	{.pokemon_type = _("ColorSwap"),
	 .height = 10,
	 .weight = 220,
	 .pokedex_description1 = (pchar*)PokedexDes352,
	},

	{.pokemon_type = _("Puppet"),
	 .height = 6,
	 .weight = 23,
	 .pokedex_description1 = (pchar*)PokedexDes353,
	},

	{.pokemon_type = _("Marionette"),
	 .height = 11,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes354,
	},

	{.pokemon_type = _("Requiem"),
	 .height = 8,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes355,
	},

	{.pokemon_type = _("Beckon"),
	 .height = 16,
	 .weight = 306,
	 .pokedex_description1 = (pchar*)PokedexDes356,
	},

	{.pokemon_type = _("Fruit"),
	 .height = 20,
	 .weight = 1000,
	 .pokedex_description1 = (pchar*)PokedexDes357,
	},

	{.pokemon_type = _("WindChime"),
	 .height = 6,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes358,
	},

	{.pokemon_type = _("Disaster"),
	 .height = 12,
	 .weight = 470,
	 .pokedex_description1 = (pchar*)PokedexDes359,
	},

	{.pokemon_type = _("Bright"),
	 .height = 6,
	 .weight = 140,
	 .pokedex_description1 = (pchar*)PokedexDes360,
	},

	{.pokemon_type = _("SnowHat"),
	 .height = 7,
	 .weight = 168,
	 .pokedex_description1 = (pchar*)PokedexDes361,
	},

	{.pokemon_type = _("Face"),
	 .height = 15,
	 .weight = 2565,
	 .pokedex_description1 = (pchar*)PokedexDes362,
	},

	{.pokemon_type = _("Clap"),
	 .height = 8,
	 .weight = 395,
	 .pokedex_description1 = (pchar*)PokedexDes363,
	},

	{.pokemon_type = _("BallRoll"),
	 .height = 11,
	 .weight = 876,
	 .pokedex_description1 = (pchar*)PokedexDes364,
	},

	{.pokemon_type = _("IceBreak"),
	 .height = 14,
	 .weight = 1506,
	 .pokedex_description1 = (pchar*)PokedexDes365,
	},

	{.pokemon_type = _("Bivalve"),
	 .height = 4,
	 .weight = 525,
	 .pokedex_description1 = (pchar*)PokedexDes366,
	},

	{.pokemon_type = _("DeepSea"),
	 .height = 17,
	 .weight = 270,
	 .pokedex_description1 = (pchar*)PokedexDes367,
	},

	{.pokemon_type = _("SouthSea"),
	 .height = 18,
	 .weight = 226,
	 .pokedex_description1 = (pchar*)PokedexDes368,
	},

	{.pokemon_type = _("Longevity"),
	 .height = 10,
	 .weight = 234,
	 .pokedex_description1 = (pchar*)PokedexDes369,
	},

	{.pokemon_type = _("Rendezvous"),
	 .height = 6,
	 .weight = 87,
	 .pokedex_description1 = (pchar*)PokedexDes370,
	},

	{.pokemon_type = _("RockHead"),
	 .height = 6,
	 .weight = 421,
	 .pokedex_description1 = (pchar*)PokedexDes371,
	},

	{.pokemon_type = _("Endurance"),
	 .height = 11,
	 .weight = 1105,
	 .pokedex_description1 = (pchar*)PokedexDes372,
	},

	{.pokemon_type = _("Dragon"),
	 .height = 15,
	 .weight = 1026,
	 .pokedex_description1 = (pchar*)PokedexDes373,
	},

	{.pokemon_type = _("IronBall"),
	 .height = 6,
	 .weight = 952,
	 .pokedex_description1 = (pchar*)PokedexDes374,
	},

	{.pokemon_type = _("IronClaw"),
	 .height = 12,
	 .weight = 2025,
	 .pokedex_description1 = (pchar*)PokedexDes375,
	},

	{.pokemon_type = _("IronLeg"),
	 .height = 16,
	 .weight = 5500,
	 .pokedex_description1 = (pchar*)PokedexDes376,
	},

	{.pokemon_type = _("RockPeak"),
	 .height = 17,
	 .weight = 2300,
	 .pokedex_description1 = (pchar*)PokedexDes377,
	},

	{.pokemon_type = _("Iceberg"),
	 .height = 18,
	 .weight = 1750,
	 .pokedex_description1 = (pchar*)PokedexDes378,
	},

	{.pokemon_type = _("Iron"),
	 .height = 19,
	 .weight = 2050,
	 .pokedex_description1 = (pchar*)PokedexDes379,
	},

	{.pokemon_type = _("Eon"),
	 .height = 14,
	 .weight = 400,
	 .pokedex_description1 = (pchar*)PokedexDes380,
	},

	{.pokemon_type = _("Eon"),
	 .height = 20,
	 .weight = 600,
	 .pokedex_description1 = (pchar*)PokedexDes381,
	},

	{.pokemon_type = _("SeaBasin"),
	 .height = 45,
	 .weight = 3520,
	 .pokedex_description1 = (pchar*)PokedexDes382,
	},

	{.pokemon_type = _("Continent"),
	 .height = 35,
	 .weight = 9500,
	 .pokedex_description1 = (pchar*)PokedexDes383,
	},

	{.pokemon_type = _("SkyHigh"),
	 .height = 70,
	 .weight = 2065,
	 .pokedex_description1 = (pchar*)PokedexDes384,
	},

	{.pokemon_type = _("Wish"),
	 .height = 3,
	 .weight = 11,
	 .pokedex_description1 = (pchar*)PokedexDes385,
	},

	{.pokemon_type = _("DNA"),
	 .height = 17,
	 .weight = 608,
	 .pokedex_description1 = (pchar*)PokedexDes386,
	},

	{.pokemon_type = _("TinyLeaf"),
	 .height = 4,
	 .weight = 102,
	 .pokedex_description1 = (pchar*)PokedexDes387,
	},

	{.pokemon_type = _("Grove"),
	 .height = 11,
	 .weight = 970,
	 .pokedex_description1 = (pchar*)PokedexDes388,
	},

	{.pokemon_type = _("Continent"),
	 .height = 22,
	 .weight = 3100,
	 .pokedex_description1 = (pchar*)PokedexDes389,
	},

	{.pokemon_type = _("Chimp"),
	 .height = 5,
	 .weight = 62,
	 .pokedex_description1 = (pchar*)PokedexDes390,
	},

	{.pokemon_type = _("Playful"),
	 .height = 9,
	 .weight = 220,
	 .pokedex_description1 = (pchar*)PokedexDes391,
	},

	{.pokemon_type = _("Flame"),
	 .height = 12,
	 .weight = 550,
	 .pokedex_description1 = (pchar*)PokedexDes392,
	},

	{.pokemon_type = _("Penguin"),
	 .height = 4,
	 .weight = 52,
	 .pokedex_description1 = (pchar*)PokedexDes393,
	},

	{.pokemon_type = _("Penguin"),
	 .height = 8,
	 .weight = 230,
	 .pokedex_description1 = (pchar*)PokedexDes394,
	},

	{.pokemon_type = _("Emperor"),
	 .height = 17,
	 .weight = 845,
	 .pokedex_description1 = (pchar*)PokedexDes395,
	},

	{.pokemon_type = _("Starling"),
	 .height = 3,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes396,
	},

	{.pokemon_type = _("Starling"),
	 .height = 6,
	 .weight = 155,
	 .pokedex_description1 = (pchar*)PokedexDes397,
	},

	{.pokemon_type = _("Predator"),
	 .height = 12,
	 .weight = 249,
	 .pokedex_description1 = (pchar*)PokedexDes398,
	},

	{.pokemon_type = _("PlumpMouse"),
	 .height = 5,
	 .weight = 200,
	 .pokedex_description1 = (pchar*)PokedexDes399,
	},

	{.pokemon_type = _("Beaver"),
	 .height = 10,
	 .weight = 315,
	 .pokedex_description1 = (pchar*)PokedexDes400,
	},

	{.pokemon_type = _("Cricket"),
	 .height = 3,
	 .weight = 22,
	 .pokedex_description1 = (pchar*)PokedexDes401,
	},

	{.pokemon_type = _("Cricket"),
	 .height = 10,
	 .weight = 255,
	 .pokedex_description1 = (pchar*)PokedexDes402,
	},

	{.pokemon_type = _("Flash"),
	 .height = 5,
	 .weight = 95,
	 .pokedex_description1 = (pchar*)PokedexDes403,
	},

	{.pokemon_type = _("Spark"),
	 .height = 9,
	 .weight = 305,
	 .pokedex_description1 = (pchar*)PokedexDes404,
	},

	{.pokemon_type = _("GleamEyes"),
	 .height = 14,
	 .weight = 420,
	 .pokedex_description1 = (pchar*)PokedexDes405,
	},

	{.pokemon_type = _("Bud"),
	 .height = 2,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes406,
	},

	{.pokemon_type = _("Bouquet"),
	 .height = 9,
	 .weight = 145,
	 .pokedex_description1 = (pchar*)PokedexDes407,
	},

	{.pokemon_type = _("HeadButt"),
	 .height = 9,
	 .weight = 315,
	 .pokedex_description1 = (pchar*)PokedexDes408,
	},

	{.pokemon_type = _("HeadButt"),
	 .height = 16,
	 .weight = 1025,
	 .pokedex_description1 = (pchar*)PokedexDes409,
	},

	{.pokemon_type = _("Shield"),
	 .height = 5,
	 .weight = 570,
	 .pokedex_description1 = (pchar*)PokedexDes410,
	},

	{.pokemon_type = _("Shield"),
	 .height = 13,
	 .weight = 1495,
	 .pokedex_description1 = (pchar*)PokedexDes411,
	},

	{.pokemon_type = _("Bagworm"),
	 .height = 2,
	 .weight = 34,
	 .pokedex_description1 = (pchar*)PokedexDes412,
	},

	{.pokemon_type = _("Bagworm"),
	 .height = 5,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes413,
	},

	{.pokemon_type = _("Moth"),
	 .height = 9,
	 .weight = 233,
	 .pokedex_description1 = (pchar*)PokedexDes414,
	},

	{.pokemon_type = _("TinyBee"),
	 .height = 3,
	 .weight = 55,
	 .pokedex_description1 = (pchar*)PokedexDes415,
	},

	{.pokemon_type = _("Beehive"),
	 .height = 12,
	 .weight = 385,
	 .pokedex_description1 = (pchar*)PokedexDes416,
	},

	{.pokemon_type = _("EleSquirrel"),
	 .height = 4,
	 .weight = 39,
	 .pokedex_description1 = (pchar*)PokedexDes417,
	},

	{.pokemon_type = _("SeaWeasel"),
	 .height = 7,
	 .weight = 295,
	 .pokedex_description1 = (pchar*)PokedexDes418,
	},

	{.pokemon_type = _("SeaWeasel"),
	 .height = 11,
	 .weight = 335,
	 .pokedex_description1 = (pchar*)PokedexDes419,
	},

	{.pokemon_type = _("Cherry"),
	 .height = 4,
	 .weight = 33,
	 .pokedex_description1 = (pchar*)PokedexDes420,
	},

	{.pokemon_type = _("Blossom"),
	 .height = 5,
	 .weight = 93,
	 .pokedex_description1 = (pchar*)PokedexDes421,
	},

	{.pokemon_type = _("SeaSlug"),
	 .height = 3,
	 .weight = 63,
	 .pokedex_description1 = (pchar*)PokedexDes422,
	},

	{.pokemon_type = _("SeaSlug"),
	 .height = 9,
	 .weight = 299,
	 .pokedex_description1 = (pchar*)PokedexDes423,
	},

	{.pokemon_type = _("LongTail"),
	 .height = 12,
	 .weight = 203,
	 .pokedex_description1 = (pchar*)PokedexDes424,
	},

	{.pokemon_type = _("Balloon"),
	 .height = 4,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes425,
	},

	{.pokemon_type = _("Blimp"),
	 .height = 12,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes426,
	},

	{.pokemon_type = _("Rabbit"),
	 .height = 4,
	 .weight = 55,
	 .pokedex_description1 = (pchar*)PokedexDes427,
	},

	{.pokemon_type = _("Rabbit"),
	 .height = 12,
	 .weight = 333,
	 .pokedex_description1 = (pchar*)PokedexDes428,
	},

	{.pokemon_type = _("Magical"),
	 .height = 9,
	 .weight = 44,
	 .pokedex_description1 = (pchar*)PokedexDes429,
	},

	{.pokemon_type = _("BigBoss"),
	 .height = 9,
	 .weight = 273,
	 .pokedex_description1 = (pchar*)PokedexDes430,
	},

	{.pokemon_type = _("Catty"),
	 .height = 5,
	 .weight = 39,
	 .pokedex_description1 = (pchar*)PokedexDes431,
	},

	{.pokemon_type = _("TigerCat"),
	 .height = 10,
	 .weight = 438,
	 .pokedex_description1 = (pchar*)PokedexDes432,
	},

	{.pokemon_type = _("Bell"),
	 .height = 2,
	 .weight = 6,
	 .pokedex_description1 = (pchar*)PokedexDes433,
	},

	{.pokemon_type = _("Skunk"),
	 .height = 4,
	 .weight = 192,
	 .pokedex_description1 = (pchar*)PokedexDes434,
	},

	{.pokemon_type = _("Skunk"),
	 .height = 10,
	 .weight = 380,
	 .pokedex_description1 = (pchar*)PokedexDes435,
	},

	{.pokemon_type = _("Bronze"),
	 .height = 5,
	 .weight = 605,
	 .pokedex_description1 = (pchar*)PokedexDes436,
	},

	{.pokemon_type = _("BronzeBell"),
	 .height = 13,
	 .weight = 1870,
	 .pokedex_description1 = (pchar*)PokedexDes437,
	},

	{.pokemon_type = _("Bonsai"),
	 .height = 5,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes438,
	},

	{.pokemon_type = _("Mime"),
	 .height = 6,
	 .weight = 130,
	 .pokedex_description1 = (pchar*)PokedexDes439,
	},

	{.pokemon_type = _("Playhouse"),
	 .height = 6,
	 .weight = 244,
	 .pokedex_description1 = (pchar*)PokedexDes440,
	},

	{.pokemon_type = _("MusicNote"),
	 .height = 5,
	 .weight = 19,
	 .pokedex_description1 = (pchar*)PokedexDes441,
	},

	{.pokemon_type = _("Forbidden"),
	 .height = 10,
	 .weight = 1080,
	 .pokedex_description1 = (pchar*)PokedexDes442,
	},

	{.pokemon_type = _("LandShark"),
	 .height = 7,
	 .weight = 205,
	 .pokedex_description1 = (pchar*)PokedexDes443,
	},

	{.pokemon_type = _("Cave"),
	 .height = 14,
	 .weight = 560,
	 .pokedex_description1 = (pchar*)PokedexDes444,
	},

	{.pokemon_type = _("Mach"),
	 .height = 19,
	 .weight = 950,
	 .pokedex_description1 = (pchar*)PokedexDes445,
	},

	{.pokemon_type = _("BigEater"),
	 .height = 6,
	 .weight = 1050,
	 .pokedex_description1 = (pchar*)PokedexDes446,
	},

	{.pokemon_type = _("Emanation"),
	 .height = 7,
	 .weight = 202,
	 .pokedex_description1 = (pchar*)PokedexDes447,
	},

	{.pokemon_type = _("Aura"),
	 .height = 12,
	 .weight = 540,
	 .pokedex_description1 = (pchar*)PokedexDes448,
	},

	{.pokemon_type = _("Hippo"),
	 .height = 8,
	 .weight = 495,
	 .pokedex_description1 = (pchar*)PokedexDes449,
	},

	{.pokemon_type = _("Heavyweight"),
	 .height = 20,
	 .weight = 3000,
	 .pokedex_description1 = (pchar*)PokedexDes450,
	},

	{.pokemon_type = _("Scorpion"),
	 .height = 8,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes451,
	},

	{.pokemon_type = _("OgreScorpio"),
	 .height = 13,
	 .weight = 615,
	 .pokedex_description1 = (pchar*)PokedexDes452,
	},

	{.pokemon_type = _("ToxicMouth"),
	 .height = 7,
	 .weight = 230,
	 .pokedex_description1 = (pchar*)PokedexDes453,
	},

	{.pokemon_type = _("ToxicMouth"),
	 .height = 13,
	 .weight = 444,
	 .pokedex_description1 = (pchar*)PokedexDes454,
	},

	{.pokemon_type = _("BugCatcher"),
	 .height = 14,
	 .weight = 270,
	 .pokedex_description1 = (pchar*)PokedexDes455,
	},

	{.pokemon_type = _("WingFish"),
	 .height = 4,
	 .weight = 70,
	 .pokedex_description1 = (pchar*)PokedexDes456,
	},

	{.pokemon_type = _("Neon"),
	 .height = 12,
	 .weight = 240,
	 .pokedex_description1 = (pchar*)PokedexDes457,
	},

	{.pokemon_type = _("Kite"),
	 .height = 10,
	 .weight = 650,
	 .pokedex_description1 = (pchar*)PokedexDes458,
	},

	{.pokemon_type = _("FrostTree"),
	 .height = 10,
	 .weight = 505,
	 .pokedex_description1 = (pchar*)PokedexDes459,
	},

	{.pokemon_type = _("FrostTree"),
	 .height = 22,
	 .weight = 1355,
	 .pokedex_description1 = (pchar*)PokedexDes460,
	},

	{.pokemon_type = _("SharpClaw"),
	 .height = 11,
	 .weight = 340,
	 .pokedex_description1 = (pchar*)PokedexDes461,
	},

	{.pokemon_type = _("MagnetArea"),
	 .height = 12,
	 .weight = 1800,
	 .pokedex_description1 = (pchar*)PokedexDes462,
	},

	{.pokemon_type = _("Licking"),
	 .height = 17,
	 .weight = 1400,
	 .pokedex_description1 = (pchar*)PokedexDes463,
	},

	{.pokemon_type = _("Drill"),
	 .height = 24,
	 .weight = 2828,
	 .pokedex_description1 = (pchar*)PokedexDes464,
	},

	{.pokemon_type = _("Vine"),
	 .height = 20,
	 .weight = 1286,
	 .pokedex_description1 = (pchar*)PokedexDes465,
	},

	{.pokemon_type = _("Thunderbolt"),
	 .height = 18,
	 .weight = 1386,
	 .pokedex_description1 = (pchar*)PokedexDes466,
	},

	{.pokemon_type = _("Blast"),
	 .height = 16,
	 .weight = 680,
	 .pokedex_description1 = (pchar*)PokedexDes467,
	},

	{.pokemon_type = _("Jubilee"),
	 .height = 15,
	 .weight = 380,
	 .pokedex_description1 = (pchar*)PokedexDes468,
	},

	{.pokemon_type = _("OgreDarner"),
	 .height = 19,
	 .weight = 515,
	 .pokedex_description1 = (pchar*)PokedexDes469,
	},

	{.pokemon_type = _("Verdant"),
	 .height = 10,
	 .weight = 255,
	 .pokedex_description1 = (pchar*)PokedexDes470,
	},

	{.pokemon_type = _("FreshSnow"),
	 .height = 8,
	 .weight = 259,
	 .pokedex_description1 = (pchar*)PokedexDes471,
	},

	{.pokemon_type = _("FangScorpio"),
	 .height = 20,
	 .weight = 425,
	 .pokedex_description1 = (pchar*)PokedexDes472,
	},

	{.pokemon_type = _("TwinTusk"),
	 .height = 25,
	 .weight = 2910,
	 .pokedex_description1 = (pchar*)PokedexDes473,
	},

	{.pokemon_type = _("Virtual"),
	 .height = 9,
	 .weight = 340,
	 .pokedex_description1 = (pchar*)PokedexDes474,
	},

	{.pokemon_type = _("Blade"),
	 .height = 16,
	 .weight = 520,
	 .pokedex_description1 = (pchar*)PokedexDes475,
	},

	{.pokemon_type = _("Compass"),
	 .height = 14,
	 .weight = 3400,
	 .pokedex_description1 = (pchar*)PokedexDes476,
	},

	{.pokemon_type = _("Gripper"),
	 .height = 22,
	 .weight = 1066,
	 .pokedex_description1 = (pchar*)PokedexDes477,
	},

	{.pokemon_type = _("SnowLand"),
	 .height = 13,
	 .weight = 266,
	 .pokedex_description1 = (pchar*)PokedexDes478,
	},

	{.pokemon_type = _("Plasma"),
	 .height = 3,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes479,
	},

	{.pokemon_type = _("Knowledge"),
	 .height = 3,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes480,
	},

	{.pokemon_type = _("Emotion"),
	 .height = 3,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes481,
	},

	{.pokemon_type = _("Willpower"),
	 .height = 3,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes482,
	},

	{.pokemon_type = _("Temporal"),
	 .height = 54,
	 .weight = 6830,
	 .pokedex_description1 = (pchar*)PokedexDes483,
	},

	{.pokemon_type = _("Spatial"),
	 .height = 42,
	 .weight = 3360,
	 .pokedex_description1 = (pchar*)PokedexDes484,
	},

	{.pokemon_type = _("LavaDome"),
	 .height = 17,
	 .weight = 4300,
	 .pokedex_description1 = (pchar*)PokedexDes485,
	},

	{.pokemon_type = _("Colossal"),
	 .height = 37,
	 .weight = 4200,
	 .pokedex_description1 = (pchar*)PokedexDes486,
	},

	{.pokemon_type = _("Renegade"),
	 .height = 45,
	 .weight = 7500,
	 .pokedex_description1 = (pchar*)PokedexDes487,
	},

	{.pokemon_type = _("Lunar"),
	 .height = 15,
	 .weight = 856,
	 .pokedex_description1 = (pchar*)PokedexDes488,
	},

	{.pokemon_type = _("SeaDrifter"),
	 .height = 4,
	 .weight = 31,
	 .pokedex_description1 = (pchar*)PokedexDes489,
	},

	{.pokemon_type = _("Seafaring"),
	 .height = 3,
	 .weight = 14,
	 .pokedex_description1 = (pchar*)PokedexDes490,
	},

	{.pokemon_type = _("Pitch-Black"),
	 .height = 15,
	 .weight = 505,
	 .pokedex_description1 = (pchar*)PokedexDes491,
	},

	{.pokemon_type = _("Gratitude"),
	 .height = 2,
	 .weight = 21,
	 .pokedex_description1 = (pchar*)PokedexDes492,
	},

	{.pokemon_type = _("Alpha"),
	 .height = 32,
	 .weight = 3200,
	 .pokedex_description1 = (pchar*)PokedexDes493,
	},

	{.pokemon_type = _("Victory"),
	 .height = 4,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes494,
	},

	{.pokemon_type = _("GrassSnake"),
	 .height = 6,
	 .weight = 81,
	 .pokedex_description1 = (pchar*)PokedexDes495,
	},

	{.pokemon_type = _("GrassSnake"),
	 .height = 8,
	 .weight = 160,
	 .pokedex_description1 = (pchar*)PokedexDes496,
	},

	{.pokemon_type = _("Regal"),
	 .height = 33,
	 .weight = 630,
	 .pokedex_description1 = (pchar*)PokedexDes497,
	},

	{.pokemon_type = _("FirePig"),
	 .height = 5,
	 .weight = 99,
	 .pokedex_description1 = (pchar*)PokedexDes498,
	},

	{.pokemon_type = _("FirePig"),
	 .height = 10,
	 .weight = 555,
	 .pokedex_description1 = (pchar*)PokedexDes499,
	},

	{.pokemon_type = _("MegaFirePig"),
	 .height = 16,
	 .weight = 1500,
	 .pokedex_description1 = (pchar*)PokedexDes500,
	},

	{.pokemon_type = _("SeaOtter"),
	 .height = 5,
	 .weight = 59,
	 .pokedex_description1 = (pchar*)PokedexDes501,
	},

	{.pokemon_type = _("Discipline"),
	 .height = 8,
	 .weight = 245,
	 .pokedex_description1 = (pchar*)PokedexDes502,
	},

	{.pokemon_type = _("Formidable"),
	 .height = 15,
	 .weight = 946,
	 .pokedex_description1 = (pchar*)PokedexDes503,
	},

	{.pokemon_type = _("Scout"),
	 .height = 5,
	 .weight = 116,
	 .pokedex_description1 = (pchar*)PokedexDes504,
	},

	{.pokemon_type = _("Lookout"),
	 .height = 11,
	 .weight = 270,
	 .pokedex_description1 = (pchar*)PokedexDes505,
	},

	{.pokemon_type = _("Puppy"),
	 .height = 4,
	 .weight = 41,
	 .pokedex_description1 = (pchar*)PokedexDes506,
	},

	{.pokemon_type = _("LoyalDog"),
	 .height = 9,
	 .weight = 147,
	 .pokedex_description1 = (pchar*)PokedexDes507,
	},

	{.pokemon_type = _("Big-Hearted"),
	 .height = 12,
	 .weight = 610,
	 .pokedex_description1 = (pchar*)PokedexDes508,
	},

	{.pokemon_type = _("Devious"),
	 .height = 4,
	 .weight = 101,
	 .pokedex_description1 = (pchar*)PokedexDes509,
	},

	{.pokemon_type = _("Cruel"),
	 .height = 11,
	 .weight = 375,
	 .pokedex_description1 = (pchar*)PokedexDes510,
	},

	{.pokemon_type = _("GrassMonkey"),
	 .height = 6,
	 .weight = 105,
	 .pokedex_description1 = (pchar*)PokedexDes511,
	},

	{.pokemon_type = _("ThornMonkey"),
	 .height = 11,
	 .weight = 305,
	 .pokedex_description1 = (pchar*)PokedexDes512,
	},

	{.pokemon_type = _("HighTemp"),
	 .height = 6,
	 .weight = 110,
	 .pokedex_description1 = (pchar*)PokedexDes513,
	},

	{.pokemon_type = _("Ember"),
	 .height = 10,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes514,
	},

	{.pokemon_type = _("Spray"),
	 .height = 6,
	 .weight = 135,
	 .pokedex_description1 = (pchar*)PokedexDes515,
	},

	{.pokemon_type = _("Geyser"),
	 .height = 10,
	 .weight = 290,
	 .pokedex_description1 = (pchar*)PokedexDes516,
	},

	{.pokemon_type = _("DreamEater"),
	 .height = 6,
	 .weight = 233,
	 .pokedex_description1 = (pchar*)PokedexDes517,
	},

	{.pokemon_type = _("Drowsing"),
	 .height = 11,
	 .weight = 605,
	 .pokedex_description1 = (pchar*)PokedexDes518,
	},

	{.pokemon_type = _("TinyPigeon"),
	 .height = 3,
	 .weight = 21,
	 .pokedex_description1 = (pchar*)PokedexDes519,
	},

	{.pokemon_type = _("WildPigeon"),
	 .height = 6,
	 .weight = 150,
	 .pokedex_description1 = (pchar*)PokedexDes520,
	},

	{.pokemon_type = _("Proud"),
	 .height = 12,
	 .weight = 290,
	 .pokedex_description1 = (pchar*)PokedexDes521,
	},

	{.pokemon_type = _("Electrified"),
	 .height = 8,
	 .weight = 298,
	 .pokedex_description1 = (pchar*)PokedexDes522,
	},

	{.pokemon_type = _("Thunderbolt"),
	 .height = 16,
	 .weight = 795,
	 .pokedex_description1 = (pchar*)PokedexDes523,
	},

	{.pokemon_type = _("Mantle"),
	 .height = 4,
	 .weight = 180,
	 .pokedex_description1 = (pchar*)PokedexDes524,
	},

	{.pokemon_type = _("Ore"),
	 .height = 9,
	 .weight = 1020,
	 .pokedex_description1 = (pchar*)PokedexDes525,
	},

	{.pokemon_type = _("Compressed"),
	 .height = 17,
	 .weight = 2600,
	 .pokedex_description1 = (pchar*)PokedexDes526,
	},

	{.pokemon_type = _("Bat"),
	 .height = 4,
	 .weight = 21,
	 .pokedex_description1 = (pchar*)PokedexDes527,
	},

	{.pokemon_type = _("Courting"),
	 .height = 9,
	 .weight = 105,
	 .pokedex_description1 = (pchar*)PokedexDes528,
	},

	{.pokemon_type = _("Mole"),
	 .height = 3,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes529,
	},

	{.pokemon_type = _("Subterrene"),
	 .height = 7,
	 .weight = 404,
	 .pokedex_description1 = (pchar*)PokedexDes530,
	},

	{.pokemon_type = _("Hearing"),
	 .height = 11,
	 .weight = 310,
	 .pokedex_description1 = (pchar*)PokedexDes531,
	},

	{.pokemon_type = _("Muscular"),
	 .height = 6,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes532,
	},

	{.pokemon_type = _("Muscular"),
	 .height = 12,
	 .weight = 400,
	 .pokedex_description1 = (pchar*)PokedexDes533,
	},

	{.pokemon_type = _("Muscular"),
	 .height = 14,
	 .weight = 870,
	 .pokedex_description1 = (pchar*)PokedexDes534,
	},

	{.pokemon_type = _("Tadpole"),
	 .height = 5,
	 .weight = 45,
	 .pokedex_description1 = (pchar*)PokedexDes535,
	},

	{.pokemon_type = _("Vibration"),
	 .height = 8,
	 .weight = 170,
	 .pokedex_description1 = (pchar*)PokedexDes536,
	},

	{.pokemon_type = _("Vibration"),
	 .height = 15,
	 .weight = 620,
	 .pokedex_description1 = (pchar*)PokedexDes537,
	},

	{.pokemon_type = _("Judo"),
	 .height = 13,
	 .weight = 555,
	 .pokedex_description1 = (pchar*)PokedexDes538,
	},

	{.pokemon_type = _("Karate"),
	 .height = 14,
	 .weight = 510,
	 .pokedex_description1 = (pchar*)PokedexDes539,
	},

	{.pokemon_type = _("Sewing"),
	 .height = 3,
	 .weight = 25,
	 .pokedex_description1 = (pchar*)PokedexDes540,
	},

	{.pokemon_type = _("LeafWrapped"),
	 .height = 5,
	 .weight = 73,
	 .pokedex_description1 = (pchar*)PokedexDes541,
	},

	{.pokemon_type = _("Nurturing"),
	 .height = 12,
	 .weight = 205,
	 .pokedex_description1 = (pchar*)PokedexDes542,
	},

	{.pokemon_type = _("Centipede"),
	 .height = 4,
	 .weight = 53,
	 .pokedex_description1 = (pchar*)PokedexDes543,
	},

	{.pokemon_type = _("Curlipede"),
	 .height = 12,
	 .weight = 585,
	 .pokedex_description1 = (pchar*)PokedexDes544,
	},

	{.pokemon_type = _("Megapede"),
	 .height = 25,
	 .weight = 2005,
	 .pokedex_description1 = (pchar*)PokedexDes545,
	},

	{.pokemon_type = _("CottonPuff"),
	 .height = 3,
	 .weight = 6,
	 .pokedex_description1 = (pchar*)PokedexDes546,
	},

	{.pokemon_type = _("Windveiled"),
	 .height = 7,
	 .weight = 66,
	 .pokedex_description1 = (pchar*)PokedexDes547,
	},

	{.pokemon_type = _("Bulb"),
	 .height = 5,
	 .weight = 66,
	 .pokedex_description1 = (pchar*)PokedexDes548,
	},

	{.pokemon_type = _("Flowering"),
	 .height = 11,
	 .weight = 163,
	 .pokedex_description1 = (pchar*)PokedexDes549,
	},

	{.pokemon_type = _("Hostile"),
	 .height = 10,
	 .weight = 180,
	 .pokedex_description1 = (pchar*)PokedexDes550,
	},

	{.pokemon_type = _("DesertCroc"),
	 .height = 7,
	 .weight = 152,
	 .pokedex_description1 = (pchar*)PokedexDes551,
	},

	{.pokemon_type = _("DesertCroc"),
	 .height = 10,
	 .weight = 334,
	 .pokedex_description1 = (pchar*)PokedexDes552,
	},

	{.pokemon_type = _("Intimidate"),
	 .height = 15,
	 .weight = 963,
	 .pokedex_description1 = (pchar*)PokedexDes553,
	},

	{.pokemon_type = _("ZenCharm"),
	 .height = 6,
	 .weight = 375,
	 .pokedex_description1 = (pchar*)PokedexDes554,
	},

	{.pokemon_type = _("Blazing"),
	 .height = 13,
	 .weight = 929,
	 .pokedex_description1 = (pchar*)PokedexDes555,
	},

	{.pokemon_type = _("Cactus"),
	 .height = 10,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes556,
	},

	{.pokemon_type = _("RockInn"),
	 .height = 3,
	 .weight = 145,
	 .pokedex_description1 = (pchar*)PokedexDes557,
	},

	{.pokemon_type = _("StoneHome"),
	 .height = 14,
	 .weight = 2000,
	 .pokedex_description1 = (pchar*)PokedexDes558,
	},

	{.pokemon_type = _("Shedding"),
	 .height = 6,
	 .weight = 118,
	 .pokedex_description1 = (pchar*)PokedexDes559,
	},

	{.pokemon_type = _("Hoodlum"),
	 .height = 11,
	 .weight = 300,
	 .pokedex_description1 = (pchar*)PokedexDes560,
	},

	{.pokemon_type = _("Avianoid"),
	 .height = 14,
	 .weight = 140,
	 .pokedex_description1 = (pchar*)PokedexDes561,
	},

	{.pokemon_type = _("Spirit"),
	 .height = 5,
	 .weight = 15,
	 .pokedex_description1 = (pchar*)PokedexDes562,
	},

	{.pokemon_type = _("Coffin"),
	 .height = 17,
	 .weight = 765,
	 .pokedex_description1 = (pchar*)PokedexDes563,
	},

	{.pokemon_type = _("Prototurtle"),
	 .height = 7,
	 .weight = 165,
	 .pokedex_description1 = (pchar*)PokedexDes564,
	},

	{.pokemon_type = _("Prototurtle"),
	 .height = 12,
	 .weight = 810,
	 .pokedex_description1 = (pchar*)PokedexDes565,
	},

	{.pokemon_type = _("FirstBird"),
	 .height = 5,
	 .weight = 95,
	 .pokedex_description1 = (pchar*)PokedexDes566,
	},

	{.pokemon_type = _("FirstBird"),
	 .height = 14,
	 .weight = 320,
	 .pokedex_description1 = (pchar*)PokedexDes567,
	},

	{.pokemon_type = _("TrashBag"),
	 .height = 6,
	 .weight = 310,
	 .pokedex_description1 = (pchar*)PokedexDes568,
	},

	{.pokemon_type = _("TrashHeap"),
	 .height = 19,
	 .weight = 1073,
	 .pokedex_description1 = (pchar*)PokedexDes569,
	},

	{.pokemon_type = _("TrickyFox"),
	 .height = 7,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes570,
	},

	{.pokemon_type = _("IllusionFox"),
	 .height = 16,
	 .weight = 811,
	 .pokedex_description1 = (pchar*)PokedexDes571,
	},

	{.pokemon_type = _("Chinchilla"),
	 .height = 4,
	 .weight = 58,
	 .pokedex_description1 = (pchar*)PokedexDes572,
	},

	{.pokemon_type = _("Scarf"),
	 .height = 5,
	 .weight = 75,
	 .pokedex_description1 = (pchar*)PokedexDes573,
	},

	{.pokemon_type = _("Fixation"),
	 .height = 4,
	 .weight = 58,
	 .pokedex_description1 = (pchar*)PokedexDes574,
	},

	{.pokemon_type = _("Manipulate"),
	 .height = 7,
	 .weight = 180,
	 .pokedex_description1 = (pchar*)PokedexDes575,
	},

	{.pokemon_type = _("AstralBody"),
	 .height = 15,
	 .weight = 440,
	 .pokedex_description1 = (pchar*)PokedexDes576,
	},

	{.pokemon_type = _("Cell"),
	 .height = 3,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes577,
	},

	{.pokemon_type = _("Mitosis"),
	 .height = 6,
	 .weight = 80,
	 .pokedex_description1 = (pchar*)PokedexDes578,
	},

	{.pokemon_type = _("Multiplying"),
	 .height = 10,
	 .weight = 201,
	 .pokedex_description1 = (pchar*)PokedexDes579,
	},

	{.pokemon_type = _("WaterBird"),
	 .height = 5,
	 .weight = 55,
	 .pokedex_description1 = (pchar*)PokedexDes580,
	},

	{.pokemon_type = _("WhiteBird"),
	 .height = 13,
	 .weight = 242,
	 .pokedex_description1 = (pchar*)PokedexDes581,
	},

	{.pokemon_type = _("FreshSnow"),
	 .height = 4,
	 .weight = 57,
	 .pokedex_description1 = (pchar*)PokedexDes582,
	},

	{.pokemon_type = _("IcySnow"),
	 .height = 11,
	 .weight = 410,
	 .pokedex_description1 = (pchar*)PokedexDes583,
	},

	{.pokemon_type = _("Snowstorm"),
	 .height = 13,
	 .weight = 575,
	 .pokedex_description1 = (pchar*)PokedexDes584,
	},

	{.pokemon_type = _("Season"),
	 .height = 6,
	 .weight = 195,
	 .pokedex_description1 = (pchar*)PokedexDes585,
	},

	{.pokemon_type = _("Season"),
	 .height = 19,
	 .weight = 925,
	 .pokedex_description1 = (pchar*)PokedexDes586,
	},

	{.pokemon_type = _("SkySquirrel"),
	 .height = 4,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes587,
	},

	{.pokemon_type = _("Clamping"),
	 .height = 5,
	 .weight = 59,
	 .pokedex_description1 = (pchar*)PokedexDes588,
	},

	{.pokemon_type = _("Cavalry"),
	 .height = 10,
	 .weight = 330,
	 .pokedex_description1 = (pchar*)PokedexDes589,
	},

	{.pokemon_type = _("Mushroom"),
	 .height = 2,
	 .weight = 10,
	 .pokedex_description1 = (pchar*)PokedexDes590,
	},

	{.pokemon_type = _("Mushroom"),
	 .height = 6,
	 .weight = 105,
	 .pokedex_description1 = (pchar*)PokedexDes591,
	},

	{.pokemon_type = _("Floating"),
	 .height = 12,
	 .weight = 330,
	 .pokedex_description1 = (pchar*)PokedexDes592,
	},

	{.pokemon_type = _("Floating"),
	 .height = 22,
	 .weight = 1350,
	 .pokedex_description1 = (pchar*)PokedexDes593,
	},

	{.pokemon_type = _("Caring"),
	 .height = 12,
	 .weight = 316,
	 .pokedex_description1 = (pchar*)PokedexDes594,
	},

	{.pokemon_type = _("Attaching"),
	 .height = 1,
	 .weight = 6,
	 .pokedex_description1 = (pchar*)PokedexDes595,
	},

	{.pokemon_type = _("EleSpider"),
	 .height = 8,
	 .weight = 143,
	 .pokedex_description1 = (pchar*)PokedexDes596,
	},

	{.pokemon_type = _("ThornSeed"),
	 .height = 6,
	 .weight = 188,
	 .pokedex_description1 = (pchar*)PokedexDes597,
	},

	{.pokemon_type = _("ThornPod"),
	 .height = 10,
	 .weight = 1100,
	 .pokedex_description1 = (pchar*)PokedexDes598,
	},

	{.pokemon_type = _("Gear"),
	 .height = 3,
	 .weight = 210,
	 .pokedex_description1 = (pchar*)PokedexDes599,
	},

	{.pokemon_type = _("Gear"),
	 .height = 6,
	 .weight = 510,
	 .pokedex_description1 = (pchar*)PokedexDes600,
	},

	{.pokemon_type = _("Gear"),
	 .height = 6,
	 .weight = 810,
	 .pokedex_description1 = (pchar*)PokedexDes601,
	},

	{.pokemon_type = _("EleFish"),
	 .height = 2,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes602,
	},

	{.pokemon_type = _("EleFish"),
	 .height = 12,
	 .weight = 220,
	 .pokedex_description1 = (pchar*)PokedexDes603,
	},

	{.pokemon_type = _("EleFish"),
	 .height = 21,
	 .weight = 805,
	 .pokedex_description1 = (pchar*)PokedexDes604,
	},

	{.pokemon_type = _("Cerebral"),
	 .height = 5,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes605,
	},

	{.pokemon_type = _("Cerebral"),
	 .height = 10,
	 .weight = 345,
	 .pokedex_description1 = (pchar*)PokedexDes606,
	},

	{.pokemon_type = _("Candle"),
	 .height = 3,
	 .weight = 31,
	 .pokedex_description1 = (pchar*)PokedexDes607,
	},

	{.pokemon_type = _("Lamp"),
	 .height = 6,
	 .weight = 130,
	 .pokedex_description1 = (pchar*)PokedexDes608,
	},

	{.pokemon_type = _("Luring"),
	 .height = 10,
	 .weight = 343,
	 .pokedex_description1 = (pchar*)PokedexDes609,
	},

	{.pokemon_type = _("Tusk"),
	 .height = 6,
	 .weight = 180,
	 .pokedex_description1 = (pchar*)PokedexDes610,
	},

	{.pokemon_type = _("AxeJaw"),
	 .height = 10,
	 .weight = 360,
	 .pokedex_description1 = (pchar*)PokedexDes611,
	},

	{.pokemon_type = _("AxeJaw"),
	 .height = 18,
	 .weight = 1055,
	 .pokedex_description1 = (pchar*)PokedexDes612,
	},

	{.pokemon_type = _("Chill"),
	 .height = 5,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes613,
	},

	{.pokemon_type = _("Freezing"),
	 .height = 26,
	 .weight = 2600,
	 .pokedex_description1 = (pchar*)PokedexDes614,
	},

	{.pokemon_type = _("Crystallize"),
	 .height = 11,
	 .weight = 1480,
	 .pokedex_description1 = (pchar*)PokedexDes615,
	},

	{.pokemon_type = _("Snail"),
	 .height = 4,
	 .weight = 77,
	 .pokedex_description1 = (pchar*)PokedexDes616,
	},

	{.pokemon_type = _("ShellOut"),
	 .height = 8,
	 .weight = 253,
	 .pokedex_description1 = (pchar*)PokedexDes617,
	},

	{.pokemon_type = _("Trap"),
	 .height = 7,
	 .weight = 110,
	 .pokedex_description1 = (pchar*)PokedexDes618,
	},

	{.pokemon_type = _("MartialArts"),
	 .height = 9,
	 .weight = 200,
	 .pokedex_description1 = (pchar*)PokedexDes619,
	},

	{.pokemon_type = _("MartialArts"),
	 .height = 14,
	 .weight = 355,
	 .pokedex_description1 = (pchar*)PokedexDes620,
	},

	{.pokemon_type = _("Cave"),
	 .height = 16,
	 .weight = 1390,
	 .pokedex_description1 = (pchar*)PokedexDes621,
	},

	{.pokemon_type = _("Automaton"),
	 .height = 10,
	 .weight = 920,
	 .pokedex_description1 = (pchar*)PokedexDes622,
	},

	{.pokemon_type = _("Automaton"),
	 .height = 28,
	 .weight = 3300,
	 .pokedex_description1 = (pchar*)PokedexDes623,
	},

	{.pokemon_type = _("SharpBlade"),
	 .height = 5,
	 .weight = 102,
	 .pokedex_description1 = (pchar*)PokedexDes624,
	},

	{.pokemon_type = _("SwordBlade"),
	 .height = 16,
	 .weight = 700,
	 .pokedex_description1 = (pchar*)PokedexDes625,
	},

	{.pokemon_type = _("BashBuffalo"),
	 .height = 16,
	 .weight = 946,
	 .pokedex_description1 = (pchar*)PokedexDes626,
	},

	{.pokemon_type = _("Eaglet"),
	 .height = 5,
	 .weight = 105,
	 .pokedex_description1 = (pchar*)PokedexDes627,
	},

	{.pokemon_type = _("Valiant"),
	 .height = 15,
	 .weight = 410,
	 .pokedex_description1 = (pchar*)PokedexDes628,
	},

	{.pokemon_type = _("Diapered"),
	 .height = 5,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes629,
	},

	{.pokemon_type = _("BoneVulture"),
	 .height = 12,
	 .weight = 395,
	 .pokedex_description1 = (pchar*)PokedexDes630,
	},

	{.pokemon_type = _("Anteater"),
	 .height = 14,
	 .weight = 580,
	 .pokedex_description1 = (pchar*)PokedexDes631,
	},

	{.pokemon_type = _("IronAnt"),
	 .height = 3,
	 .weight = 330,
	 .pokedex_description1 = (pchar*)PokedexDes632,
	},

	{.pokemon_type = _("Irate"),
	 .height = 8,
	 .weight = 173,
	 .pokedex_description1 = (pchar*)PokedexDes633,
	},

	{.pokemon_type = _("Hostile"),
	 .height = 14,
	 .weight = 500,
	 .pokedex_description1 = (pchar*)PokedexDes634,
	},

	{.pokemon_type = _("Brutal"),
	 .height = 18,
	 .weight = 1600,
	 .pokedex_description1 = (pchar*)PokedexDes635,
	},

	{.pokemon_type = _("Torch"),
	 .height = 11,
	 .weight = 288,
	 .pokedex_description1 = (pchar*)PokedexDes636,
	},

	{.pokemon_type = _("Sun"),
	 .height = 16,
	 .weight = 460,
	 .pokedex_description1 = (pchar*)PokedexDes637,
	},

	{.pokemon_type = _("IronWill"),
	 .height = 21,
	 .weight = 2500,
	 .pokedex_description1 = (pchar*)PokedexDes638,
	},

	{.pokemon_type = _("Cavern"),
	 .height = 19,
	 .weight = 2600,
	 .pokedex_description1 = (pchar*)PokedexDes639,
	},

	{.pokemon_type = _("Grassland"),
	 .height = 20,
	 .weight = 2000,
	 .pokedex_description1 = (pchar*)PokedexDes640,
	},

	{.pokemon_type = _("Cyclone"),
	 .height = 15,
	 .weight = 630,
	 .pokedex_description1 = (pchar*)PokedexDes641,
	},

	{.pokemon_type = _("BoltStrike"),
	 .height = 15,
	 .weight = 610,
	 .pokedex_description1 = (pchar*)PokedexDes642,
	},

	{.pokemon_type = _("VastWhite"),
	 .height = 32,
	 .weight = 3300,
	 .pokedex_description1 = (pchar*)PokedexDes643,
	},

	{.pokemon_type = _("DeepBlack"),
	 .height = 29,
	 .weight = 3450,
	 .pokedex_description1 = (pchar*)PokedexDes644,
	},

	{.pokemon_type = _("Abundance"),
	 .height = 15,
	 .weight = 680,
	 .pokedex_description1 = (pchar*)PokedexDes645,
	},

	{.pokemon_type = _("Boundary"),
	 .height = 30,
	 .weight = 3250,
	 .pokedex_description1 = (pchar*)PokedexDes646,
	},

	{.pokemon_type = _("Colt"),
	 .height = 14,
	 .weight = 485,
	 .pokedex_description1 = (pchar*)PokedexDes647,
	},

	{.pokemon_type = _("Melody"),
	 .height = 6,
	 .weight = 65,
	 .pokedex_description1 = (pchar*)PokedexDes648,
	},

	{.pokemon_type = _("Paleozoic"),
	 .height = 15,
	 .weight = 825,
	 .pokedex_description1 = (pchar*)PokedexDes649,
	},

	{.pokemon_type = _("SpinyNut"),
	 .height = 4,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes650,
	},

	{.pokemon_type = _("SpinyArmor"),
	 .height = 7,
	 .weight = 290,
	 .pokedex_description1 = (pchar*)PokedexDes651,
	},

	{.pokemon_type = _("SpinyArmor"),
	 .height = 16,
	 .weight = 900,
	 .pokedex_description1 = (pchar*)PokedexDes652,
	},

	{.pokemon_type = _("Fox"),
	 .height = 4,
	 .weight = 94,
	 .pokedex_description1 = (pchar*)PokedexDes653,
	},

	{.pokemon_type = _("Fox"),
	 .height = 10,
	 .weight = 145,
	 .pokedex_description1 = (pchar*)PokedexDes654,
	},

	{.pokemon_type = _("Fox"),
	 .height = 15,
	 .weight = 390,
	 .pokedex_description1 = (pchar*)PokedexDes655,
	},

	{.pokemon_type = _("BubbleFrog"),
	 .height = 3,
	 .weight = 70,
	 .pokedex_description1 = (pchar*)PokedexDes656,
	},

	{.pokemon_type = _("BubbleFrog"),
	 .height = 6,
	 .weight = 109,
	 .pokedex_description1 = (pchar*)PokedexDes657,
	},

	{.pokemon_type = _("Ninja"),
	 .height = 15,
	 .weight = 400,
	 .pokedex_description1 = (pchar*)PokedexDes658,
	},

	{.pokemon_type = _("Digging"),
	 .height = 4,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes659,
	},

	{.pokemon_type = _("Digging"),
	 .height = 10,
	 .weight = 424,
	 .pokedex_description1 = (pchar*)PokedexDes660,
	},

	{.pokemon_type = _("TinyRobin"),
	 .height = 3,
	 .weight = 17,
	 .pokedex_description1 = (pchar*)PokedexDes661,
	},

	{.pokemon_type = _("Ember"),
	 .height = 7,
	 .weight = 160,
	 .pokedex_description1 = (pchar*)PokedexDes662,
	},

	{.pokemon_type = _("Scorching"),
	 .height = 12,
	 .weight = 245,
	 .pokedex_description1 = (pchar*)PokedexDes663,
	},

	{.pokemon_type = _("Scatterdust"),
	 .height = 3,
	 .weight = 25,
	 .pokedex_description1 = (pchar*)PokedexDes664,
	},

	{.pokemon_type = _("Scatterdust"),
	 .height = 3,
	 .weight = 84,
	 .pokedex_description1 = (pchar*)PokedexDes665,
	},

	{.pokemon_type = _("Scale"),
	 .height = 12,
	 .weight = 170,
	 .pokedex_description1 = (pchar*)PokedexDes666,
	},

	{.pokemon_type = _("LionCub"),
	 .height = 6,
	 .weight = 135,
	 .pokedex_description1 = (pchar*)PokedexDes667,
	},

	{.pokemon_type = _("Royal"),
	 .height = 15,
	 .weight = 815,
	 .pokedex_description1 = (pchar*)PokedexDes668,
	},

	{.pokemon_type = _("SingleBloom"),
	 .height = 1,
	 .weight = 1,
	 .pokedex_description1 = (pchar*)PokedexDes669,
	},

	{.pokemon_type = _("SingleBloom"),
	 .height = 2,
	 .weight = 9,
	 .pokedex_description1 = (pchar*)PokedexDes670,
	},

	{.pokemon_type = _("Garden"),
	 .height = 11,
	 .weight = 100,
	 .pokedex_description1 = (pchar*)PokedexDes671,
	},

	{.pokemon_type = _("Mount"),
	 .height = 9,
	 .weight = 310,
	 .pokedex_description1 = (pchar*)PokedexDes672,
	},

	{.pokemon_type = _("Mount"),
	 .height = 17,
	 .weight = 910,
	 .pokedex_description1 = (pchar*)PokedexDes673,
	},

	{.pokemon_type = _("Playful"),
	 .height = 6,
	 .weight = 80,
	 .pokedex_description1 = (pchar*)PokedexDes674,
	},

	{.pokemon_type = _("Daunting"),
	 .height = 21,
	 .weight = 1360,
	 .pokedex_description1 = (pchar*)PokedexDes675,
	},

	{.pokemon_type = _("Poodle"),
	 .height = 12,
	 .weight = 280,
	 .pokedex_description1 = (pchar*)PokedexDes676,
	},

	{.pokemon_type = _("Restraint"),
	 .height = 3,
	 .weight = 35,
	 .pokedex_description1 = (pchar*)PokedexDes677,
	},

	{.pokemon_type = _("Constraint"),
	 .height = 6,
	 .weight = 85,
	 .pokedex_description1 = (pchar*)PokedexDes678,
	},

	{.pokemon_type = _("Sword"),
	 .height = 8,
	 .weight = 20,
	 .pokedex_description1 = (pchar*)PokedexDes679,
	},

	{.pokemon_type = _("Sword"),
	 .height = 8,
	 .weight = 45,
	 .pokedex_description1 = (pchar*)PokedexDes680,
	},

	{.pokemon_type = _("RoyalSword"),
	 .height = 17,
	 .weight = 530,
	 .pokedex_description1 = (pchar*)PokedexDes681,
	},

	{.pokemon_type = _("Perfume"),
	 .height = 2,
	 .weight = 5,
	 .pokedex_description1 = (pchar*)PokedexDes682,
	},

	{.pokemon_type = _("Fragrance"),
	 .height = 8,
	 .weight = 155,
	 .pokedex_description1 = (pchar*)PokedexDes683,
	},

	{.pokemon_type = _("CottonCandy"),
	 .height = 4,
	 .weight = 35,
	 .pokedex_description1 = (pchar*)PokedexDes684,
	},

	{.pokemon_type = _("Meringue"),
	 .height = 8,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes685,
	},

	{.pokemon_type = _("Revolving"),
	 .height = 4,
	 .weight = 35,
	 .pokedex_description1 = (pchar*)PokedexDes686,
	},

	{.pokemon_type = _("Overturning"),
	 .height = 15,
	 .weight = 470,
	 .pokedex_description1 = (pchar*)PokedexDes687,
	},

	{.pokemon_type = _("Two-Handed"),
	 .height = 5,
	 .weight = 310,
	 .pokedex_description1 = (pchar*)PokedexDes688,
	},

	{.pokemon_type = _("Collective"),
	 .height = 13,
	 .weight = 960,
	 .pokedex_description1 = (pchar*)PokedexDes689,
	},

	{.pokemon_type = _("MockKelp"),
	 .height = 5,
	 .weight = 73,
	 .pokedex_description1 = (pchar*)PokedexDes690,
	},

	{.pokemon_type = _("MockKelp"),
	 .height = 18,
	 .weight = 815,
	 .pokedex_description1 = (pchar*)PokedexDes691,
	},

	{.pokemon_type = _("WaterGun"),
	 .height = 5,
	 .weight = 83,
	 .pokedex_description1 = (pchar*)PokedexDes692,
	},

	{.pokemon_type = _("Howitzer"),
	 .height = 13,
	 .weight = 353,
	 .pokedex_description1 = (pchar*)PokedexDes693,
	},

	{.pokemon_type = _("Generator"),
	 .height = 5,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes694,
	},

	{.pokemon_type = _("Generator"),
	 .height = 10,
	 .weight = 210,
	 .pokedex_description1 = (pchar*)PokedexDes695,
	},

	{.pokemon_type = _("RoyalHeir"),
	 .height = 8,
	 .weight = 260,
	 .pokedex_description1 = (pchar*)PokedexDes696,
	},

	{.pokemon_type = _("Despot"),
	 .height = 25,
	 .weight = 2700,
	 .pokedex_description1 = (pchar*)PokedexDes697,
	},

	{.pokemon_type = _("Tundra"),
	 .height = 13,
	 .weight = 252,
	 .pokedex_description1 = (pchar*)PokedexDes698,
	},

	{.pokemon_type = _("Tundra"),
	 .height = 27,
	 .weight = 2250,
	 .pokedex_description1 = (pchar*)PokedexDes699,
	},

	{.pokemon_type = _("Intertwine"),
	 .height = 10,
	 .weight = 235,
	 .pokedex_description1 = (pchar*)PokedexDes700,
	},

	{.pokemon_type = _("Wrestling"),
	 .height = 8,
	 .weight = 215,
	 .pokedex_description1 = (pchar*)PokedexDes701,
	},

	{.pokemon_type = _("Antenna"),
	 .height = 2,
	 .weight = 22,
	 .pokedex_description1 = (pchar*)PokedexDes702,
	},

	{.pokemon_type = _("Jewel"),
	 .height = 3,
	 .weight = 57,
	 .pokedex_description1 = (pchar*)PokedexDes703,
	},

	{.pokemon_type = _("SoftTissue"),
	 .height = 3,
	 .weight = 28,
	 .pokedex_description1 = (pchar*)PokedexDes704,
	},

	{.pokemon_type = _("SoftTissue"),
	 .height = 8,
	 .weight = 175,
	 .pokedex_description1 = (pchar*)PokedexDes705,
	},

	{.pokemon_type = _("Dragon"),
	 .height = 20,
	 .weight = 1505,
	 .pokedex_description1 = (pchar*)PokedexDes706,
	},

	{.pokemon_type = _("KeyRing"),
	 .height = 2,
	 .weight = 30,
	 .pokedex_description1 = (pchar*)PokedexDes707,
	},

	{.pokemon_type = _("Stump"),
	 .height = 4,
	 .weight = 70,
	 .pokedex_description1 = (pchar*)PokedexDes708,
	},

	{.pokemon_type = _("ElderTree"),
	 .height = 15,
	 .weight = 710,
	 .pokedex_description1 = (pchar*)PokedexDes709,
	},

	{.pokemon_type = _("Pumpkin"),
	 .height = 4,
	 .weight = 50,
	 .pokedex_description1 = (pchar*)PokedexDes710,
	},

	{.pokemon_type = _("Pumpkin"),
	 .height = 9,
	 .weight = 125,
	 .pokedex_description1 = (pchar*)PokedexDes711,
	},

	{.pokemon_type = _("IceChunk"),
	 .height = 10,
	 .weight = 995,
	 .pokedex_description1 = (pchar*)PokedexDes712,
	},

	{.pokemon_type = _("Iceberg"),
	 .height = 20,
	 .weight = 5050,
	 .pokedex_description1 = (pchar*)PokedexDes713,
	},

	{.pokemon_type = _("SoundWave"),
	 .height = 5,
	 .weight = 80,
	 .pokedex_description1 = (pchar*)PokedexDes714,
	},

	{.pokemon_type = _("SoundWave"),
	 .height = 15,
	 .weight = 850,
	 .pokedex_description1 = (pchar*)PokedexDes715,
	},

	{.pokemon_type = _("Life"),
	 .height = 30,
	 .weight = 2150,
	 .pokedex_description1 = (pchar*)PokedexDes716,
	},

	{.pokemon_type = _("Destruction"),
	 .height = 58,
	 .weight = 2030,
	 .pokedex_description1 = (pchar*)PokedexDes717,
	},

	{.pokemon_type = _("Order"),
	 .height = 50,
	 .weight = 3050,
	 .pokedex_description1 = (pchar*)PokedexDes718,
	},

	{.pokemon_type = _("Jewel"),
	 .height = 7,
	 .weight = 88,
	 .pokedex_description1 = (pchar*)PokedexDes719,
	},

	{.pokemon_type = _("Mischief"),
	 .height = 5,
	 .weight = 90,
	 .pokedex_description1 = (pchar*)PokedexDes720,
	},

	{.pokemon_type = _("Steam"),
	 .height = 17,
	 .weight = 1950,
	 .pokedex_description1 = (pchar*)PokedexDes721,
	},

	{.pokemon_type = _("GrassQuill"),
	 .height = 3,
	 .weight = 15,
	 .pokedex_description1 = (pchar*)PokedexDes722,
	},

	{.pokemon_type = _("BladeQuill"),
	 .height = 7,
	 .weight = 160,
	 .pokedex_description1 = (pchar*)PokedexDes723,
	},

	{.pokemon_type = _("ArrowQuill"),
	 .height = 16,
	 .weight = 366,
	 .pokedex_description1 = (pchar*)PokedexDes724,
	},

	{.pokemon_type = _("FireCat"),
	 .height = 4,
	 .weight = 43,
	 .pokedex_description1 = (pchar*)PokedexDes725,
	},

	{.pokemon_type = _("FireCat"),
	 .height = 7,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes726,
	},

	{.pokemon_type = _("Heel"),
	 .height = 18,
	 .weight = 830,
	 .pokedex_description1 = (pchar*)PokedexDes727,
	},

	{.pokemon_type = _("SeaLion"),
	 .height = 4,
	 .weight = 75,
	 .pokedex_description1 = (pchar*)PokedexDes728,
	},

	{.pokemon_type = _("PopStar"),
	 .height = 6,
	 .weight = 175,
	 .pokedex_description1 = (pchar*)PokedexDes729,
	},

	{.pokemon_type = _("Soloist"),
	 .height = 18,
	 .weight = 440,
	 .pokedex_description1 = (pchar*)PokedexDes730,
	},

	{.pokemon_type = _("Woodpecker"),
	 .height = 3,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes731,
	},

	{.pokemon_type = _("BugleBeak"),
	 .height = 6,
	 .weight = 148,
	 .pokedex_description1 = (pchar*)PokedexDes732,
	},

	{.pokemon_type = _("Cannon"),
	 .height = 11,
	 .weight = 260,
	 .pokedex_description1 = (pchar*)PokedexDes733,
	},

	{.pokemon_type = _("Loitering"),
	 .height = 4,
	 .weight = 60,
	 .pokedex_description1 = (pchar*)PokedexDes734,
	},

	{.pokemon_type = _("Stakeout"),
	 .height = 7,
	 .weight = 142,
	 .pokedex_description1 = (pchar*)PokedexDes735,
	},

	{.pokemon_type = _("Larva"),
	 .height = 4,
	 .weight = 44,
	 .pokedex_description1 = (pchar*)PokedexDes736,
	},

	{.pokemon_type = _("Battery"),
	 .height = 5,
	 .weight = 105,
	 .pokedex_description1 = (pchar*)PokedexDes737,
	},

	{.pokemon_type = _("StagBeetle"),
	 .height = 15,
	 .weight = 450,
	 .pokedex_description1 = (pchar*)PokedexDes738,
	},

	{.pokemon_type = _("Boxing"),
	 .height = 6,
	 .weight = 70,
	 .pokedex_description1 = (pchar*)PokedexDes739,
	},

	{.pokemon_type = _("WoollyCrab"),
	 .height = 17,
	 .weight = 1800,
	 .pokedex_description1 = (pchar*)PokedexDes740,
	},

	{.pokemon_type = _("Dancing"),
	 .height = 6,
	 .weight = 34,
	 .pokedex_description1 = (pchar*)PokedexDes741,
	},

	{.pokemon_type = _("BeeFly"),
	 .height = 1,
	 .weight = 2,
	 .pokedex_description1 = (pchar*)PokedexDes742,
	},

	{.pokemon_type = _("BeeFly"),
	 .height = 2,
	 .weight = 5,
	 .pokedex_description1 = (pchar*)PokedexDes743,
	},

	{.pokemon_type = _("Puppy"),
	 .height = 5,
	 .weight = 92,
	 .pokedex_description1 = (pchar*)PokedexDes744,
	},

	{.pokemon_type = _("Wolf"),
	 .height = 8,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes745,
	},

	{.pokemon_type = _("SmallFry"),
	 .height = 2,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes746,
	},

	{.pokemon_type = _("BrutalStar"),
	 .height = 4,
	 .weight = 80,
	 .pokedex_description1 = (pchar*)PokedexDes747,
	},

	{.pokemon_type = _("BrutalStar"),
	 .height = 7,
	 .weight = 145,
	 .pokedex_description1 = (pchar*)PokedexDes748,
	},

	{.pokemon_type = _("Donkey"),
	 .height = 10,
	 .weight = 1100,
	 .pokedex_description1 = (pchar*)PokedexDes749,
	},

	{.pokemon_type = _("DraftHorse"),
	 .height = 25,
	 .weight = 9200,
	 .pokedex_description1 = (pchar*)PokedexDes750,
	},

	{.pokemon_type = _("WaterBubble"),
	 .height = 3,
	 .weight = 40,
	 .pokedex_description1 = (pchar*)PokedexDes751,
	},

	{.pokemon_type = _("WaterBubble"),
	 .height = 18,
	 .weight = 820,
	 .pokedex_description1 = (pchar*)PokedexDes752,
	},

	{.pokemon_type = _("SicklGrass"),
	 .height = 3,
	 .weight = 15,
	 .pokedex_description1 = (pchar*)PokedexDes753,
	},

	{.pokemon_type = _("BloomSickle"),
	 .height = 9,
	 .weight = 185,
	 .pokedex_description1 = (pchar*)PokedexDes754,
	},

	{.pokemon_type = _("Illuminate"),
	 .height = 2,
	 .weight = 15,
	 .pokedex_description1 = (pchar*)PokedexDes755,
	},

	{.pokemon_type = _("Illuminate"),
	 .height = 10,
	 .weight = 115,
	 .pokedex_description1 = (pchar*)PokedexDes756,
	},

	{.pokemon_type = _("ToxicLizard"),
	 .height = 6,
	 .weight = 48,
	 .pokedex_description1 = (pchar*)PokedexDes757,
	},

	{.pokemon_type = _("ToxicLizard"),
	 .height = 12,
	 .weight = 222,
	 .pokedex_description1 = (pchar*)PokedexDes758,
	},

	{.pokemon_type = _("Flailing"),
	 .height = 5,
	 .weight = 68,
	 .pokedex_description1 = (pchar*)PokedexDes759,
	},

	{.pokemon_type = _("StrongArm"),
	 .height = 21,
	 .weight = 1350,
	 .pokedex_description1 = (pchar*)PokedexDes760,
	},

	{.pokemon_type = _("Fruit"),
	 .height = 3,
	 .weight = 32,
	 .pokedex_description1 = (pchar*)PokedexDes761,
	},

	{.pokemon_type = _("Fruit"),
	 .height = 7,
	 .weight = 82,
	 .pokedex_description1 = (pchar*)PokedexDes762,
	},

	{.pokemon_type = _("Fruit"),
	 .height = 12,
	 .weight = 214,
	 .pokedex_description1 = (pchar*)PokedexDes763,
	},

	{.pokemon_type = _("PosyPicker"),
	 .height = 1,
	 .weight = 3,
	 .pokedex_description1 = (pchar*)PokedexDes764,
	},

	{.pokemon_type = _("Sage"),
	 .height = 15,
	 .weight = 760,
	 .pokedex_description1 = (pchar*)PokedexDes765,
	},

	{.pokemon_type = _("Teamwork"),
	 .height = 20,
	 .weight = 828,
	 .pokedex_description1 = (pchar*)PokedexDes766,
	},

	{.pokemon_type = _("TurnTail"),
	 .height = 5,
	 .weight = 120,
	 .pokedex_description1 = (pchar*)PokedexDes767,
	},

	{.pokemon_type = _("HardScale"),
	 .height = 20,
	 .weight = 1080,
	 .pokedex_description1 = (pchar*)PokedexDes768,
	},

	{.pokemon_type = _("SandHeap"),
	 .height = 5,
	 .weight = 700,
	 .pokedex_description1 = (pchar*)PokedexDes769,
	},

	{.pokemon_type = _("SandCastle"),
	 .height = 13,
	 .weight = 2500,
	 .pokedex_description1 = (pchar*)PokedexDes770,
	},

	{.pokemon_type = _("SeaCucumber"),
	 .height = 3,
	 .weight = 12,
	 .pokedex_description1 = (pchar*)PokedexDes771,
	},

	{.pokemon_type = _("Synthetic"),
	 .height = 19,
	 .weight = 1205,
	 .pokedex_description1 = (pchar*)PokedexDes772,
	},

	{.pokemon_type = _("Synthetic"),
	 .height = 23,
	 .weight = 1005,
	 .pokedex_description1 = (pchar*)PokedexDes773,
	},

	{.pokemon_type = _("Meteor"),
	 .height = 3,
	 .weight = 400,
	 .pokedex_description1 = (pchar*)PokedexDes774,
	},

	{.pokemon_type = _("Drowsing"),
	 .height = 4,
	 .weight = 199,
	 .pokedex_description1 = (pchar*)PokedexDes775,
	},

	{.pokemon_type = _("BlastTurtle"),
	 .height = 20,
	 .weight = 2120,
	 .pokedex_description1 = (pchar*)PokedexDes776,
	},

	{.pokemon_type = _("Roly-Poly"),
	 .height = 3,
	 .weight = 33,
	 .pokedex_description1 = (pchar*)PokedexDes777,
	},

	{.pokemon_type = _("Disguise"),
	 .height = 2,
	 .weight = 7,
	 .pokedex_description1 = (pchar*)PokedexDes778,
	},

	{.pokemon_type = _("GnashTeeth"),
	 .height = 9,
	 .weight = 190,
	 .pokedex_description1 = (pchar*)PokedexDes779,
	},

	{.pokemon_type = _("Placid"),
	 .height = 30,
	 .weight = 1850,
	 .pokedex_description1 = (pchar*)PokedexDes780,
	},

	{.pokemon_type = _("SeaCreeper"),
	 .height = 39,
	 .weight = 2100,
	 .pokedex_description1 = (pchar*)PokedexDes781,
	},

	{.pokemon_type = _("Scaly"),
	 .height = 6,
	 .weight = 297,
	 .pokedex_description1 = (pchar*)PokedexDes782,
	},

	{.pokemon_type = _("Scaly"),
	 .height = 12,
	 .weight = 470,
	 .pokedex_description1 = (pchar*)PokedexDes783,
	},

	{.pokemon_type = _("Scaly"),
	 .height = 16,
	 .weight = 782,
	 .pokedex_description1 = (pchar*)PokedexDes784,
	},

	{.pokemon_type = _("LandSpirit"),
	 .height = 18,
	 .weight = 205,
	 .pokedex_description1 = (pchar*)PokedexDes785,
	},

	{.pokemon_type = _("LandSpirit"),
	 .height = 12,
	 .weight = 186,
	 .pokedex_description1 = (pchar*)PokedexDes786,
	},

	{.pokemon_type = _("LandSpirit"),
	 .height = 19,
	 .weight = 455,
	 .pokedex_description1 = (pchar*)PokedexDes787,
	},

	{.pokemon_type = _("LandSpirit"),
	 .height = 13,
	 .weight = 212,
	 .pokedex_description1 = (pchar*)PokedexDes788,
	},

	{.pokemon_type = _("Nebula"),
	 .height = 2,
	 .weight = 1,
	 .pokedex_description1 = (pchar*)PokedexDes789,
	},

	{.pokemon_type = _("Protostar"),
	 .height = 1,
	 .weight = 9999,
	 .pokedex_description1 = (pchar*)PokedexDes790,
	},

	{.pokemon_type = _("Sunne"),
	 .height = 34,
	 .weight = 2300,
	 .pokedex_description1 = (pchar*)PokedexDes791,
	},

	{.pokemon_type = _("Moone"),
	 .height = 40,
	 .weight = 1200,
	 .pokedex_description1 = (pchar*)PokedexDes792,
	},

	{.pokemon_type = _("Parasite"),
	 .height = 12,
	 .weight = 555,
	 .pokedex_description1 = (pchar*)PokedexDes793,
	},

	{.pokemon_type = _("Swollen"),
	 .height = 24,
	 .weight = 3336,
	 .pokedex_description1 = (pchar*)PokedexDes794,
	},

	{.pokemon_type = _("Lissome"),
	 .height = 18,
	 .weight = 250,
	 .pokedex_description1 = (pchar*)PokedexDes795,
	},

	{.pokemon_type = _("Glowing"),
	 .height = 38,
	 .weight = 1000,
	 .pokedex_description1 = (pchar*)PokedexDes796,
	},

	{.pokemon_type = _("Launch"),
	 .height = 92,
	 .weight = 9999,
	 .pokedex_description1 = (pchar*)PokedexDes797,
	},

	{.pokemon_type = _("DrawnSword"),
	 .height = 3,
	 .weight = 1,
	 .pokedex_description1 = (pchar*)PokedexDes798,
	},

	{.pokemon_type = _("Junkivore"),
	 .height = 55,
	 .weight = 8880,
	 .pokedex_description1 = (pchar*)PokedexDes799,
	},

	{.pokemon_type = _("Prism"),
	 .height = 24,
	 .weight = 2300,
	 .pokedex_description1 = (pchar*)PokedexDes800,
	},

	{.pokemon_type = _("Artificial"),
	 .height = 10,
	 .weight = 805,
	 .pokedex_description1 = (pchar*)PokedexDes801,
	},

	{.pokemon_type = _("Gloomdwelle"),
	 .height = 7,
	 .weight = 222,
	 .pokedex_description1 = (pchar*)PokedexDes802,
	},

	{.pokemon_type = _("PoisonPin"),
	 .height = 6,
	 .weight = 18,
	 .pokedex_description1 = (pchar*)PokedexDes803,
	},

	{.pokemon_type = _("PoisonPin"),
	 .height = 36,
	 .weight = 1500,
	 .pokedex_description1 = (pchar*)PokedexDes804,
	},

	{.pokemon_type = _("Rampart"),
	 .height = 55,
	 .weight = 8200,
	 .pokedex_description1 = (pchar*)PokedexDes805,
	},

	{.pokemon_type = _("Fireworks"),
	 .height = 18,
	 .weight = 130,
	 .pokedex_description1 = (pchar*)PokedexDes806,
	},

	{.pokemon_type = _("Thunderclap"),
	 .height = 15,
	 .weight = 445,
	 .pokedex_description1 = (pchar*)PokedexDes807,
	}
};
#endif


	